Script started on 2020-02-05 21:28:37-05:00 [TERM="xterm" TTY="/dev/pts/2" COLUMNS="100" LINES="35"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
amchugh2@remote06:~/i240b/submit/lab2$ ls
lab2.LOG
amchugh2@remote06:~/i240b/submit/lab2$ git pull[K[K[K[K[K[K[K[Kcd 
amchugh2@remote06:~$ ls
amchugh2.circ  cs120lab7  Downloads	  i220a.bak  lab2	lab8	  Templates
Arduino        cs220	  git-repos	  i220a_new  lab2final	Music	  tmp
cs120	       cs240	  git-repos_copy  i220X      lab2good	Pictures  toneMelody
cs120lab4      Desktop	  good		  i240b      lab3	projects  Videos
cs120lab6      Documents  i220a		  lab	     lab5	Public
amchugh2@remote06:~$ cd cs240
amchugh2@remote06:~/cs240$ git pull
/home/amchugh2/.bashrc: line 1: /home/umrigar/cs240/bin/student.rc: Permission denied
remote: Enumerating objects: 105, done.[K
remote: Counting objects:   0% (1/105)   [Kremote: Counting objects:   1% (2/105)   [Kremote: Counting objects:   2% (3/105)   [Kremote: Counting objects:   3% (4/105)   [Kremote: Counting objects:   4% (5/105)   [Kremote: Counting objects:   5% (6/105)   [Kremote: Counting objects:   6% (7/105)   [Kremote: Counting objects:   7% (8/105)   [Kremote: Counting objects:   8% (9/105)   [Kremote: Counting objects:   9% (10/105)   [Kremote: Counting objects:  10% (11/105)   [Kremote: Counting objects:  11% (12/105)   [Kremote: Counting objects:  12% (13/105)   [Kremote: Counting objects:  13% (14/105)   [Kremote: Counting objects:  14% (15/105)   [Kremote: Counting objects:  15% (16/105)   [Kremote: Counting objects:  16% (17/105)   [Kremote: Counting objects:  17% (18/105)   [Kremote: Counting objects:  18% (19/105)   [Kremote: Counting objects:  19% (20/105)   [Kremote: Counting objects:  20% (21/105)   [Kremote: Counting objects:  21% (23/105)   [Kremote: Counting objects:  22% (24/105)   [Kremote: Counting objects:  23% (25/105)   [Kremote: Counting objects:  24% (26/105)   [Kremote: Counting objects:  25% (27/105)   [Kremote: Counting objects:  26% (28/105)   [Kremote: Counting objects:  27% (29/105)   [Kremote: Counting objects:  28% (30/105)   [Kremote: Counting objects:  29% (31/105)   [Kremote: Counting objects:  30% (32/105)   [Kremote: Counting objects:  31% (33/105)   [Kremote: Counting objects:  32% (34/105)   [Kremote: Counting objects:  33% (35/105)   [Kremote: Counting objects:  34% (36/105)   [Kremote: Counting objects:  35% (37/105)   [Kremote: Counting objects:  36% (38/105)   [Kremote: Counting objects:  37% (39/105)   [Kremote: Counting objects:  38% (40/105)   [Kremote: Counting objects:  39% (41/105)   [Kremote: Counting objects:  40% (42/105)   [Kremote: Counting objects:  41% (44/105)   [Kremote: Counting objects:  42% (45/105)   [Kremote: Counting objects:  43% (46/105)   [Kremote: Counting objects:  44% (47/105)   [Kremote: Counting objects:  45% (48/105)   [Kremote: Counting objects:  46% (49/105)   [Kremote: Counting objects:  47% (50/105)   [Kremote: Counting objects:  48% (51/105)   [Kremote: Counting objects:  49% (52/105)   [Kremote: Counting objects:  50% (53/105)   [Kremote: Counting objects:  51% (54/105)   [Kremote: Counting objects:  52% (55/105)   [Kremote: Counting objects:  53% (56/105)   [Kremote: Counting objects:  54% (57/105)   [Kremote: Counting objects:  55% (58/105)   [Kremote: Counting objects:  56% (59/105)   [Kremote: Counting objects:  57% (60/105)   [Kremote: Counting objects:  58% (61/105)   [Kremote: Counting objects:  59% (62/105)   [Kremote: Counting objects:  60% (63/105)   [Kremote: Counting objects:  61% (65/105)   [Kremote: Counting objects:  62% (66/105)   [Kremote: Counting objects:  63% (67/105)   [Kremote: Counting objects:  64% (68/105)   [Kremote: Counting objects:  65% (69/105)   [Kremote: Counting objects:  66% (70/105)   [Kremote: Counting objects:  67% (71/105)   [Kremote: Counting objects:  68% (72/105)   [Kremote: Counting objects:  69% (73/105)   [Kremote: Counting objects:  70% (74/105)   [Kremote: Counting objects:  71% (75/105)   [Kremote: Counting objects:  72% (76/105)   [Kremote: Counting objects:  73% (77/105)   [Kremote: Counting objects:  74% (78/105)   [Kremote: Counting objects:  75% (79/105)   [Kremote: Counting objects:  76% (80/105)   [Kremote: Counting objects:  77% (81/105)   [Kremote: Counting objects:  78% (82/105)   [Kremote: Counting objects:  79% (83/105)   [Kremote: Counting objects:  80% (84/105)   [Kremote: Counting objects:  81% (86/105)   [Kremote: Counting objects:  82% (87/105)   [Kremote: Counting objects:  83% (88/105)   [Kremote: Counting objects:  84% (89/105)   [Kremote: Counting objects:  85% (90/105)   [Kremote: Counting objects:  86% (91/105)   [Kremote: Counting objects:  87% (92/105)   [Kremote: Counting objects:  88% (93/105)   [Kremote: Counting objects:  89% (94/105)   [Kremote: Counting objects:  90% (95/105)   [Kremote: Counting objects:  91% (96/105)   [Kremote: Counting objects:  92% (97/105)   [Kremote: Counting objects:  93% (98/105)   [Kremote: Counting objects:  94% (99/105)   [Kremote: Counting objects:  95% (100/105)   [Kremote: Counting objects:  96% (101/105)   [Kremote: Counting objects:  97% (102/105)   [Kremote: Counting objects:  98% (103/105)   [Kremote: Counting objects:  99% (104/105)   [Kremote: Counting objects: 100% (105/105)   [Kremote: Counting objects: 100% (105/105), done.[K
remote: Compressing objects:   1% (1/84)   [Kremote: Compressing objects:   2% (2/84)   [Kremote: Compressing objects:   3% (3/84)   [Kremote: Compressing objects:   4% (4/84)   [Kremote: Compressing objects:   5% (5/84)   [Kremote: Compressing objects:   7% (6/84)   [Kremote: Compressing objects:   8% (7/84)   [Kremote: Compressing objects:   9% (8/84)   [Kremote: Compressing objects:  10% (9/84)   [Kremote: Compressing objects:  11% (10/84)   [Kremote: Compressing objects:  13% (11/84)   [Kremote: Compressing objects:  14% (12/84)   [Kremote: Compressing objects:  15% (13/84)   [Kremote: Compressing objects:  16% (14/84)   [Kremote: Compressing objects:  17% (15/84)   [Kremote: Compressing objects:  19% (16/84)   [Kremote: Compressing objects:  20% (17/84)   [Kremote: Compressing objects:  21% (18/84)   [Kremote: Compressing objects:  22% (19/84)   [Kremote: Compressing objects:  23% (20/84)   [Kremote: Compressing objects:  25% (21/84)   [Kremote: Compressing objects:  26% (22/84)   [Kremote: Compressing objects:  27% (23/84)   [Kremote: Compressing objects:  28% (24/84)   [Kremote: Compressing objects:  29% (25/84)   [Kremote: Compressing objects:  30% (26/84)   [Kremote: Compressing objects:  32% (27/84)   [Kremote: Compressing objects:  33% (28/84)   [Kremote: Compressing objects:  34% (29/84)   [Kremote: Compressing objects:  35% (30/84)   [Kremote: Compressing objects:  36% (31/84)   [Kremote: Compressing objects:  38% (32/84)   [Kremote: Compressing objects:  39% (33/84)   [Kremote: Compressing objects:  40% (34/84)   [Kremote: Compressing objects:  41% (35/84)   [Kremote: Compressing objects:  42% (36/84)   [Kremote: Compressing objects:  44% (37/84)   [Kremote: Compressing objects:  45% (38/84)   [Kremote: Compressing objects:  46% (39/84)   [Kremote: Compressing objects:  47% (40/84)   [Kremote: Compressing objects:  48% (41/84)   [Kremote: Compressing objects:  50% (42/84)   [Kremote: Compressing objects:  51% (43/84)   [Kremote: Compressing objects:  52% (44/84)   [Kremote: Compressing objects:  53% (45/84)   [Kremote: Compressing objects:  54% (46/84)   [Kremote: Compressing objects:  55% (47/84)   [Kremote: Compressing objects:  57% (48/84)   [Kremote: Compressing objects:  58% (49/84)   [Kremote: Compressing objects:  59% (50/84)   [Kremote: Compressing objects:  60% (51/84)   [Kremote: Compressing objects:  61% (52/84)   [Kremote: Compressing objects:  63% (53/84)   [Kremote: Compressing objects:  64% (54/84)   [Kremote: Compressing objects:  65% (55/84)   [Kremote: Compressing objects:  66% (56/84)   [Kremote: Compressing objects:  67% (57/84)   [Kremote: Compressing objects:  69% (58/84)   [Kremote: Compressing objects:  70% (59/84)   [Kremote: Compressing objects:  71% (60/84)   [Kremote: Compressing objects:  72% (61/84)   [Kremote: Compressing objects:  73% (62/84)   [Kremote: Compressing objects:  75% (63/84)   [Kremote: Compressing objects:  76% (64/84)   [Kremote: Compressing objects:  77% (65/84)   [Kremote: Compressing objects:  78% (66/84)   [Kremote: Compressing objects:  79% (67/84)   [Kremote: Compressing objects:  80% (68/84)   [Kremote: Compressing objects:  82% (69/84)   [Kremote: Compressing objects:  83% (70/84)   [Kremote: Compressing objects:  84% (71/84)   [Kremote: Compressing objects:  85% (72/84)   [Kremote: Compressing objects:  86% (73/84)   [Kremote: Compressing objects:  88% (74/84)   [Kremote: Compressing objects:  89% (75/84)   [Kremote: Compressing objects:  90% (76/84)   [Kremote: Compressing objects:  91% (77/84)   [Kremote: Compressing objects:  92% (78/84)   [Kremote: Compressing objects:  94% (79/84)   [Kremote: Compressing objects:  95% (80/84)   [Kremote: Compressing objects:  96% (81/84)   [Kremote: Compressing objects:  97% (82/84)   [Kremote: Compressing objects:  98% (83/84)   [Kremote: Compressing objects: 100% (84/84)   [Kremote: Compressing objects: 100% (84/84), done.[K
Unpacking objects:   1% (1/90)   Unpacking objects:   2% (2/90)   Unpacking objects:   3% (3/90)   Unpacking objects:   4% (4/90)   Unpacking objects:   5% (5/90)   Unpacking objects:   6% (6/90)   Unpacking objects:   7% (7/90)   Unpacking objects:   8% (8/90)   Unpacking objects:  10% (9/90)   Unpacking objects:  11% (10/90)   Unpacking objects:  12% (11/90)   Unpacking objects:  13% (12/90)   Unpacking objects:  14% (13/90)   Unpacking objects:  15% (14/90)   Unpacking objects:  16% (15/90)   Unpacking objects:  17% (16/90)   Unpacking objects:  18% (17/90)   Unpacking objects:  20% (18/90)   Unpacking objects:  21% (19/90)   Unpacking objects:  22% (20/90)   Unpacking objects:  23% (21/90)   Unpacking objects:  24% (22/90)   Unpacking objects:  25% (23/90)   Unpacking objects:  26% (24/90)   Unpacking objects:  27% (25/90)   Unpacking objects:  28% (26/90)   Unpacking objects:  30% (27/90)   Unpacking objects:  31% (28/90)   Unpacking objects:  32% (29/90)   Unpacking objects:  33% (30/90)   Unpacking objects:  34% (31/90)   Unpacking objects:  35% (32/90)   Unpacking objects:  36% (33/90)   Unpacking objects:  37% (34/90)   Unpacking objects:  38% (35/90)   Unpacking objects:  40% (36/90)   Unpacking objects:  41% (37/90)   Unpacking objects:  42% (38/90)   Unpacking objects:  43% (39/90)   Unpacking objects:  44% (40/90)   Unpacking objects:  45% (41/90)   Unpacking objects:  46% (42/90)   Unpacking objects:  47% (43/90)   Unpacking objects:  48% (44/90)   Unpacking objects:  50% (45/90)   remote: Total 90 (delta 49), reused 0 (delta 0)[K
Unpacking objects:  51% (46/90)   Unpacking objects:  52% (47/90)   Unpacking objects:  53% (48/90)   Unpacking objects:  54% (49/90)   Unpacking objects:  55% (50/90)   Unpacking objects:  56% (51/90)   Unpacking objects:  57% (52/90)   Unpacking objects:  58% (53/90)   Unpacking objects:  60% (54/90)   Unpacking objects:  61% (55/90)   Unpacking objects:  62% (56/90)   Unpacking objects:  63% (57/90)   Unpacking objects:  64% (58/90)   Unpacking objects:  65% (59/90)   Unpacking objects:  66% (60/90)   Unpacking objects:  67% (61/90)   Unpacking objects:  68% (62/90)   Unpacking objects:  70% (63/90)   Unpacking objects:  71% (64/90)   Unpacking objects:  72% (65/90)   Unpacking objects:  73% (66/90)   Unpacking objects:  74% (67/90)   Unpacking objects:  75% (68/90)   Unpacking objects:  76% (69/90)   Unpacking objects:  77% (70/90)   Unpacking objects:  78% (71/90)   Unpacking objects:  80% (72/90)   Unpacking objects:  81% (73/90)   Unpacking objects:  82% (74/90)   Unpacking objects:  83% (75/90)   Unpacking objects:  84% (76/90)   Unpacking objects:  85% (77/90)   Unpacking objects:  86% (78/90)   Unpacking objects:  87% (79/90)   Unpacking objects:  88% (80/90)   Unpacking objects:  90% (81/90)   Unpacking objects:  91% (82/90)   Unpacking objects:  92% (83/90)   Unpacking objects:  93% (84/90)   Unpacking objects:  94% (85/90)   Unpacking objects:  95% (86/90)   Unpacking objects:  96% (87/90)   Unpacking objects:  97% (88/90)   Unpacking objects:  98% (89/90)   Unpacking objects: 100% (90/90)   Unpacking objects: 100% (90/90), done.
From ssh://remote.cs.binghamton.edu/~umrigar/git-repos/cs240
   0b7b862..5dd8253  master     -> origin/master
Updating 0b7b862..5dd8253
Fast-forward
 index.html                                  |  24 [32m++[m[31m--[m
 index.umt                                   |   6 [32m+[m
 labs/index.html                             |   4 [32m+[m[31m-[m
 labs/index.umt                              |   9 [32m+[m[31m-[m
 labs/lab2/exercises/.gitignore              |   1 [32m+[m
 labs/lab2/exercises/1-hello/.gitignore      |   1 [32m+[m
 labs/lab2/exercises/1-hello/Makefile        |   3 [32m+[m
 labs/lab2/exercises/1-hello/README          |   1 [32m+[m
 labs/lab2/exercises/1-hello/hello.cc        |  22 [32m+++[m
 labs/lab2/exercises/2-hello/.gitignore      |   1 [32m+[m
 labs/lab2/exercises/2-hello/Makefile        |   3 [32m+[m
 labs/lab2/exercises/2-hello/README          |   4 [32m+[m
 labs/lab2/exercises/2-hello/hello.cc        |  48 [32m+++++++[m
 labs/lab2/exercises/3-overload/.gitignore   |   1 [32m+[m
 labs/lab2/exercises/3-overload/Makefile     |   3 [32m+[m
 labs/lab2/exercises/3-overload/overload.cc  |  16 [32m+++[m
 labs/lab2/exercises/Makefile                |   2 [32m+[m
 labs/lab2/lab2.html                         | 257 [32m++++++++++++++++++++++++++++++++++[m
 labs/lab2/lab2.pdf                          | Bin [31m0[m -> [32m93531[m bytes
 labs/lab2/lab2.umt                          | 358 [32m++++++++++++++++++++++++++++++++++++++++++++++++[m
 labs/lab2/lab2/hl-fine_blue.css             |  19 [32m+++[m
 labs/lab2/lab2/hl-fine_blue.sty             |  19 [32m+++[m
 labs/submission/submission/hl-fine_blue.css |   2 [32m+[m[31m-[m
 labs/submission/submission/hl-fine_blue.sty |   2 [32m+[m[31m-[m
 slides/c++-intro/c++-intro.html             | 228 [32m++++++++++++++++++++++++[m[31m------[m
 slides/c++-intro/c++-intro.pdf              | Bin [31m167175[m -> [32m201292[m bytes
 slides/c++-intro/c++-intro.umt              | 148 [32m++++++++++++++++++[m[31m--[m
 slides/c++-intro/c++-intro/hl-fine_blue.css |   2 [32m+[m[31m-[m
 slides/c++-intro/c++-intro/hl-fine_blue.sty |   2 [32m+[m[31m-[m
 slides/c++-intro/code/.gitignore            |   6 [32m+[m
 slides/c++-intro/code/Makefile              |  12 [32m+[m[31m-[m
 slides/c++-intro/code/alloc-dealloc.cc      |  26 [32m++++[m
 slides/c++-intro/code/class-point.cc        |  33 [32m+++++[m
 slides/c++-intro/code/struct-point.cc       |  31 [32m+++++[m
 slides/c++-intro/code/sum-array.cc          |  14 [32m+[m[31m-[m
 slides/c++-intro/code/vec1.cc               |  40 [32m++++++[m
 36 files changed, 1266 insertions(+), 82 deletions(-)
 create mode 100644 labs/lab2/exercises/.gitignore
 create mode 100644 labs/lab2/exercises/1-hello/.gitignore
 create mode 100644 labs/lab2/exercises/1-hello/Makefile
 create mode 100644 labs/lab2/exercises/1-hello/README
 create mode 100644 labs/lab2/exercises/1-hello/hello.cc
 create mode 100644 labs/lab2/exercises/2-hello/.gitignore
 create mode 100644 labs/lab2/exercises/2-hello/Makefile
 create mode 100644 labs/lab2/exercises/2-hello/README
 create mode 100644 labs/lab2/exercises/2-hello/hello.cc
 create mode 100644 labs/lab2/exercises/3-overload/.gitignore
 create mode 100644 labs/lab2/exercises/3-overload/Makefile
 create mode 100644 labs/lab2/exercises/3-overload/overload.cc
 create mode 100644 labs/lab2/exercises/Makefile
 create mode 100644 labs/lab2/lab2.html
 create mode 100644 labs/lab2/lab2.pdf
 create mode 100644 labs/lab2/lab2.umt
 create mode 100644 labs/lab2/lab2/hl-fine_blue.css
 create mode 100644 labs/lab2/lab2/hl-fine_blue.sty
 create mode 100644 slides/c++-intro/code/.gitignore
 create mode 100644 slides/c++-intro/code/alloc-dealloc.cc
 create mode 100644 slides/c++-intro/code/class-point.cc
 create mode 100644 slides/c++-intro/code/struct-point.cc
 create mode 100644 slides/c++-intro/code/vec1.cc
amchugh2@remote06:~/cs240$ ls
announce.html  assets  exams-quizzes  hws	  index.umt  misc      README.md  umt.make
announce.umt   docs    exercises      index.html  labs	     projects  slides
amchugh2@remote06:~/cs240$ cd 
amchugh2@remote06:~$ ls
amchugh2.circ  cs120lab7  Downloads	  i220a.bak  lab2	lab8	  Templates
Arduino        cs220	  git-repos	  i220a_new  lab2final	Music	  tmp
cs120	       cs240	  git-repos_copy  i220X      lab2good	Pictures  toneMelody
cs120lab4      Desktop	  good		  i240b      lab3	projects  Videos
cs120lab6      Documents  i220a		  lab	     lab5	Public
amchugh2@remote06:~$ cd i240b/submitla[K[K/lab2
amchugh2@remote06:~/i240b/submit/lab2$ cp[K[Kls
lab2.LOG
amchugh2@remote06:~/i240b/submit/lab2$ cd[Kp [K[K[Kcp -r !/[K[K[K[Kt [K[Kr ~/csw0[K[K240/labs/lab2/exercizes[K[K[Kses-[K/* .
amchugh2@remote06:~/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
amchugh2@remote06:~/i240b/submit/lab2$ cd exerciz[Kses 1[K[K[Ks1[K/1[K1-hello
bash: cd: exercises/1-hello: No such file or directory
amchugh2@remote06:~/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
amchugh2@remote06:~/i240b/submit/lab2$ cd 1-hello
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ls
hello.cc  Makefile  README
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ vim README
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;35r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[35;1H"README" 1L, 61C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HPrint out a line saying hello to each command-line argument.
[1m[34m~                                                                                                   [3;1H~                                                                                                   [4;1H~                                                                                                   [5;1H~                                                                                                   [6;1H~                                                                                                   [7;1H~                                                                                                   [8;1H~                                                                                                   [9;1H~                                                                                                   [10;1H~                                                                                                   [11;1H~                                                                                                   [12;1H~                                                                                                   [13;1H~                                                                                                   [14;1H~                                                                                                   [15;1H~                                                                                                   [16;1H~                                                                                                   [17;1H~                                                                                                   [18;1H~                                                                                                   [19;1H~                                                                                                   [20;1H~                                                                                                   [21;1H~                                                                                                   [22;1H~                                                                                                   [23;1H~                                                                                                   [24;1H~                                                                                                   [25;1H~                                                                                                   [26;1H~                                                                                                   [27;1H~                                                                                                   [28;1H~                                                                                                   [29;1H~                                                                                                   [30;1H~                                                                                                   [31;1H~                                                                                                   [32;1H~                                                                                                   [33;1H~                                                                                                   [34;1H~                                                                                                   [m[35;83H1,1[11CAll[1;1H[?25h[?25l[35;73H:[1;1H[35;1H[K[35;1H:[?2004h[?25hx[?25l[?25h[?25l[?1000l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[35;1H[K[35;1H[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@remote06:~/i240b/submit/lab2/1-hello$ ./hello
bash: ./hello: No such file or directory
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ./hello
usage: ./hello NAME...
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ hello[K[K[K[K[K./ [Khello Abby McHugh![K[K[K[K[K[K[K[K[Ky!
hello Abby!
hello amchugh2@remote06:~/i240b/submit/lab2/1-hello$ h[Khello [K abby[K[K[K[KAbby John[K[K[K[K[KB[K Ben
bash: hello: command not found
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ .[K./hello Abby Ben
hello Abby
hello Ben
hello amchugh2@remote06:~/i240b/submit/lab2/1-hello$ gd [Kb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe858) at hello.cc:13
13	  if (argc == 1) {
(gdb) [K(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) b sayHello()
Function "sayHello()" not defined.
Make breakpoint pending on future shared library load? (y or [n]) p argc[K[K[K[K[K[Ky
Breakpoint 2 (sayHello()) pending.
(gdb) b sayHello)[K()
Function "sayHello()" not defined.
Make breakpoint pending on future shared library load? (y or [n]) n
(gdb) q
A debugging session is active.

	Inferior 1 [process 2306793] will be killed.

Quit anyway? (y or n) y
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ gdb e[Khello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa[Ka[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kstart bart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe868)
    at hello.cc:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) 
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l 2
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) b sy[KayHello
Breakpoint 2 at 0x555555555181: file hello.cc, line 7.
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe868
(gdb) p argv[0]
$3 = 0x7fffffffead0 "/import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-hello/hello"
(gdb) p argv[1]
$4 = 0x7fffffffeb16 "bart"
(gdb) p *argv@3
$5 = {
  0x7fffffffead0 "/import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-hello/hello", 0x7fffffffeb16 "bart", 0x7fffffffeb1b "lisa"}
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) p i
$6 = 0
(gdb) c
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffeb16 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) l
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) backtrace
#0  sayHello (name=0x7fffffffeb16 "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe868)
    at hello.cc:19
(gdb) argc[K[K[K[Kp argc
No symbol "argc" in current context.
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe868)
    at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p argc
$7 = 3
(gdb) down
#0  sayHello (name=0x7fffffffeb16 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$8 = 0x7fffffffeb16 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, sayHello (name=0x7fffffffeb1b "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) c
Continuing.
hello lisa

Breakpoint 2, sayHello (name=0x0) at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe868)
    at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p i
$9 = 3
(gdb) p argc
$10 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 2307503] will be killed.

Quit anyway? (y or n) y
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ls
hello  hello.cc  Makefile  README
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ vim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;36r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[36;1H"hello.cc" 22L, 363C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"hello "[m << name << std::endl;
}

[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [33mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [33melse[m {
    [33mfor[m ([32mint[m i = [31m1[m; i <= argc; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[1m[34m~                                                                        [24;1H~                                                                        [25;1H~                                                                        [26;1H~                                                                        [27;1H~                                                                        [28;1H~                                                                        [29;1H~                                                                        [30;1H~                                                                        [31;1H~                                                                        [32;1H~                                                                        [33;1H~                                                                        [34;1H~                                                                        [35;1H~                                                                        [m[36;56H1,1[11CAll[1;1H[?25h[?25l[36;46H~@k[1;1H[36;46H   [2;1H[36;56H2[2;1H[?25h[?25l[36;46H~@k[2;1H[36;46H   [3;1H[36;56H3,0-1[3;1H[?25h[?25l[36;46H~@k[3;1H[36;46H   [4;1H[36;56H4,1  [4;1H[?25h[?25l[36;46H~@k[4;1H[36;46H   [5;1H[36;56H5[5;1H[?25h[?25l[36;46H~@k[5;1H[36;46H   [6;1H[46m{

}[m[36;56H6[6;1H[?25h[?25l[36;46H~@k[6;1H[36;46H   [7;1H[6;1H{

}[36;56H7[7;1H[?25h[?25l[36;46H~@k[7;1H[36;46H   [8;1H[6;1H[46m{

}[m[36;56H8[8;1H[?25h[?25l[6;1H{

}[36;56H9,0-1[9;1H[?25h[?25l[36;46H~@k[9;1H[36;46H   [10;1H[36;56H10,1 [10;1H[?25h[?25l[36;46H~@k[10;1H[36;46H   [11;1H[36;57H1[11;1H[?25h[?25l[36;46H~@k[11;1H[36;46H   [12;1H[46m{[22;1H}[m[36;57H2[12;1H[?25h[?25l[36;46H~@k[12;1H[36;46H   [13;1H[12;1H{[22;1H}[36;57H3[13;1H[?25h[?25l[36;46H~@k[13;1H[36;46H   [14;1H[36;57H4[14;1H[?25h[?25l[36;46H~@k[14;1H[36;46H   [15;1H[36;57H5[15;1H[?25h[?25l[36;46H~@k[15;1H[36;46H   [16;1H[36;57H6[16;1H[?25h[?25l[36;46H~@k[16;1H[36;46H   [17;1H[36;57H7[17;1H[?25h[?25l[36;46H~@k[17;1H[36;46H   [18;1H[36;57H8[18;1H[?25h[?25l[36;46H~@k[18;1H[36;46H   [19;1H[36;57H9[19;1H[?25h[?25l[36;46H~@k[19;1H[36;46H   [20;1H[36;56H20[20;1H[?25h[?25l[36;46H~@k[20;1H[36;46H   [21;1H[36;57H1[21;1H[?25h[?25l[36;46H~@k[21;1H[36;46H   [20;1H[36;57H0[20;1H[?25h[?25l[36;46H~@k[20;1H[36;46H   [19;1H[36;56H19[19;1H[?25h[?25l[36;46H~@k[19;1H[36;46H   [18;1H[36;57H8[18;1H[?25h[?25l[36;46H~@k[18;1H[36;46H   [18;1H[36;1H[1m-- INSERT --[m[36;13H[K[36;56H18,1[10CAll[18;1H[?25h[?25l[36;59H2[18;2H[?25h[?25l[36;59H3[18;3H[?25h[?25l[36;59H4[18;4H[?25h[?25l[36;59H5[18;5H[?25h[?25l[36;59H6[18;6H[?25h[?25l[36;59H7[18;7H[?25h[?25l[36;59H8[18;8H[?25h[?25l [46m([25C)[m[36;59H9[18;9H[?25h[?25l[36;59H10[18;10H[?25h[?25l([25C)[36;60H1[18;11H[?25h[?25l[36;60H2[18;12H[?25h[?25l[36;60H3[18;13H[?25h[?25l[36;60H4[18;14H[?25h[?25l[36;60H5[18;15H[?25h[?25l[36;60H6[18;16H[?25h[?25l[36;60H7[18;17H[?25h[?25l[36;60H8[18;18H[?25h[?25l[36;60H9[18;19H[?25h[?25l[36;59H20[18;20H[?25h[?25l[36;60H1[18;21H[?25h[?25l[36;60H2[18;22H[?25h[?25l[36;60H3[18;23H[?25h[?25l[36;60H4[18;24H[?25h[?25l[36;60H5[18;25H[?25h[?25l[36;60H6[18;26H[?25h[?25l[36;60H7[18;27H[?25h[?25l[36;60H6[18;26H[?25h[?25l(argc; i++) {[18;26H[46m([9C)[m[36;60H7[18;27H[?25h[?25l([9C)[36;60H8[18;28H[?25h[?25l[36;60H9[18;29H[?25h[?25l[36;59H30[18;30H[?25h[?25l[36;60H1[18;31H[?25h[?25l-; i++) {[36;60H2[18;32H[?25h[?25l[31m1[m; i++) {[36;60H3[18;33H[?25h[?25l); i++) {[18;26H[46m([6C)[m[36;60H4[18;34H[?25h[36;1H[K[18;33H[?25l[36;46H^[[18;33H[36;46H  [18;34H[36;56H18,33[9CAll[18;33H[?25h[?25l[36;46H:[18;33H[36;46H[K[36;1H:[?2004h[?25hx[?25l[?25h[?25l[?1000l[?2004l"hello.cc" 22L, 367C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@remote06:~/i240b/submit/lab2/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ./hello st[K[Kbart lisa
hello bart
hello lisa
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ cd ..
amchugh2@remote06:~/i240b/submit/lab2$ s[Kls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
amchugh2@remote06:~/i240b/submit/lab2$ cd[K[Kcd 2-hello
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./[K[K./hello lisa bart
Hello Lisa
Hello Bart
Segmentation fault
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./hello lisa lisa lisa lis a
Hello Lisa
Hello Lisa
Hello Lisa
Hello Lisa
Segmentation fault
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ,.[K[K./ 'lisa' 'bart'
bash: ./: Is a directory
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./helll[Ko 'lsia'[K[K[K[Kisa' bar[K[K[K'bart'
Hello Lisa
Hello Bart
Segmentation fault
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ cd[K[Kls
hello  hello.cc  Makefile  README
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ c[Kvim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;36r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[36;1H"hello.cc" 48L, 1011C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in);
  [33mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [33mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [33melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{[36;56H1,1[11CTop[1;1H[?25h[?25l[36;46H:[1;1H[36;1H[K[36;1H:[?2004h[?25hc[?25l[?25ho[?25l[?25hl[?25l[?25ho[?25l[?25h[?25l [?25hm[?25l[?25horni[?25l[?25hn[?25l[?25hg[?25l[?25h[?25l[30m[47m[1;1H[27m[23m[29m[m[30m[47m[H[2J[1;1H[35m#include [m[30m[47m[31m<locale>[m[30m[47m
[35m#include [m[30m[47m[31m<iostream>[m[30m[47m
[35m#include [m[30m[47m[31m<cstdlib>[m[30m[47m
[35m#include [m[30m[47m[31m<cstring>[m[30m[47m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m[30m[47m
[32mvoid[m[30m[47m
upcaseWords([32mconst[m[30m[47m [32mchar[m[30m[47m in[], [32mchar[m[30m[47m out[])
{
  [32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;
  [32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in);
  [33mfor[m[30m[47m ([32mint[m[30m[47m i = [31m0[m[30m[47m; i < n; i++) {
    [33mif[m[30m[47m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [33melse[m[30m[47m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m[30m[47m [32mvoid[m[30m[47m
sayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)
{
  std::cout << [31m"Hello "[m[30m[47m << name << std::endl;
}


[32mint[m[30m[47m
main([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])
{[36;56H1,1[11CTop[1;1H[?25h[?25l[36;46H~@k[1;1H[36;46H   [2;1H[36;56H2[2;1H[?25h[?25l[36;46H~@k[2;1H[36;46H   [3;1H[36;56H3[3;1H[?25h[?25l[36;46H~@k[3;1H[36;46H   [4;1H[36;56H4[4;1H[?25h[?25l[36;46H~@k[4;1H[36;46H   [5;1H[36;56H5,0-1[5;1H[?25h[?25l[36;46H~@k[5;1H[36;46H   [6;1H[36;56H6,1  [6;1H[?25h[?25l[36;46H~@k[6;1H[36;46H   [7;1H[36;56H7[7;1H[?25h[?25l[36;46H~@k[7;1H[36;46H   [8;1H[36;56H8[8;1H[?25h[?25l[36;46H~@k[8;1H[36;46H   [9;1H[36;56H9[9;1H[?25h[?25l[36;46H~@k[9;1H[36;46H   [10;1H[36;56H10,1[10;1H[?25h[?25l[36;46H~@k[10;1H[36;46H   [11;1H[36;57H1[11;1H[?25h[?25l[36;46H~@k[11;1H[36;46H   [12;1H[46m{[24;1H}[m[30m[47m[36;57H2[12;1H[?25h[?25l[36;46H~@k[12;1H[36;46H   [13;1H[12;1H{[24;1H}[36;57H3[13;1H[?25h[?25l[36;46H~@k[13;1H[36;46H   [14;1H[36;57H4[14;1H[?25h[?25l[36;46H~@k[14;1H[36;46H   [15;1H[36;57H5[15;1H[?25h[?25l[36;46H~@k[15;1H[36;46H   [16;1H[36;57H6[16;1H[?25h[?25l[36;46H~@k[16;1H[36;46H   [17;1H[36;57H7[17;1H[?25h[?25l[36;46H~@k[17;1H[36;46H   [16;1H[36;57H6[16;1H[?25h[?25l[36;46H~@k[16;1H[36;46H   [15;1H[36;57H5[15;1H[?25h[?25l[36;46H~@k[15;1H[36;46H   [15;2H[36;59H2[15;2H[?25h[?25l[36;46H~@k[15;2H[36;46H   [15;3H[36;59H3[15;3H[?25h[?25l[36;46H~@k[15;3H[36;46H   [15;4H[36;59H4[15;4H[?25h[?25l[36;46H~@k[15;4H[36;46H   [15;5H[36;59H5[15;5H[?25h[?25l[36;46H~@k[15;5H[36;46H   [15;6H[36;59H6[15;6H[?25h[?25l[36;46H~@k[15;6H[36;46H   [15;7H[46m([21C)[m[30m[47m[36;59H7[15;7H[?25h[?25l[36;46H~@k[15;7H[36;46H   [15;8H([21C)[36;59H8[15;8H[?25h[?25l[36;46H~@k[15;8H[36;46H   [15;9H[36;59H9[15;9H[?25h[?25l[36;46H~@k[15;9H[36;46H   [15;10H[36;59H10[15;10H[?25h[?25l[36;46H~@k[15;10H[36;46H   [15;11H[36;60H1[15;11H[?25h[?25l[36;46H~@k[15;11H[36;46H   [15;12H[36;60H2[15;12H[?25h[?25l[36;46H~@k[15;12H[36;46H   [15;13H[36;60H3[15;13H[?25h[?25l[36;46H~@k[15;13H[36;46H   [15;14H[36;60H4[15;14H[?25h[?25l[36;46H~@k[15;14H[36;46H   [15;15H[36;60H5[15;15H[?25h[?25l[36;46H~@k[15;15H[36;46H   [15;16H[36;60H6[15;16H[?25h[?25l[36;46H~@k[15;16H[36;46H   [15;17H[36;60H7[15;17H[?25h[?25l[36;46H~@k[15;17H[36;46H   [15;18H[36;60H8[15;18H[?25h[?25l[36;46H~@k[15;18H[36;46H   [15;19H[36;60H9[15;19H[?25h[?25l[36;46H~@k[15;19H[36;46H   [15;20H[36;59H20[15;20H[?25h[?25l[36;46H~@k[15;20H[36;46H   [15;21H[36;60H1[15;21H[?25h[?25l[36;46H~@k[15;21H[36;46H   [15;22H[36;60H2[15;22H[?25h[?25l[36;46H~@k[15;22H[36;46H   [15;23H[36;60H3[15;23H[?25h[?25l[36;46H~@k[15;23H[36;46H   [15;24H[36;60H4[15;24H[?25h[?25l[36;46H~@k[15;24H[36;46H   [15;25H[36;60H5[15;25H[?25h[?25l[36;46H~@k[15;25H[36;46H   [15;26H[36;60H6[15;26H[?25h[?25l[36;46H~@k[15;26H[36;46H   [14;26H[36;57H4[14;26H[?25h[?25l[36;46H~@k[14;26H[36;46H   [14;27H[36;60H7[14;27H[?25h[?25l[36;46H~@k[14;27H[36;46H   [14;28H[46m([m[30m[47min[46m)[m[30m[47m[36;60H8[14;28H[?25h[?25l[36;46H~@k[14;28H[36;46H   [14;29H(in)[36;60H9[14;29H[?25h[?25l[36;46H~@k[14;29H[36;46H   [14;30H[36;59H30[14;30H[?25h[?25l[36;46H~@k[14;30H[36;46H   [14;31H[46m([m[30m[47min[46m)[m[30m[47m[36;60H1[14;31H[?25h[?25l[36;46H~@k[14;31H[36;46H   [14;32H(in)[36;60H2[14;32H[?25h[?25l[36;46H~@k[14;32H[36;46H   [14;32H[?25h[?25l[36;46H~@k[14;32H[36;46H   [14;32H[?25h[?25l[36;46H~@k[14;32H[36;46H   [14;32H[?25h[?25l[36;46H~@k[14;32H[36;46H   [14;32H[?25h[?25l[36;46H~@k[14;32H[36;46H   [14;32H[36;1H[1m-- INSERT --[m[30m[47m[36;56H[K[36;56H14,32[9CTop[14;32H[?25h[?25l[36;60H3[14;33H[?25h[?25l[14;32H[K[14;28H[46m([m[30m[47min[46m)[m[30m[47m[36;60H2[14;32H[?25h[?25l(in)[36;60H3[14;33H[?25h[?25l+[36;60H4[14;34H[?25h[?25l[36;60H5[14;35H[?25h[?25l[31m1[m[30m[47m[36;60H6[14;36H[?25h[?25l;[36;60H7[14;37H[?25h[?25l[15;31H[46m{[23;3H}[m[30m[47m[36;57H5,32[15;32H[?25h[?25l{[23;3H}[36;57H4,37[14;37H[?25h[?25l[36;57H3,23[13;23H[?25h[?25l[14;35r[14;1H[L[1;36r[36;56H[K[36;56H14,3[10CTop[14;3H[?25h[?25l/[36;59H4[14;4H[?25h[?25l[34m//[m[30m[47m[36;59H5[14;5H[?25h[?25l[34m [m[30m[47m[36;59H6[14;6H[?25h[?25l[34mn[m[30m[47m[36;59H7[14;7H[?25h[?25l[34me[m[30m[47m[36;59H8[14;8H[?25h[?25l[34me[m[30m[47m[36;59H9[14;9H[?25h[?25l[34md[m[30m[47m[36;59H10[14;10H[?25h[?25l[34m [m[30m[47m[36;60H1[14;11H[?25h[?25l[34mt[m[30m[47m[36;60H2[14;12H[?25h[?25l[34mo[m[30m[47m[36;60H3[14;13H[?25h[?25l[34m [m[30m[47m[36;60H4[14;14H[?25h[?25l[34m+[m[30m[47m[36;60H5[14;15H[?25h[?25l[31m1[m[30m[47m[36;60H6[14;16H[?25h[?25l[34m [m[30m[47m[36;60H7[14;17H[?25h[?25l[34mf[m[30m[47m[36;60H8[14;18H[?25h[?25l[34mo[m[30m[47m[36;60H9[14;19H[?25h[?25l[34mr[m[30m[47m[36;59H20[14;20H[?25h[?25l[34m [m[30m[47m[36;60H1[14;21H[?25h[?25l[14;20H[K[36;60H0[14;20H[?25h[?25l[14;19H[K[36;59H19[14;19H[?25h[?25l[14;18H[K[36;60H8[14;18H[?25h[?25l[14;17H[K[36;60H7[14;17H[?25h[?25l[14;16H[K[36;60H6[14;16H[?25h[?25l[14;15H[K[36;60H5[14;15H[?25h[?25l[34m [m[30m[47m[36;60H6[14;16H[?25h[?25l[31m1[m[30m[47m[36;60H7[14;17H[?25h[?25l[34m [m[30m[47m[36;60H8[14;18H[?25h[?25l[34mf[m[30m[47m[36;60H9[14;19H[?25h[?25l[34mo[m[30m[47m[36;59H20[14;20H[?25h[?25l[34mr[m[30m[47m[36;60H1[14;21H[?25h[?25l[34m [m[30m[47m[36;60H2[14;22H[?25h[?25l[34mt[m[30m[47m[36;60H3[14;23H[?25h[?25l[34me[m[30m[47m[36;60H4[14;24H[?25h[?25l[34mr[m[30m[47m[36;60H5[14;25H[?25h[?25l[34mm[m[30m[47m[36;60H6[14;26H[?25h[?25l[34mi[m[30m[47m[36;60H7[14;27H[?25h[?25l[34mn[m[30m[47m[36;60H8[14;28H[?25h[?25l[34ma[m[30m[47m[36;60H9[14;29H[?25h[?25l[34mt[m[30m[47m[36;59H30[14;30H[?25h[?25l[34mi[m[30m[47m[36;60H1[14;31H[?25h[?25l[34mn[m[30m[47m[36;60H2[14;32H[?25h[?25l[34mg[m[30m[47m[36;60H3[14;33H[?25h[?25l[34m [m[30m[47m[36;60H4[14;34H[?25h[?25l[34m'[m[30m[47m[36;60H5[14;35H[?25h[?25l[34mN[m[30m[47m[36;60H6[14;36H[?25h[?25l[34mU[m[30m[47m[36;60H7[14;37H[?25h[?25l[14;36H[K[36;60H6[14;36H[?25h[?25l[14;35H[K[36;60H5[14;35H[?25h[?25l[34m/[m[30m[47m[36;60H6[14;36H[?25h[?25l[14;35H[K[36;60H5[14;35H[?25h[?25l[34m\
  const int n = std::strlen(in) + [1C;[m[30m[47m[36;60H6[14;36H[?25h[?25l[31m0[m[30m[47m
  [32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in) + [1C;[36;60H7[14;37H[?25h[?25l[34m'[m[30m[47m[36;60H8[14;38H[?25h[?25l[34m [m[30m[47m[36;60H9[14;39H[?25h[?25l[34mc[m[30m[47m[36;59H40[14;40H[?25h[?25l[34mh[m[30m[47m[36;60H1[14;41H[?25h[?25l[34ma[m[30m[47m[36;60H2[14;42H[?25h[?25l[34mr[m[30m[47m[36;60H3[14;43H[?25h[?25l[34ma[m[30m[47m[36;60H4[14;44H[?25h[?25l[34mc[m[30m[47m[36;60H5[14;45H[?25h[?25l[34me[m[30m[47m[36;60H6[14;46H[?25h[?25l[34mr[m[30m[47m[36;60H7[14;47H[?25h[?25l[14;46H[K[36;60H6[14;46H[?25h[?25l[14;45H[K[36;60H5[14;45H[?25h[?25l[34mt[m[30m[47m[36;60H6[14;46H[?25h[?25l[34me[m[30m[47m[36;60H7[14;47H[?25h[?25l[34mr[m[30m[47m[36;60H8[14;48H[?25h[?25l[16;31H[46m{[24;3H}[m[30m[47m[36;57H6,32[16;32H[?25h[?25l{[17;41H[46m{[19;5H}[m[30m[47m[24;3H}[36;57H7,4[17;42H[?25h[?25l{[19;5H}[36;57H8,36[18;36H[?25h[?25l[17;41H[46m{[19;5H}[m[30m[47m[36;57H9,6 [19;6H[?25h[?25l[17;41H{[19;5H}[20;10H[46m{[22;5H}[m[30m[47m[36;56H20,11[20;11H[?25h[?25l{[22;5H}[36;57H1,22[21;22H[?25h[?25l[20;10H[46m{[22;5H}[m[30m[47m[36;57H2,6 [22;6H[?25h[?25l[20;10H{[22;5H}[36;57H3,34[23;34H[?25h[?25l[16;31H[46m{[24;3H}[m[30m[47m[36;57H4,4 [24;4H[?25h[?25l[12;1H[46m{[m[30m[47m[16;31H{[24;3H}
[46m}[m[30m[47m[36;57H5,2[25;2H[?25h[?25l[12;1H{[25;1H}[36;57H6,1[26;1H[?25h[?25l[36;57H7,12[27;12H[?25h[?25l[28;9H[46m([16C)[m[30m[47m[36;57H8,27[28;27H[?25h[?25l[28;9H([16C)
[46m{

}[m[30m[47m[36;57H9,2 [29;2H[?25h[?25l{

}[36;56H30,37[30;37H[?25h[?25l[1;35r[35;1H
[1;36r[35;1H{[36;56H[K[36;56H31,2[11C7%[28;1H[46m{

}[?25h[?25l[1;35r[m[30m[47m[35;1H
[1;36r[35;3H[33mif[m[30m[47m (argc == [31m1[m[30m[47m) {[36;56H[K[36;56H32,1[10C14%[27;1H{

}
[?25h[?25l[1;35r[35;1H
[1;36r[35;5Hstd::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;[36;56H[K[36;56H33,1[10C21%[30;1H[?25h[?25l[1;35r[35;1H
[1;36r[35;5Hstd::exit([31m1[m[30m[47m);[36;56H[K[36;56H34,4[10C28%[30;4H[?25h[?25l[1;35r[35;1H
[1;36r[35;3H}[36;56H[K[36;56H35,35[9C35%[30;5H[46m([28C)[?25h[?25l[1;35r[m[30m[47m[35;1H
[1;36r[35;3H[33melse[m[30m[47m {[36;56H[K[36;56H36,2[10C42%[29;5H([28C)
{[?25h[?25l[1;35r[35;1H
[1;36r[35;5H[33mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i <= argc; i++) {[36;56H[K[36;56H37,19[9C50%[30;18H[46m{[33;3H}[30;19H[?25h[?25l[1;35r[m[30m[47m[35;1H
[1;36r[35;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[36;56H[K[36;56H38,37[9C57%[29;18H{[30;35H[46m[[1C][m[30m[47m

  }[30;37H[?25h[?25l[1;35r[1;1H[2M[1;36r[34;7H[32mchar[m[30m[47m friendlyName[strlen(name)];[35;7HupcaseWords(name, friendlyName);[36;56H[K[36;56H40,4[10C71%[27;18H[46m{[m[30m[47m[28;35H[[1C]

  [46m}[?25h[?25l[1;35r[m[30m[47m[35;1H
[1;36r[35;7HsayHello(friendlyName);[36;56H[K[36;56H41,9[10C78%[26;18H{[29;3H}[30;9H[?25h[?25l[1;35r[35;1H
[1;36r[35;5H}[36;56H[K[36;56H42,37[9C85%[30;37H[46m{[35;5H}[30;37H[?25h[?25l[1;35r[m[30m[47m[35;1H
[1;36r[35;3H}[36;56H[K[36;56H43,34[9C92%[29;37H{[34;5H}[30;34H[?25h[?25l[1;35r[35;1H
[1;36r[35;1H}[36;56H[K[36;56H44,37[9CBot[30;24H[46m[[12C][?25h[?25l[m[30m[47m[30;24H[[12C][31;18H[46m([18C)[m[30m[47m[36;57H5[31;37H[?25h[?25l[31;18H([18C)[36;57H6,30[32;30H[?25h[?25l[28;37H[46m{[33;5H}[m[30m[47m[36;57H7,6 [33;6H[?25h[?25l[27;8H[46m{[m[30m[47m[28;37H{[33;5H}
  [46m}[m[30m[47m[36;57H8,4[34;4H[?25h[?25l[22;1H[46m{[m[30m[47m[27;8H{[34;3H}
[46m}[m[30m[47m[36;57H9,2[35;2H[?25h[?25l[22;1H{[27;8H[46m{[34;3H}[m[30m[47m
}[36;57H8,4[34;4H[?25h[?25l[27;8H{[28;37H[46m{[33;5H}[m[30m[47m
  }[36;57H7,6[33;6H[?25h[?25l[28;37H{[33;5H}[36;57H6,30[32;30H[?25h[?25l[31;18H[46m([18C)[m[30m[47m[36;57H5,37[31;37H[?25h[?25l[30;24H[46m[[12C][m[30m[47m[31;18H([18C)[36;57H4[30;37H[?25h[?25l[30;24H[[12C][36;57H3,34[29;34H[?25h[?25l[28;37H[46m{[33;5H}[m[30m[47m[36;57H2,37[28;37H[?25h[?25l[27;8H[46m{[m[30m[47m[28;37H{[33;5H}
  [46m}[m[30m[47m[36;57H1,9 [27;9H[?25h[?25l[23;18H[46m{[26;3H}[m[30m[47m[27;8H{[34;3H}[36;57H0,4[26;4H[?25h[?25l[23;18H{[26;3H}[36;56H39,18[25;18H[?25h[?25l[24;35H[46m[[1C][m[30m[47m[36;57H8,37[24;37H[?25h[?25l[23;18H[46m{[m[30m[47m[24;35H[[1C]

  [46m}[m[30m[47m[36;57H7,19[23;19H[?25h[?25l[22;1H[46m{[m[30m[47m[23;18H{[26;3H}[35;1H[46m}[m[30m[47m[36;57H6,2 [22;2H[?25h[?25l[21;5H[46m([28C)[m[30m[47m
{[35;1H}[36;57H5,35[21;35H[?25h[?25lmain([28C)[36;57H4,4 [20;4H[?25h[?25l[36;57H3,1[19;1H[?25h[?25l[36;57H2[18;1H[?25h[?25l[15;1H[46m{

}[m[30m[47m[36;57H1,2[17;2H[?25h[?25l[15;1H{

}[36;57H0,37[16;37H[?25h[?25l[15;1H[46m{

}[m[30m[47m[36;56H29,2 [15;2H[?25h[?25l[14;9H[46m([16C)[m[30m[47m
{

}[36;57H8,27[14;27H[?25h[?25l[14;9H([16C)[36;57H7,12[13;12H[?25h[?25l[36;57H6,1 [12;1H[?25h[?25l[36;57H7,12[13;12H[?25h[?25l[14;9H[46m([16C)[m[30m[47m[36;57H8,27[14;27H[?25h[?25l[14;9H([16C)
[46m{

}[m[30m[47m[36;57H9,2 [15;2H[?25h[?25l{

}[36;56H30,37[16;37H[?25h[?25l[15;1H[46m{

}[m[30m[47m[36;57H1,2 [17;2H[?25h[?25l[15;1H{

}[36;57H2,1[18;1H[?25h[?25l[36;57H3[19;1H[?25h[?25l[36;57H4,4[20;4H[?25h[?25l
main[46m([28C)[m[30m[47m[36;57H5,35[21;35H[?25h[?25lmain([28C)
[46m{[35;1H}[m[30m[47m[36;57H6,2 [22;2H[?25h[?25l{[23;18H[46m{[26;3H}[m[30m[47m[35;1H}[36;57H7,19[23;19H[?25h[?25l{[24;35H[46m[[1C][m[30m[47m

  }[36;57H8,37[24;37H[?25h[?25l[[1C][36;57H9,18[25;18H[?25h[?25l[23;18H[46m{[26;3H}[m[30m[47m[36;56H40,4 [26;4H[?25h[?25l[23;18H{[26;3H}[27;8H[46m{[34;3H}[m[30m[47m[36;57H1,9[27;9H[?25h[?25l{[28;37H[46m{[33;5H}[m[30m[47m
  }[36;57H2,37[28;37H[?25h[36;1H[K[28;36H[?25l[36;46H^[[28;36H[36;46H  [28;37H{[33;5H}[36;56H42,36[9CBot[28;36H[?25h[?25l[36;46H:[28;36H[36;46H[K[36;1H:[?2004h[?25hx[?25l[?25h[?25l[?1000l[?2004l"hello.cc" 49L, 1063C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[39;49m[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@remote06:~/i240b/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./hello bart lisa
Hello Bart
Hello Lisa
Segmentation fault
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ cd
amchugh2@remote06:~$ cd i[Ki24[K[K[K/i24[K[K[K[Ki240b/submit/lab2
amchugh2@remote06:~/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
amchugh2@remote06:~/i240b/submit/lab2$ cd h[K3-overload
amchugh2@remote06:~/i240b/submit/lab2/3-overload$ vim overload.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;36r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[36;1H"overload.cc" 16L, 282C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m

[32mint[m f([32mint[m *a) { [33mreturn[m *a * [31m2[m; }
[32mint[m f([32mint[m a) { [33mreturn[m a + [31m1[m;}
[32mint[m f([32mint[m a, [32mint[m b) { [33mreturn[m a - b; }

[32mint[m
main() {
  [32mint[m a = [31m2[m;
  [32mint[m b = [31m3[m;
  std::cout
    << [31m"f(a) = "[m << f(a)
    << [31m"; f(&a) = "[m << f(&a)
    << [31m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[1m[34m~                                                                        [18;1H~                                                                        [19;1H~                                                                        [20;1H~                                                                        [21;1H~                                                                        [22;1H~                                                                        [23;1H~                                                                        [24;1H~                                                                        [25;1H~                                                                        [26;1H~                                                                        [27;1H~                                                                        [28;1H~                                                                        [29;1H~                                                                        [30;1H~                                                                        [31;1H~                                                                        [32;1H~                                                                        [33;1H~                                                                        [34;1H~                                                                        [35;1H~                                                                        [m[36;56H1,1[11CAll[1;1H[?25h[?25l[36;46H:[1;1H[36;1H[K[36;1H:[?2004h[?25hx[?25l[?25h[?25l[?1000l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[36;1H[K[36;1H[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@remote06:~/i240b/submit/lab2/3-overload$ make
g++ -g -Wall -std=c++17    overload.cc   -o overload
amchugh2@remote06:~/i240b/submit/lab2/3-overload$ ./overload
f(a) = 3; f(&a) = 4; f(a, b) = -1
amchugh2@remote06:~/i240b/submit/lab2/3-overload$ gdb
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word".
(gdb) q
amchugh2@remote06:~/i240b/submit/lab2/3-overload$ gdb overload
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from overload...done.
(gdb) b[Kb f
f(int)       f(int*)      f(int, int)  frame_dummy  
(gdb) b f(int *)
Breakpoint 1 at 0x117d: file overload.cc, line 3.
(gdb) gdb r
Undefined command: "gdb".  Try "help".
(gdb) r
Starting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe768) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p *[Ka
$1 = (int *) 0x7fffffffe768
(gdb) p *a
$2 = 2
(gdb) p *a=5
$3 = 5
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) n
Program not restarted.
(gdb) c
Continuing.
f(a) = 3; f(&a) = 10; f(a, b) = 2
[Inferior 1 (process 2308679) exited normally]
(gdb) q
amchugh2@remote06:~/i240b/submit/lab2/3-overload$ cd ..
amchugh2@remote06:~/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
amchugh2@remote06:~/i240b/submit/lab2$ cd[K[Kcd la[K[K[K[K[Kvim lab2.LOG
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;36r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[36;1H"lab2.LOG" [noeol] 462L, 49152C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HScript started on 2020-02-05 21:28:37-05:00 [TERM="xterm" TTY="/dev/pts/22[2;1H" COLUMNS="100" LINES="35"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied[34m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ ls[34m^M[m
lab2.LOG[34m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ git pull[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^HH[7;1H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^G^G^G^G^G^G^G^G^G^G^G^G^G^G[mcd [34m^M[m
amchugh2@remote06:~$ ls[34m^M[m
amchugh2.circ  cs120lab7  Downloads[7Ci220a.bak  lab2[7Clab8      [10;1H Templates[34m^M[m
Arduino[8Ccs220      git-repos[7Ci220a_new  lab2final  Music     [12;1H tmp[34m^M[m
cs120[10Ccs240      git-repos_copy  i220X      lab2good   Pictures  [14;1H toneMelody[34m^M[m
cs120lab4      Desktop    good[12Ci240b      lab3[7Cprojects  [16;1H Videos[34m^M[m
cs120lab6      Documents  i220a[11Clab[8Clab5[7CPublic[34m^M[m
amchugh2@remote06:~$ cd cs240[34m^M[m
amchugh2@remote06:~/cs240$ git pull[34m^M[m
/home/amchugh2/.bashrc: line 1: /home/umrigar/cs240/bin/student.rc: Permii[21;1Hssion denied[34m^M[m
remote: Enumerating objects: 105, done.[34m^[[m[K[34m^M[m
remote: Counting objects:   0% (1/105)   [34m^[[m[K[34m^M[mremote: Counting objects:  [24;1H  1% (2/105)   [34m^[[m[K[34m^M[mremote: Counting objects:   2% (3/105)   [34m^[[m[K[34m^M[mremott[25;1He: Counting objects:   3% (4/105)   [34m^[[m[K[34m^M[mremote: Counting objects:   4%  [26;1H(5/105)   [34m^[[m[K[34m^M[mremote: Counting objects:   5% (6/105)   [34m^[[m[K[34m^M[mremote: Coo[27;1Hunting objects:   6% (7/105)   [34m^[[m[K[34m^M[mremote: Counting objects:   7% (8/100[28;1H5)   [34m^[[m[K[34m^M[mremote: Counting objects:   8% (9/105)   [34m^[[m[K[34m^M[mremote: Countinn[29;1Hg objects:   9% (10/105)   [34m^[[m[K[34m^M[mremote: Counting objects:  10% (11/105)  [30;1H  [34m^[[m[K[34m^M[mremote: Counting objects:  11% (12/105)   [34m^[[m[K[34m^M[mremote: Counting  [31;1Hobjects:  12% (13/105)   [34m^[[m[K[34m^M[mremote: Counting objects:  13% (14/105)    [32;1H[34m^[[m[K[34m^M[mremote: Counting objects:  14% (15/105)   [34m^[[m[K[34m^M[mremote: Counting obb[33;1Hjects:  15% (16/105)   [34m^[[m[K[34m^M[mremote: Counting objects:  16% (17/105)   [34m^[[[m[34;1H[K[34m^M[mremote: Counting objects:  17% (18/105)   [34m^[[m[K[34m^M[mremote: Counting objee[35;1Hcts:  18% (19/105)   [34m^[[m[K[34m^M[mremote: Counting objects:  19% (20/105)   [34m^[[m[K[35;1H[1m[34m@@@                                                                      [m[36;56H1,1[11CTop[1;1H[?25h[?25l[36;46H:[1;1H[36;1H[K[36;1H:[?2004h[?25hx[?25l[?25h[?25l[?1000l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[36;1H[K[36;1H[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@remote06:~/i240b/submit/lab2$ cd ..
amchugh2@remote06:~/i240b/submit$ cp -r ![K~/cs[K[Kiw0[K[K240b/submit/lab2/*.LOG
cp: missing destination file operand after '/home/amchugh2/i240b/submit/lab2/lab2.LOG'
Try 'cp --help' for more information.
amchugh2@remote06:~/i240b/submit$ cp -r ~/i240b/submit/lab2/*.LOG[K[K[K[K[K.LOG *
cp: cannot stat '/home/amchugh2/i240b/submit/lab2/.LOG': No such file or directory
amchugh2@remote06:~/i240b/submit$ cp -r ~/i240b/submit/lab2/.LOG *[C[C[C[C[C[C[K[K[K[K[K[K([K* [K[K.[K*[K.LOG .
cp: cannot stat '/home/amchugh2/i240b/submit/lab2/.LOG': No such file or directory
amchugh2@remote06:~/i240b/submit$ cp -r ~/i240b/submit/lab2/.LOG .[C[C[C[C[C[C[C[C[C[C[K[K[K[K[K[K*.log[K[K[KLOG .
amchugh2@remote06:~/i240b/submit$ ls
lab0  lab1  lab2  lab2.LOG
amchugh2@remote06:~/i240b/submit$ cd lab2
amchugh2@remote06:~/i240b/submit/lab2$ exit

Script done on 2020-02-05 21:49:26-05:00 [COMMAND_EXIT_CODE="0"]
Script started on 2020-02-06 15:00:46-05:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ./hello abby brendan sara charles[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K[Klab[K[K[Kc[Kls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd 2-e[Khello
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ ls
hello  hello.cc  Makefile  README
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ cd hello. c[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K[K[K[K[K[Kvim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 49L, 1063C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i <= argc; i++) {[17;7H[32mconst[m [32mchar[m *name = argv[i];[18;7H[32mchar[m friendlyName[strlen(name)];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H42,36[9CBot]2;hello.cc (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[16;36H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[17;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[18;7H[38;5;121mchar[m friendlyName[strlen(name)];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H42,36[9CBot"hello.cc" 49L, 1063C[16;36H[?25h[?25l[24;53H:[16;36H[24;1H[K[24;1H:[?2004h[?25hc[?25l[?25hl[?25l[?25ho[?25l[?25h[?25l[24;4H[K[24;4H[?25h[?25l[24;3H[K[24;3H[?25ho[?25l[?25hl[?25l[?25ho[?25l[?25h[?25l [?25hm[?25l[?25ho[?25l[?25hr[?25l[?25hn[?25l[?25hi[?25l[?25hn[?25l[?25hg[?25l[?25h[?25l[30m[47m[16;36H[27m[23m[29m[m[30m[47m[H[2J[1;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m
sayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)
{
  std::cout << [31m"Hello "[m[30m[47m << name << std::endl;
}


[32mint[m[30m[47m
main([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])
{
  [1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {
    std::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;
    std::exit([31m1[m[30m[47m);
  }
  [1m[38;5;130melse[m[30m[47m {
    [1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i <= argc; i++) {[17;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[18;7H[32mchar[m[30m[47m friendlyName[strlen(name)];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H42,36[9CBot[16;36H[?25h[?25l[24;53H~@k[16;36H[24;53H   [16;35H[16;9H[106m([25C)[m[30m[47m[24;67H5[16;35H[?25h[?25l[24;53H~@k[16;35H[24;53H   [16;34H[16;9H([25C)[24;67H4[16;34H[?25h[?25l[24;53H~@k[16;34H[24;53H   [16;33H[24;67H3[16;33H[?25h[?25l[24;53H~@k[16;33H[24;53H   [16;32H[24;67H2[16;32H[?25h[?25l[24;53H~@k[16;32H[24;53H   [16;31H[24;67H1[16;31H[?25h[?25l[24;53H~@k[16;31H[24;53H   [16;30H[24;67H0[16;30H[?25h[?25l[24;53H+[16;30H[24;53H [17;7H[24;64H3,7 [17;7H[?25h[?25l[24;53H~@k[17;7H[24;53H   [16;7H[24;64H2[16;7H[?25h[?25l[24;53H~@k[16;7H[24;53H   [16;8H[24;66H8[16;8H[?25h[?25l[24;53H~@k[16;8H[24;53H   [16;9H[106m([25C)[m[30m[47m[24;66H9[16;9H[?25h[?25l[24;53H~@k[16;9H[24;53H   [16;10H([25C)[24;66H10[16;10H[?25h[?25l[24;53H~@k[16;10H[24;53H   [16;11H[24;67H1[16;11H[?25h[?25l[24;53H~@k[16;11H[24;53H   [16;12H[24;67H2[16;12H[?25h[?25l[24;53H~@k[16;12H[24;53H   [16;13H[24;67H3[16;13H[?25h[?25l[24;53H~@k[16;13H[24;53H   [16;14H[24;67H4[16;14H[?25h[?25l[24;53H~@k[16;14H[24;53H   [16;15H[24;67H5[16;15H[?25h[?25l[24;53H~@k[16;15H[24;53H   [16;16H[24;67H6[16;16H[?25h[?25l[24;53H~@k[16;16H[24;53H   [16;17H[24;67H7[16;17H[?25h[?25l[24;53H~@k[16;17H[24;53H   [16;18H[24;67H8[16;18H[?25h[?25l[24;53H~@k[16;18H[24;53H   [16;19H[24;67H9[16;19H[?25h[?25l[24;53H~@k[16;19H[24;53H   [16;20H[24;66H20[16;20H[?25h[?25l[24;53H~@k[16;20H[24;53H   [16;21H[24;67H1[16;21H[?25h[?25l[24;53H~@k[16;21H[24;53H   [16;22H[24;67H2[16;22H[?25h[?25l[24;53H~@k[16;22H[24;53H   [16;23H[24;67H3[16;23H[?25h[?25l[24;53H~@k[16;23H[24;53H   [16;24H[24;67H4[16;24H[?25h[?25l[24;53H~@k[16;24H[24;53H   [16;25H[24;67H5[16;25H[?25h[?25l[24;53H~@k[16;25H[24;53H   [16;26H[24;67H6[16;26H[?25h[?25l[24;53H~@k[16;26H[24;53H   [16;27H[24;67H7[16;27H[?25h[?25l[24;53H~@k[16;27H[24;53H   [16;28H[24;67H8[16;28H[?25h[?25l[24;53H~@k[16;28H[24;53H   [16;29H[24;67H9[16;29H[?25h[?25l[24;53H~@k[16;29H[24;53H   [16;30H[24;66H30[16;30H[?25h[?25l[24;53H~@k[16;30H[24;53H   [16;30H[24;1H[1m-- INSERT --[m[30m[47m[24;63H[K[24;63H42,30[9CBot[16;30H[?25h[?25l+; i++) {[24;67H1]2;hello.cc + (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[16;31H[?25h[?25l[31m1[m[30m[47m; i++) {[24;67H2[16;32H[?25h[?25l[15;8H[106m{[22;3H}[m[30m[47m[24;64H1,9 [15;9H[?25h[?25l[16;23r[16;1H[L[1;24r[22;3H[106m [m[30m[47m
  }[24;63H[K[24;63H42,4-11[7C96%[15;8H{[22;3H [16;11H[?25h[?25l/[24;66H5-12[16;12H[?25h[?25l[34m//[m[30m[47m[24;66H6-13[16;13H[?25h[?25l[34m [m[30m[47m[24;66H7-14[16;14H[?25h[?25l[34ma[m[30m[47m[24;66H8-15[16;15H[?25h[?25l[34md[m[30m[47m[24;66H9-16[16;16H[?25h[?25l[34md[m[30m[47m[24;66H10-17[16;17H[?25h[?25l[34m [m[30m[47m[24;67H1-18[16;18H[?25h[?25l[31m1[m[30m[47m[24;67H2-19[16;19H[?25h[?25l[34m [m[30m[47m[24;67H3-20[16;20H[?25h[?25l[34mt[m[30m[47m[24;67H4-21[16;21H[?25h[?25l[34mo[m[30m[47m[24;67H5-22[16;22H[?25h[?25l[34m [m[30m[47m[24;67H6-23[16;23H[?25h[?25l[34ma[m[30m[47m[24;67H7-24[16;24H[?25h[?25l[34mr[m[30m[47m[24;67H8-25[16;25H[?25h[?25l[34mg[m[30m[47m[24;67H9-26[16;26H[?25h[?25l[34mc[m[30m[47m[24;66H20-27[16;27H[?25h[?25l[15;8H[106m{[23;3H}[m[30m[47m[24;64H1,9    [15;9H[?25h[?25l[11;18H[106m{[14;3H}[m[30m[47m[15;8H{[23;3H}[24;64H0,4[14;4H[?25h[?25l[11;18H{[14;3H}[24;63H39,18[13;18H[?25h[?25l[24;64H8,27[12;27H[?25h[?25l[11;18H[106m{[14;3H}[m[30m[47m[24;64H7,19[11;19H[?25h[?25l{[14;3H}[24;64H6,2 [10;2H[?25h[?25l[24;64H5,27[9;27H[?25h[?25l[24;64H4,4 [8;4H[?25h[?25l[24;64H3,1[7;1H[?25h[?25l[24;64H2[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H31,2[10C92%[4;1H[106m{

}[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H}[24;63H[K[24;63H30,27[9C88%[5;1H{

}[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H}[24;63H[K[24;63H29,2[10C85%[6;1H[106m{

}[6;2H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[24;63H[K[24;63H28,27[9C81%[6;9H[106m([16C)[m[30m[47m
{

}[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H27,12[9C77%[7;9H([16C)[6;12H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H26,1[10C74%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H25,2[10C70%[6;2H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H24,4[10C66%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H23,27[9C62%[6;26H[106m([m[30m[47min[i][106m)[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;5H[1m[38;5;130mif[m[30m[47m (!inWord && std::isalpha(in[i])) {[24;63H[K[24;63H22,6[10C59%[4;10H[106m{[6;5H}[m[30m[47m[7;26H(in[i])[6;6H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m0[m[30m[47m; i < n; i++) {[24;63H[K[24;63H21,22[9C55%[5;10H{[7;5H}[6;22H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in) + [31m1[m[30m[47m;[24;63H[K[24;63H20,11[9C51%[6;10H[106m{[8;5H}[6;11H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;3H[34m// need to + [m[30m[47m[31m1[m[30m[47m[34m for terminating '\[m[30m[47m[31m0[m[30m[47m[34m' character[m[30m[47m[24;63H[K[24;63H19,6[10C48%[4;41H[106m{[6;5H}[m[30m[47m[7;10H{[9;5H}[6;6H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;[24;63H[K[24;63H18,27[9C44%[5;41H{[7;5H}[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H{[24;63H[K[24;63H17,27[9C40%[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1HupcaseWords([32mconst[m[30m[47m [32mchar[m[30m[47m in[], [32mchar[m[30m[47m out[])[24;63H[K[24;63H16,27[9C37%[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[32mvoid[m[30m[47m[24;63H[K[24;63H15,27[9C33%[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m */[m[30m[47m[24;63H[K[24;63H14,27[9C29%[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m *  has enough space for the strlen(in) characters of in.[m[30m[47m[24;63H[K[24;63H13,23[9C25%[6;23H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m *  results into out.  The caller is responsible to ensure that out[m[30m[47m[24;63H[K[24;63H12,2[10C22%[6;1H[106m{[19;1H}[6;2H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H[34m/** Upcase the initial letter of each word from in, copying the[m[30m[47m[24;63H[K[24;63H11,27[9C18%[6;26H[106m[][m[30m[47m
{[20;1H}[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H10,5[10C14%[7;26H[][6;5H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstring>[m[30m[47m[24;63H[K[24;63H9,4[11C11%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstdlib>[m[30m[47m[24;63H[K[24;63H8,27[11C7%[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<iostream>[m[30m[47m[24;63H[K[24;63H7,27[11C3%[6;27H[?25h[?25l[24;63H8[7;27H[?25h[?25l[24;63H9,4 [8;4H[?25h[?25l[24;63H10,5[9;5H[?25h[?25l[10;26H[106m[][m[30m[47m[24;64H1,27[10;27H[?25h[?25l[][24;64H2,2 [11;2H[?25h[?25l[24;64H3,23[12;23H[?25h[?25l[24;64H4,27[13;27H[?25h[?25l[24;64H5[14;27H[?25h[?25l[24;64H6[15;27H[?25h[?25l[24;64H7[16;27H[?25h[?25l[24;64H8[17;27H[?25h[?25l[16;41H[106m{[18;5H}[m[30m[47m[24;64H9,6 [18;6H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H}[24;63H[K[24;63H20,11[10C7%[15;41H{[17;5H}[18;10H[106m{[20;5H}[18;11H[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[24;63H[K[24;63H21,22[9C11%[17;10H{[19;5H}[18;22H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H22,6[10C14%[16;10H[106m{[18;5H}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H23,27[9C18%[15;10H{[17;5H}[18;26H[106m([m[30m[47min[i][106m)[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1H{[24;63H[K[24;63H24,4[10C22%[10;31H[106m{[m[30m[47m[17;26H(in[i])
  [106m}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;3Hstd::cout << [31m"Hello "[m[30m[47m << name << std::endl;[24;63H[K[24;63H25,2[10C25%[5;1H[106m{[m[30m[47m[9;31H{[17;3H}
[106m}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1H}[24;63H[K[24;63H26,1[10C29%[4;1H{[17;1H}
[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H27,12[9C33%[18;12H[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H28,27[9C37%[18;9H[106m([16C)[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1H[32mint[m[30m[47m[24;63H[K[24;63H29,2[10C40%[17;9H([16C)
[106m{

}[18;2H[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1Hmain([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])[24;63H[K[24;63H30,27[9C44%[17;1H{

}[18;27H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H{[24;63H[K[24;63H31,2[10C48%[16;1H[106m{

}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;3H[1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {[24;63H[K[24;63H32,1[10C51%[15;1H{

}
[?25h[?25l[1;23r[23;1H
[1;24r[23;5Hstd::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;[24;63H[K[24;63H33,1[10C55%[18;1H[?25h[?25l[1;23r[23;1H
[1;24r[23;5Hstd::exit([31m1[m[30m[47m);[24;63H[K[24;63H34,4[10C59%[18;4H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H35,27[9C62%[18;27H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H36,2[10C66%[18;2H[?25h[?25l[1;23r[23;1H
[1;24r[23;11H[34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc[m[30m[47m[24;63H[K[24;63H37,19[9C70%[18;18H[106m{[21;3H}[18;19H[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;5H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i <= argc+[31m1[m[30m[47m; i++) {[24;63H[K[24;63H38,27[9C74%[17;18H{[20;3H}[18;27H[?25h[?25l[1;23r[23;1H
[1;24r[23;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[24;63H[K[24;63H39,18[9C77%[18;18H[?25h[?25l[1;23r[23;1H
[1;24r[23;7H[32mchar[m[30m[47m friendlyName[strlen(name)];[24;63H[K[24;63H40,4[10C81%[15;18H[106m{[18;3H}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;7HupcaseWords(name, friendlyName);[24;63H[K[24;63H41,9[10C85%[14;18H{[17;3H}[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;7HsayHello(friendlyName);[24;63H[K[24;63H42,20-27      88%[18;27H[?25h[?25l[1;23r[23;1H
[1;24r[23;5H}[24;63H[K[24;63H43,27[9C92%[18;27H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H44,27[9C96%[18;27H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H}[24;63H[K[24;63H45,27[9CBot[18;27H[?25h[?25l[24;64H6[19;27H[?25h[?25l[24;64H7[20;27H[?25h[?25l[16;39H[106m{[21;5H}[m[30m[47m[24;64H8,6 [21;6H[?25h[?25l[14;8H[106m{[m[30m[47m[16;39H{[21;5H}
  [106m}[m[30m[47m[24;64H9,4[22;4H[?25h[?25l[9;1H[106m{[m[30m[47m[14;8H{[22;3H}
[106m}[m[30m[47m[24;63H50,2[23;2H[?25h[?25l[9;1H{[14;8H[106m{[22;3H}[m[30m[47m
}[24;63H49,4[22;4H[?25h[?25l[14;8H{[16;39H[106m{[21;5H}[m[30m[47m
  }[24;64H8,6[21;6H[?25h[?25l[16;39H{[21;5H}[24;64H7,27[20;27H[?25h[?25l[24;64H6[19;27H[?25h[?25l[24;64H5[18;27H[?25h[?25l[24;64H4[17;27H[?25h[?25l[24;64H3[16;27H[?25h[?25l[24;64H2,20-27[15;27H[?25h[?25l[24;64H3,27   [16;27H[?25h[?25l[24;67H8[16;28H[?25h[?25l[24;67H9[16;29H[?25h[?25l[24;66H30[16;30H[?25h[?25l[24;67H1[16;31H[?25h[?25l[24;67H2[16;32H[?25h[?25l; i++) {[16;39H[K[24;67H1[16;31H[?25h[?25l; i++) {[16;38H[K[24;67H0[16;30H[?25h[?25l[24;66H29[16;29H[?25h[?25l[24;67H8[16;28H[?25h[?25l[24;67H7[16;27H[?25h[?25l[24;67H6[16;26H[?25h[?25l[24;67H5[16;25H[?25h[?25l[24;67H4[16;24H[?25h[?25l[24;67H5[16;25H[?25h[?25l argc; i++) {[16;37H[K[24;67H4[16;24H[?25h[?25l[24;64H4[17;24H[?25h[?25l[18;24H[106m[[12C][m[30m[47m[24;64H5[18;24H[?25h[?25l[24;67H5[18;25H[?25h[?25l[[12C][24;67H6[18;26H[?25h[?25l[24;67H7[18;27H[?25h[?25l[24;67H8[18;28H[?25h[?25l[24;67H9[18;29H[?25h[?25l[24;66H30[18;30H[?25h[?25ln[106m([m[30m[47mname[106m)[m[30m[47m[24;67H1[18;31H[?25h[?25l[24;67H2[18;32H[?25h[?25l(name)[24;67H3[18;33H[?25h[?25l[24;67H4[18;34H[?25h[?25l[24;67H5[18;35H[?25h[?25l[106m([m[30m[47mname[106m)[m[30m[47m[24;67H6[18;36H[?25h[?25l[18;24H[106m[[m[30m[47mstrlen(name)[106m][m[30m[47m[24;67H7[18;37H[?25h[?25l[106m+[m[30m[47m];+[106m][m[30m[47m[24;67H8[18;38H[?25h[?25l[31m[106m1[m[30m[47m];[31m1[m[30m[47m[106m][m[30m[47m[24;67H9[18;39H[?25h[?25l[18;24H[[14C][24;64H4,34[17;34H[?25h[?25l[16;36H[106m{[21;5H}[m[30m[47m[24;64H3,37[16;37H[?25h[?25l{[21;5H}[24;64H2,20-27[15;27H[?25h[?25l[14;8H[106m{[22;3H}[m[30m[47m[24;64H1,9    [14;9H[?25h[?25l[10;18H[106m{[13;3H}[m[30m[47m[14;8H{[22;3H}[24;64H0,4[13;4H[?25h[?25l[10;18H{[13;3H}[24;63H39,18[12;18H[?25h[?25l[24;64H8,39[11;39H[?25h[?25l[10;18H[106m{[13;3H}[m[30m[47m[24;64H7,1[10;19H[?25h[?25l[9;1H[106m{[m[30m[47m[10;18H{[13;3H}[23;1H[106m}[m[30m[47m[24;64H6,2 [9;2H[?25h[?25l[8;5H[106m([28C)[m[30m[47m
{[23;1H}[24;64H5,35[8;35H[?25h[?25lmain([28C)[24;64H4,4 [7;4H[?25h[?25l[24;64H3,1[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H32,1[10C96%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H31,2[10C92%[4;1H[106m{

}[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H}[24;63H[K[24;63H30,39[9C88%[5;1H{

}[6;39H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H}[24;63H[K[24;63H29,2[10C85%[6;1H[106m{

}[6;2H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[24;63H[K[24;63H28,27[9C81%[6;9H[106m([16C)[m[30m[47m
{

}[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H27,12[9C77%[7;9H([16C)[6;12H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H26,1[10C74%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H25,2[10C70%[6;2H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H24,4[10C66%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H23,34[9C62%[6;34H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130mif[m[30m[47m (!inWord && std::isalpha(in[i])) {[24;63H[K[24;63H22,6[10C59%[4;10H[106m{[6;5H}[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;3H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m0[m[30m[47m; i < n; i++) {[24;63H[K[24;63H21,22[9C55%[5;10H{[7;5H}[6;22H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in) + [31m1[m[30m[47m;[24;63H[K[24;63H20,11[9C51%[6;10H[106m{[8;5H}[6;11H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;3H[34m// need to + [m[30m[47m[31m1[m[30m[47m[34m for terminating '\[m[30m[47m[31m0[m[30m[47m[34m' character[m[30m[47m[24;63H[K[24;63H19,6[10C48%[4;41H[106m{[6;5H}[m[30m[47m[7;10H{[9;5H}[6;6H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;[24;63H[K[24;63H18,36[9C44%[5;41H{[7;5H}[6;36H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H{[24;63H[K[24;63H17,39[9C40%[6;8H[106m([30C)[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1HupcaseWords([32mconst[m[30m[47m [32mchar[m[30m[47m in[], [32mchar[m[30m[47m out[])[24;63H[K[24;63H16,32[9C37%[6;31H[106m{[m[30m[47m[7;8H([30C)[14;3H[106m}[6;32H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H[32mvoid[m[30m[47m[24;63H[K[24;63H15,37[9C33%[7;31H{[15;3H}[6;37H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m */[m[30m[47m[24;63H[K[24;63H14,39[9C29%[6;39H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m *  has enough space for the strlen(in) characters of in.[m[30m[47m[24;63H[K[24;63H13,23[9C25%[6;23H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m *  results into out.  The caller is responsible to ensure that out[m[30m[47m[24;63H[K[24;63H12,2[10C22%[6;1H[106m{[19;1H}[6;2H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H[34m/** Upcase the initial letter of each word from in, copying the[m[30m[47m[24;63H[K[24;63H11,39[9C18%[6;38H[106m[][m[30m[47m
{[20;1H}[6;39H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H10,5[10C14%[7;38H[][6;5H[?25h[?25l[7;38H[106m[][m[30m[47m[24;64H1,39[7;39H[?25h[?25l[]
[106m{[21;1H}[m[30m[47m[24;64H2,2 [8;2H[?25h[?25l{[21;1H}[24;64H3,23[9;23H[?25h[?25l[24;64H4,39[10;39H[?25h[?25l[24;64H5,37[11;37H[?25h[?25l[24;67H6[11;36H[?25h[?25l;[11;36H[K[24;67H5[11;35H[?25h[?25l;[11;35H[K[24;67H4[11;34H[?25h[?25l;[11;34H[K[24;67H3[11;33H[?25h[?25l;[11;33H[K[11;28H[106m([m[30m[47min[106m)[m[30m[47m[24;67H2[11;32H[?25h[?25l(in)[24;64H4[10;32H[?25h[?25l[24;67H1[10;31H[?25h[?25l[24;67H0[10;30H[?25h[?25l[24;66H29[10;29H[?25h[?25l[24;67H8[10;28H[?25h[?25l[24;67H7[10;27H[?25h[?25l[24;67H6[10;26H[?25h[?25l[24;67H5[10;25H[?25h[?25l[24;67H4[10;24H[?25h[?25l[24;67H3[10;23H[?25h[?25l[24;67H2[10;22H[?25h[?25l[24;67H1[10;21H[?25h[?25l[24;67H0[10;20H[?25h[?25l[24;66H19[10;19H[?25h[?25l[24;67H8[10;18H[?25h[?25l[24;67H7[10;17H[?25h[?25l[24;67H6[10;16H[?25h[?25l[24;67H5[10;15H[?25h[?25l[24;67H4[10;14H[?25h[?25l[24;67H3[10;13H[?25h[?25l[24;67H2[10;12H[?25h[?25l[24;67H1[10;11H[?25h[?25l[24;67H0[10;10H[?25h[?25l[24;66H9 [10;9H[?25h[?25l[24;66H8[10;8H[?25h[?25l[24;66H7[10;7H[?25h[?25l[24;66H6[10;6H[?25h[?25l[24;66H5[10;5H[?25h[?25l[24;66H4[10;4H[?25h[?25l[24;66H3[10;3H[?25h[?25l/ need to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;47H[K[10;3H[?25h[?25l need to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;46H[K[10;3H[?25h[?25lneed to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;45H[K[10;3H[?25h[?25leed to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;44H[K[10;3H[?25h[?25led to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;43H[K[10;3H[?25h[?25ld to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;42H[K[10;3H[?25h[?25l to + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;41H[K[10;3H[?25h[?25lto + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;40H[K[10;3H[?25h[?25lo + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;39H[K[10;3H[?25h[?25l + [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;38H[K[10;3H[?25h[?25l+ [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;37H[K[10;3H[?25h[?25l [31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;36H[K[10;3H[?25h[?25l[31m1[m[30m[47m [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;35H[K[10;3H[?25h[?25l [1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;34H[K[10;3H[?25h[?25l[1m[38;5;130mfor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;33H[K[10;3H[?25h[?25l[1m[38;5;130mor[m[30m[47m terminating [35m'\0'[m[30m[47m character[10;32H[K[10;3H[?25h[?25lr terminating [35m'\0'[m[30m[47m character[10;31H[K[10;3H[?25h[?25l terminating [35m'\0'[m[30m[47m character[10;30H[K[10;3H[?25h[?25lterminating [35m'\0'[m[30m[47m character[10;29H[K[10;3H[?25h[?25lerminating [35m'\0'[m[30m[47m character[10;28H[K[10;3H[?25h[?25lrminating [35m'\0'[m[30m[47m character[10;27H[K[10;3H[?25h[?25lminating [35m'\0'[m[30m[47m character[10;26H[K[10;3H[?25h[?25linating [35m'\0'[m[30m[47m character[10;25H[K[10;3H[?25h[?25lnating [35m'\0'[m[30m[47m character[10;24H[K[10;3H[?25h[?25lating [35m'\0'[m[30m[47m character[10;23H[K[10;3H[?25h[?25lting [35m'\0'[m[30m[47m character[10;22H[K[10;3H[?25h[?25ling [35m'\0'[m[30m[47m character[10;21H[K[10;3H[?25h[?25lng [35m'\0'[m[30m[47m character[10;20H[K[10;3H[?25h[?25lg [35m'\0'[m[30m[47m character[10;19H[K[10;3H[?25h[?25l [35m'\0'[m[30m[47m character[10;18H[K[10;3H[?25h[?25l[35m'\0'[m[30m[47m character[10;17H[K[10;3H[?25h[?25l\[31m0[m[30m[47m' character[10;16H[K[10;3H[?25h[?25l[31m0[m[30m[47m' character[10;15H[K[10;3H[?25h[?25l' character[10;14H[K[10;3H[?25h[?25l character[10;13H[K[10;3H[?25h[?25lcharacter[10;12H[K[10;3H[?25h[?25lharacter[10;11H[K[10;3H[?25h[?25laracter[10;10H[K[10;3H[?25h[?25lracter[10;9H[K[10;3H[?25h[?25lacter[10;8H[K[10;3H[?25h[?25lcter[10;7H[K[10;3H[?25h[?25lter[10;6H[K[10;3H[?25h[?25ler[10;5H[K[10;3H[?25h[?25lr[10;4H[K[10;3H[?25h[?25l[10;3H[K[10;3H[?25h[?25l[24;66H2[10;2H[?25h[?25l[24;66H1[10;1H[?25h[?25l[9;23r[23;1H
[1;24r[9;3H[32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;[23;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H13,23[9C15%[9;23H[?25h[?25l[24;64H4[10;23H[?25h[?25l[24;64H5[11;23H[?25h[?25l[24;64H6[12;23H[?25h[?25l[24;64H7[13;23H[?25h[?25l[12;41H[106m{[14;5H}[m[30m[47m[24;64H8,6 [14;6H[?25h[?25l[12;41H{[14;5H}[15;10H[106m{[17;5H}[m[30m[47m[24;64H9,11[15;11H[?25h[?25l{[17;5H}[24;63H20,22[16;22H[?25h[?25l[15;10H[106m{[17;5H}[m[30m[47m[24;64H1,6 [17;6H[?25h[?25l[15;10H{[17;5H}[24;64H2,23[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H{[24;63H[K[24;63H23,4[10C19%[10;31H[106m{[18;3H}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;3Hstd::cout << [31m"Hello "[m[30m[47m << name << std::endl;[24;63H[K[24;63H24,2[10C23%[6;1H[106m{[m[30m[47m[9;31H{[17;3H}
[106m}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1H}[24;63H[K[24;63H25,1[10C26%[5;1H{[17;1H}
[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H26,12[9C30%[18;12H[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H27,23[9C34%[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H[32mint[m[30m[47m[24;63H[K[24;63H28,2[10C38%[18;1H[106m{

}[18;2H[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;1Hmain([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])[24;63H[K[24;63H29,23[9C42%[17;1H{

}[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H{[24;63H[K[24;63H30,2[10C46%[16;1H[106m{

}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;3H[1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {[24;63H[K[24;63H31,1[10C50%[15;1H{

}
[?25h[?25l[1;23r[23;1H
[1;24r[23;5Hstd::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;[24;63H[K[24;63H32,1[10C53%[18;1H[?25h[?25l[1;23r[23;1H
[1;24r[23;5Hstd::exit([31m1[m[30m[47m);[24;63H[K[24;63H33,4[10C57%[18;4H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H34,23[9C61%[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H35,2[10C65%[18;2H[?25h[?25l[1;23r[23;1H
[1;24r[23;11H[34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc[m[30m[47m[24;63H[K[24;63H36,19[9C69%[18;18H[106m{[21;3H}[18;19H[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;5H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i < argc; i++) {[24;63H[K[24;63H37,23[9C73%[17;18H{[20;3H}[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[24;63H[K[24;63H38,18[9C76%[18;18H[?25h[?25l[1;23r[23;1H
[1;24r[23;7H[32mchar[m[30m[47m friendlyName[strlen(name)+[31m1[m[30m[47m];[24;63H[K[24;63H39,4[10C80%[15;18H[106m{[18;3H}[?25h[?25l[1;23r[m[30m[47m[23;1H
[1;24r[23;7HupcaseWords(name, friendlyName);[24;63H[K[24;63H40,9[10C84%[14;18H{[17;3H}[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;7HsayHello(friendlyName);[24;63H[K[24;63H41,16-23      88%[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;5H}[24;63H[K[24;63H42,23[9C92%[18;23H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H43,23[9C96%[18;23H[?25h[?25l[24;67H4[18;24H[?25h[?25l[24;67H5[18;25H[?25h[?25l[24;67H6[18;26H[?25h[?25l[24;67H7[18;27H[?25h[?25l[24;67H8[18;28H[?25h[?25l[24;67H9[18;29H[?25h[?25lv[106m[[m[30m[47mi[106m][m[30m[47m[24;66H30[18;30H[?25h[?25l[24;67H1[18;31H[?25h[?25l[24;67H2[18;32H[?25h[?25l[24;67H3[18;33H[?25h[?25l[i][24;67H4[18;34H[?25h[?25l[1;23r[23;1H
[1;24r[18;23r[18;1H[L[1;24r[24;63H[K[24;63H44,7[10C96%[18;7H[?25h[?25l/[24;66H8[18;8H[?25h[?25l[34m//[m[30m[47m[24;66H9[18;9H[?25h[?25l[34m [m[30m[47m[24;66H10[18;10H[?25h[?25l[34ma[m[30m[47m[24;67H1[18;11H[?25h[?25l[34mc[m[30m[47m[24;67H2[18;12H[?25h[?25l[34mc[m[30m[47m[24;67H3[18;13H[?25h[?25l[34mp[m[30m[47m[24;67H4[18;14H[?25h[?25l[34mi[m[30m[47m[24;67H5[18;15H[?25h[?25l[34mm[m[30m[47m[24;67H6[18;16H[?25h[?25l[34mt[m[30m[47m[24;67H7[18;17H[?25h[?25l[34m [m[30m[47m[24;67H8[18;18H[?25h[?25l[34mp[m[30m[47m[24;67H9[18;19H[?25h[?25l[34mf[m[30m[47m[24;66H20[18;20H[?25h[?25l[18;19H[K[24;66H19[18;19H[?25h[?25l[18;18H[K[24;67H8[18;18H[?25h[?25l[18;17H[K[24;67H7[18;17H[?25h[?25l[18;16H[K[24;67H6[18;16H[?25h[?25l[18;15H[K[24;67H5[18;15H[?25h[?25l[18;14H[K[24;67H4[18;14H[?25h[?25l[18;13H[K[24;67H3[18;13H[?25h[?25l[34mo[m[30m[47m[24;67H4[18;14H[?25h[?25l[34mu[m[30m[47m[24;67H5[18;15H[?25h[?25l[34mn[m[30m[47m[24;67H6[18;16H[?25h[?25l[34mt[m[30m[47m[24;67H7[18;17H[?25h[?25l[34m [m[30m[47m[24;67H8[18;18H[?25h[?25l[34mf[m[30m[47m[24;67H9[18;19H[?25h[?25l[34mo[m[30m[47m[24;66H20[18;20H[?25h[?25l[34mr[m[30m[47m[24;67H1[18;21H[?25h[?25l[34m [m[30m[47m[24;67H2[18;22H[?25h[?25l[34mt[m[30m[47m[24;67H3[18;23H[?25h[?25l[34me[m[30m[47m[24;67H4[18;24H[?25h[?25l[34mr[m[30m[47m[24;67H5[18;25H[?25h[?25l[34mm[m[30m[47m[24;67H6[18;26H[?25h[?25l[34mi[m[30m[47m[24;67H7[18;27H[?25h[?25l[34mn[m[30m[47m[24;67H8[18;28H[?25h[?25l[34ma[m[30m[47m[24;67H9[18;29H[?25h[?25l[34mt[m[30m[47m[24;66H30[18;30H[?25h[?25l[34mi[m[30m[47m[24;67H1[18;31H[?25h[?25l[34mn[m[30m[47m[24;67H2[18;32H[?25h[?25l[34mg[m[30m[47m[24;67H3[18;33H[?25h[?25l[34m [m[30m[47m[24;67H4[18;34H[?25h[?25l[31m1[m[30m[47m[24;67H5[18;35H[?25h[?25l[34m [m[30m[47m[24;67H6[18;36H[?25h[?25l[34mc[m[30m[47m[24;67H7[18;37H[?25h[?25l[34mh[m[30m[47m[24;67H8[18;38H[?25h[?25l[34ma[m[30m[47m[24;67H9[18;39H[?25h[?25l[34mr[m[30m[47m[24;66H40[18;40H[?25h[24;1H[K[18;39H[?25l[24;53H^[[18;39H[24;53H  [18;40H[24;63H44,39[9C96%[18;39H[?25h[?25l[24;53H:[18;39H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[24;2H[K[24;2H[?25h [?25l[18;39H[24;63H44,39[9C96%[18;39H[?25h[?25l[24;53H~@k[18;39H[24;53H   [17;33H[24;64H3,33[17;33H[?25h[?25l[24;53H~@k[17;33H[24;53H   [16;36H[106m{[22;5H}[m[30m[47m[24;64H2,36[16;36H[?25h[?25l[24;53H~@k[16;36H[24;53H   [15;26H[16;36H{[22;5H}[24;64H1,19-26[15;26H[?25h[?25l[24;53H~@k[15;26H[24;53H   [15;26H[24;1H[1m-- INSERT --[m[30m[47m[24;63H[K[24;63H41,19-26      96%[15;26H[?25h[?25l[34m c[m[30m[47m[24;66H20-27[15;27H[?25h[?25l[34mc[m[30m[47m[15;27H[K[24;66H19-26[15;26H[?25h[?25l[24;66H20-27[15;27H[?25h[?25l[34m [m[30m[47m[24;67H1-28[15;28H[?25h[?25l[34mb[m[30m[47m[24;67H2-29[15;29H[?25h[?25l[34mc[m[30m[47m[24;67H3-30[15;30H[?25h[?25l[34m [m[30m[47m[24;67H4-31[15;31H[?25h[?25l[34mi[m[30m[47m[24;67H5-32[15;32H[?25h[?25l[34m [m[30m[47m[24;67H6-33[15;33H[?25h[?25l[34mc[m[30m[47m[24;67H7-34[15;34H[?25h[?25l[34ma[m[30m[47m[24;67H8-35[15;35H[?25h[?25l[34mn[m[30m[47m[24;67H9-36[15;36H[?25h[?25l[34mn[m[30m[47m[24;66H30-37[15;37H[?25h[?25l[34mo[m[30m[47m[24;67H1-38[15;38H[?25h[?25l[34mt[m[30m[47m[24;67H2-39[15;39H[?25h[?25l[34m [m[30m[47m[24;67H3-40[15;40H[?25h[?25l[34mb[m[30m[47m[24;67H4-41[15;41H[?25h[?25l[34me[m[30m[47m[24;67H5-42[15;42H[?25h[?25l[34m [m[30m[47m[24;67H6-43[15;43H[?25h[?25l[34ms[m[30m[47m[24;67H7-44[15;44H[?25h[?25l[34ma[m[30m[47m[24;67H8-45[15;45H[?25h[?25l[34mm[m[30m[47m[24;67H9-46[15;46H[?25h[?25l[34me[m[30m[47m[24;66H40-47[15;47H[?25h[?25l[34m [m[30m[47m[24;67H1-48[15;48H[?25h[?25l[34ma[m[30m[47m[24;67H2-49[15;49H[?25h[?25l[34ms[m[30m[47m[24;67H3-50[15;50H[?25h[?25l[34m [m[30m[47m[24;67H4-51[15;51H[?25h[?25l[34ma[m[30m[47m[24;67H5-52[15;52H[?25h[?25l[34mr[m[30m[47m[24;67H6-53[15;53H[?25h[?25l[34mg[m[30m[47m[24;67H7-54[15;54H[?25h[?25l[34mc[m[30m[47m[24;67H8-55[15;55H[?25h[?25l[16;36H[106m{[22;5H}[m[30m[47m[24;64H2,37   [16;37H[?25h[?25l{[22;5H}[24;64H3,34[17;34H[?25h[?25l[24;64H4,40[18;40H[?25h[?25l[34m,[m[30m[47m[24;67H1[18;41H[?25h[?25l[34m [m[30m[47m[24;67H2[18;42H[?25h[?25l[34ma[m[30m[47m[24;67H3[18;43H[?25h[?25l[34ml[m[30m[47m[24;67H4[18;44H[?25h[?25l[34ml[m[30m[47m[24;67H5[18;45H[?25h[?25l[34m [m[30m[47m[24;67H6[18;46H[?25h[?25l[34mC[m[30m[47m[24;67H7[18;47H[?25h[?25l[34m [m[30m[47m[24;67H8[18;48H[?25h[?25l[34ms[m[30m[47m[24;67H9[18;49H[?25h[?25l[34mt[m[30m[47m[24;66H50[18;50H[?25h[?25l[34mr[m[30m[47m[24;67H1[18;51H[?25h[?25l[34mi[m[30m[47m[24;67H2[18;52H[?25h[?25l[34mn[m[30m[47m[24;67H3[18;53H[?25h[?25l[34mg[m[30m[47m[24;67H4[18;54H[?25h[?25l[34ms[m[30m[47m[24;67H5[18;55H[?25h[?25l[34m [m[30m[47m[24;67H6[18;56H[?25h[?25l[34me[m[30m[47m[24;67H7[18;57H[?25h[?25l[34mn[m[30m[47m[24;67H8[18;58H[?25h[?25l[34md[m[30m[47m[24;67H9[18;59H[?25h[?25l[34m [m[30m[47m[24;66H60[18;60H[?25h[?25l[34mw[m[30m[47m[24;67H1[18;61H[?25h[?25l[34mi[m[30m[47m[24;67H2[18;62H[?25h[?25l[34mt[m[30m[47m[24;67H3[18;63H[?25h[?25l[34mh[m[30m[47m[24;67H4[18;64H[?25h[?25l[34m [m[30m[47m[24;67H5[18;65H[?25h[?25l[34mt[m[30m[47m[24;67H6[18;66H[?25h[?25l[34me[m[30m[47m[24;67H7[18;67H[?25h[?25l[34mm[m[30m[47m[24;67H8[18;68H[?25h[?25l[34mr[m[30m[47m[24;67H9[18;69H[?25h[?25l[34mi[m[30m[47m[24;66H70[18;70H[?25h[?25l[34mn[m[30m[47m[24;67H1[18;71H[?25h[?25l[34ma[m[30m[47m[24;67H2[18;72H[?25h[?25l[34mt[m[30m[47m[24;67H3[18;73H[?25h[?25l[34mi[m[30m[47m[24;67H4[18;74H[?25h[?25l[34mn[m[30m[47m[24;67H5[18;75H[?25h[?25l[34mg[m[30m[47m[24;67H6[18;76H[?25h[?25l[34m [m[30m[47m[24;67H7[18;77H[?25h[?25l[34m'[m[30m[47m[24;67H8[18;78H[?25h[?25l[34m\
      char friendlyName[strlen(name)+[1C];[m[30m[47m[24;67H9[18;79H[?25h[?25l[31m0[m[30m[47m
      [32mchar[m[30m[47m friendlyName[strlen(name)+[1C];[24;66H80[18;80H[?25h[?25l[1;23r[23;1H
[1;24r[17;80H[34m'[m[30m[47m[23;1H}[24;63H[K[24;63H44,81[9CBot[18;1H[?25h[24;1H[K[17;80H[?25l[24;53H^[[17;80H[24;53H  [18;1H[24;63H44,80[9CBot[17;80H[?25h[?25l[24;53H:[17;80H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 50L, 1141C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[39;49m[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ /[K./hello b art lisa
Hello Bart
Hello Lisa
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd 1-hello
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/1-hello$ ls
hello  hello.cc  Makefile  README
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/1-hello$ cd [K[K[Kvim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 22L, 367C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"hello "[m << name << std::endl;
}

[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i <= [106m([margc-[31m1[m[106m)[m; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                               [m[24;63H18,33[9CAll]2;hello.cc (~/projects/i240b/submit/lab2/1-hello) - VIM]1;hello.cc[18;33H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"hello "[m << name << std::endl;
}

[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= [46m([margc-[95m1[m[46m)[m; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                               [m[24;63H18,33[9CAll"hello.cc" 22L, 367C[18;33H[?25h[?25l[24;53H:[18;33H[24;1H[K[24;1H:[?2004h[?25hc[?25l[?25ho[?25l[?25hl[?25l[?25ho[?25l[?25h[?25l [?25hm[?25l[?25ho[?25l[?25hr[?25l[?25hn[?25l[?25hi[?25l[?25hn[?25l[?25hg[?25l[?25h[?25l[30m[47m[18;33H[27m[23m[29m[m[30m[47m[H[2J[1;1H[35m#include [m[30m[47m[31m<iostream>[m[30m[47m
[35m#include [m[30m[47m[31m<cstdlib>[m[30m[47m

[32mstatic[m[30m[47m [32mvoid[m[30m[47m
sayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)
{
  std::cout << [31m"hello "[m[30m[47m << name << std::endl;
}

[32mint[m[30m[47m
main([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])
{
  [1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {
    std::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;
    std::exit([31m1[m[30m[47m);
  }
  [1m[38;5;130melse[m[30m[47m {
    [1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i <= [106m([m[30m[47margc-[31m1[m[30m[47m[106m)[m[30m[47m; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                               [m[30m[47m[24;63H18,33[9CAll[18;33H[?25h[?25l[24;53H~@k[18;33H[24;53H   [17;8H[106m{[m[30m[47m[18;26H([6C)[21;3H[106m}[m[30m[47m[24;64H7,8 [17;8H[?25h[?25l[24;53H~@k[17;8H[24;53H   [18;33H[17;8H{[18;26H[106m([6C)[m[30m[47m[21;3H}[24;64H8,33[18;33H[?25h[?25l[24;53H~@k[18;33H[24;53H   [17;8H[106m{[m[30m[47m[18;26H([6C)[21;3H[106m}[m[30m[47m[24;64H7,8 [17;8H[?25h[?25l[24;53H~@k[17;8H[24;53H   [17;8H[24;1H[1m-- INSERT --[m[30m[47m[24;63H[K[24;63H17,8[10CAll[17;8H[?25h[?25l[24;66H9[17;9H[?25h[?25l[18;23r[18;1H[L[1;24r[21;3H[106m [m[30m[47m
  }[24;63H[K[24;63H18,4-11[7CAll[17;8H{[21;3H ]2;hello.cc + (~/projects/i240b/submit/lab2/1-hello) - VIM]1;hello.cc[18;11H[?25h[?25l/[24;66H5-12[18;12H[?25h[?25l[34m//[m[30m[47m[24;66H6-13[18;13H[?25h[?25l[34m [m[30m[47m[24;66H7-14[18;14H[?25h[?25l[34md[m[30m[47m[24;66H8-15[18;15H[?25h[?25l[34mo[m[30m[47m[24;66H9-16[18;16H[?25h[?25l[34m [m[30m[47m[24;66H10-17[18;17H[?25h[?25l[18;16H[K[24;66H9-16 [18;16H[?25h[?25l[18;15H[K[24;66H8-15[18;15H[?25h[?25l[18;14H[K[24;66H7-14[18;14H[?25h[?25l[34ma[m[30m[47m[24;66H8-15[18;15H[?25h[?25l[34mc[m[30m[47m[24;66H9-16[18;16H[?25h[?25l[34mc[m[30m[47m[24;66H10-17[18;17H[?25h[?25l[34mo[m[30m[47m[24;67H1-18[18;18H[?25h[?25l[34mu[m[30m[47m[24;67H2-19[18;19H[?25h[?25l[34mn[m[30m[47m[24;67H3-20[18;20H[?25h[?25l[34mt[m[30m[47m[24;67H4-21[18;21H[?25h[?25l[34m [m[30m[47m[24;67H5-22[18;22H[?25h[?25l[34mf[m[30m[47m[24;67H6-23[18;23H[?25h[?25l[34mo[m[30m[47m[24;67H7-24[18;24H[?25h[?25l[34mr[m[30m[47m[24;67H8-25[18;25H[?25h[?25l[34m [m[30m[47m[24;67H9-26[18;26H[?25h[?25l[34ma[m[30m[47m[24;66H20-27[18;27H[?25h[?25l[34mr[m[30m[47m[24;67H1-28[18;28H[?25h[?25l[34mg[m[30m[47m[24;67H2-29[18;29H[?25h[?25l[34mc[m[30m[47m[24;67H3-30[18;30H[?25h[?25l[34m [m[30m[47m[24;67H4-31[18;31H[?25h[?25l[18;30H[K[24;67H3-30[18;30H[?25h[?25l[18;29H[K[24;67H2-29[18;29H[?25h[?25l[18;28H[K[24;67H1-28[18;28H[?25h[?25l[18;27H[K[24;67H0-27[18;27H[?25h[?25l[18;26H[K[24;66H19-26[18;26H[?25h[?25l[18;25H[K[24;67H8-25[18;25H[?25h[?25l[18;24H[K[24;67H7-24[18;24H[?25h[?25l[18;23H[K[24;67H6-23[18;23H[?25h[?25l[18;22H[K[24;67H5-22[18;22H[?25h[?25l[18;21H[K[24;67H4-21[18;21H[?25h[?25l[18;20H[K[24;67H3-20[18;20H[?25h[?25l[18;19H[K[24;67H2-19[18;19H[?25h[?25l[18;18H[K[24;67H1-18[18;18H[?25h[?25l[18;17H[K[24;67H0-17[18;17H[?25h[?25l[18;16H[K[24;66H9-16 [18;16H[?25h[?25l[18;15H[K[24;66H8-15[18;15H[?25h[?25l[18;14H[K[24;66H7-14[18;14H[?25h[?25l[34ma[m[30m[47m[24;66H8-15[18;15H[?25h[?25l[34md[m[30m[47m[24;66H9-16[18;16H[?25h[?25l[34md[m[30m[47m[24;66H10-17[18;17H[?25h[?25l[34m [m[30m[47m[24;67H1-18[18;18H[?25h[?25l[34ma[m[30m[47m[24;67H2-19[18;19H[?25h[?25l[34mr[m[30m[47m[24;67H3-20[18;20H[?25h[?25l[34mg[m[30m[47m[24;67H4-21[18;21H[?25h[?25l[34mc[m[30m[47m[24;67H5-22[18;22H[?25h[?25l[34m [m[30m[47m[24;67H6-23[18;23H[?25h[?25l[34m-[m[30m[47m[24;67H7-24[18;24H[?25h[?25l[34m [m[30m[47m[24;67H8-25[18;25H[?25h[?25l[31m1[m[30m[47m[24;67H9-26[18;26H[?25h[?25l[24;67H8-25[18;25H[?25h[?25l[24;67H7-24[18;24H[?25h[?25l[24;67H6-23[18;23H[?25h[?25l[24;67H5-22[18;22H[?25h[?25l[24;67H4-21[18;21H[?25h[?25l[24;67H3-20[18;20H[?25h[?25l[24;67H2-19[18;19H[?25h[?25l[24;67H1-18[18;18H[?25h[?25l[24;67H0-17[18;17H[?25h[?25l[24;66H9-16 [18;16H[?25h[?25l[24;66H8-15[18;15H[?25h[?25l[24;66H7-14[18;14H[?25h[?25l[24;66H6-13[18;13H[?25h[?25l[24;66H5-12[18;12H[?25h[?25l[24;66H4-11[18;11H[?25h[?25l[24;66H3-10[18;10H[?25h[?25l[34m// add argc - [m[30m[47m[31m1[m[30m[47m[18;25H[K[24;66H2-9 [18;9H[?25h[?25l [34m// add argc - [m[30m[47m[31m1[m[30m[47m[18;17H[K[24;66H1  [18;1H[?25h[?25l         [34m// add argc - [m[30m[47m[31m1[m[30m[47m[24;66H2-9[18;9H[?25h[?25l [34m// add argc - [m[30m[47m[31m1[m[30m[47m[18;17H[K[24;66H1  [18;1H[?25h[?25l         [34m// add argc - [m[30m[47m[31m1[m[30m[47m[24;66H2-9[18;9H[?25h[?25l [34m// add argc - [m[30m[47m[31m1[m[30m[47m[18;17H[K[24;66H1  [18;1H[?25h[?25l[17;23r[23;1H
[1;24r[17;2H [1m[38;5;130melse[m[30m[47m { [34m// add argc - [m[30m[47m[31m1[m[30m[47m[23;1H[94m~                                                                               [m[30m[47m[24;63H[K[24;63H17,9[10CAll[17;8H[106m{[21;3H}[17;9H[?25h[?25l[18;23r[m[30m[47m[18;1H[L[1;24r[17;10H[K[18;11H[34m// add argc - [m[30m[47m[31m1[m[30m[47m[21;3H[106m [m[30m[47m
  }[24;63H[K[24;63H18,3-10[7CAll[17;8H{[21;3H [18;10H[?25h[?25l[19;9H[106m([29C)[m[30m[47m[24;64H9,10  [19;10H[?25h[?25l([29C)[24;63H20[20;10H[?25h[?25l[19;41H[106m{[21;5H}[m[30m[47m[24;64H1,6 [21;6H[?25h[?25l[17;8H[106m{[m[30m[47m[19;41H{[21;5H}
  [106m}[m[30m[47m[24;64H2,4[22;4H[?25h[?25l[12;1H[106m{[m[30m[47m[17;8H{[22;3H}
[106m}[m[30m[47m[24;64H3,2[23;2H[?25h[?25l[12;1H{[17;8H[106m{[22;3H}[m[30m[47m
}[24;64H2,4[22;4H[?25h[?25l[17;8H{[19;41H[106m{[21;5H}[m[30m[47m
  }[24;64H1,6[21;6H[?25h[?25l[19;41H{[21;5H}[24;64H0,10[20;10H[?25h[?25l[19;9H[106m([29C)[m[30m[47m[24;63H19[19;10H[?25h[?25l([29C)[24;64H8,3-10[18;10H[?25h[?25l[24;66H4-11[18;11H[?25h[?25l[24;66H5-12[18;12H[?25h[?25l[24;66H6-13[18;13H[?25h[?25l[24;66H7-14[18;14H[?25h[?25l[24;66H8-15[18;15H[?25h[?25l[24;66H9-16[18;16H[?25h[?25l[24;66H10-17[18;17H[?25h[?25l[24;67H1-18[18;18H[?25h[?25l[24;67H2-19[18;19H[?25h[?25l[24;67H3-20[18;20H[?25h[?25l[24;67H4-21[18;21H[?25h[?25l[24;67H5-22[18;22H[?25h[?25l[24;67H6-23[18;23H[?25h[?25l[24;67H7-24[18;24H[?25h[?25l[24;67H8-25[18;25H[?25h[?25l[24;67H9-26[18;26H[?25h[?25l[18;25H[K[24;67H8-25[18;25H[?25h[?25l[18;24H[K[24;67H7-24[18;24H[?25h[?25l[18;23H[K[24;67H6-23[18;23H[?25h[?25l[18;22H[K[24;67H5-22[18;22H[?25h[?25l[34m [m[30m[47m[24;67H6-23[18;23H[?25h[?25l[34m-[m[30m[47m[24;67H7-24[18;24H[?25h[?25l[31m1[m[30m[47m[24;67H8-25[18;25H[?25h[?25l[34m [m[30m[47m[24;67H9-26[18;26H[?25h[?25l[18;25H[K[24;67H8-25[18;25H[?25h[?25l[18;24H[K[24;67H7-24[18;24H[?25h[?25l[18;23H[K[24;67H6-23[18;23H[?25h[?25l[18;22H[K[24;67H5-22[18;22H[?25h[?25l[18;21H[K[24;67H4-21[18;21H[?25h[?25l[18;20H[K[24;67H3-20[18;20H[?25h[?25l[18;19H[K[24;67H2-19[18;19H[?25h[?25l[18;18H[K[24;67H1-18[18;18H[?25h[?25l[18;17H[K[24;67H0-17[18;17H[?25h[?25l[18;16H[K[24;66H9-16 [18;16H[?25h[?25l[18;15H[K[24;66H8-15[18;15H[?25h[?25l[18;14H[K[24;66H7-14[18;14H[?25h[?25l[18;13H[K[24;66H6-13[18;13H[?25h[?25l/[18;12H[K[24;66H5-12[18;12H[?25h[?25l[18;11H[K[24;66H4-11[18;11H[?25h[?25l[24;66H3-10[18;10H[?25h[?25l[24;66H2-9 [18;9H[?25h[?25l[24;66H1  [18;1H[?25h[?25l[17;23r[23;1H
[1;24r[17;3H[1m[38;5;130melse[m[30m[47m {[23;1H[94m~                                                                               [m[30m[47m[24;63H[K[24;63H17,9[10CAll[17;8H[106m{[21;3H}[17;9H[?25h[?25l[m[30m[47m[17;8H[K[21;3H}[24;66H8[17;8H[?25h[?25l{[106m{[21;3H}[m[30m[47m[24;66H9[17;9H[?25h[?25l{[18;9H[106m([29C)[m[30m[47m[21;3H}[24;64H8[18;9H[?25h[?25l[17;8H[106m{[m[30m[47m[18;9H([29C)[21;3H[106m}[m[30m[47m[24;64H7[17;9H[?25h[?25l[18;23r[18;1H[L[1;24r[21;3H[106m [m[30m[47m
  }[24;63H[K[24;63H18,4-11[7CAll[17;8H{[21;3H [18;11H[?25h[?25l/[24;66H5-12[18;12H[?25h[?25l[34m//[m[30m[47m[24;66H6-13[18;13H[?25h[?25l[34m [m[30m[47m[24;66H7-14[18;14H[?25h[?25l[34mc[m[30m[47m[24;66H8-15[18;15H[?25h[?25l[34ma[m[30m[47m[24;66H9-16[18;16H[?25h[?25l[34mn[m[30m[47m[24;66H10-17[18;17H[?25h[?25l[34mn[m[30m[47m[24;67H1-18[18;18H[?25h[?25l[34mo[m[30m[47m[24;67H2-19[18;19H[?25h[?25l[34mt[m[30m[47m[24;67H3-20[18;20H[?25h[?25l[34m [m[30m[47m[24;67H4-21[18;21H[?25h[?25l[34me[m[30m[47m[24;67H5-22[18;22H[?25h[?25l[34mq[m[30m[47m[24;67H6-23[18;23H[?25h[?25l[34mu[m[30m[47m[24;67H7-24[18;24H[?25h[?25l[34ma[m[30m[47m[24;67H8-25[18;25H[?25h[?25l[34ml[m[30m[47m[24;67H9-26[18;26H[?25h[?25l[34m [m[30m[47m[24;66H20-27[18;27H[?25h[?25l[34mt[m[30m[47m[24;67H1-28[18;28H[?25h[?25l[34mo[m[30m[47m[24;67H2-29[18;29H[?25h[?25l[34m [m[30m[47m[24;67H3-30[18;30H[?25h[?25l[34ma[m[30m[47m[24;67H4-31[18;31H[?25h[?25l[34mr[m[30m[47m[24;67H5-32[18;32H[?25h[?25l[34mg[m[30m[47m[24;67H6-33[18;33H[?25h[?25l[34mc[m[30m[47m[24;67H7-34[18;34H[?25h[?25l[24;67H6-33[18;33H[?25h[?25l[24;67H5-32[18;32H[?25h[?25l[24;67H4-31[18;31H[?25h[?25l[24;67H3-30[18;30H[?25h[?25l[24;67H2-29[18;29H[?25h[?25l[24;67H1-28[18;28H[?25h[?25l[24;67H0-27[18;27H[?25h[?25l[24;66H19-26[18;26H[?25h[?25l[24;67H8-25[18;25H[?25h[?25l[24;67H7-24[18;24H[?25h[?25l[24;67H6-23[18;23H[?25h[?25l[24;67H5-22[18;22H[?25h[?25l[24;67H4-21[18;21H[?25h[?25l[24;67H3-20[18;20H[?25h[?25l[24;67H2-19[18;19H[?25h[?25l[24;67H1-18[18;18H[?25h[?25l[24;67H0-17[18;17H[?25h[?25l[24;66H9-16 [18;16H[?25h[?25l[24;66H8-15[18;15H[?25h[?25l[24;66H7-14[18;14H[?25h[?25l[24;66H6-13[18;13H[?25h[?25l[34mi cannot equal to argc[m[30m[47m[24;66H7-14[18;14H[?25h[?25l[1C[34m cannot equal to argc[m[30m[47m[24;66H8-15[18;15H[?25h[?25l[34mcannot equal to argc[m[30m[47m[18;35H[K[24;66H7-14[18;14H[?25h[?25l[24;66H8-15[18;15H[?25h[?25l[24;66H9-16[18;16H[?25h[?25l[24;66H10-17[18;17H[?25h[?25l[24;67H1-18[18;18H[?25h[?25l[24;67H2-19[18;19H[?25h[?25l[24;67H3-20[18;20H[?25h[?25l[24;67H4-21[18;21H[?25h[?25l[1C[34m equal to argc[m[30m[47m[24;67H5-22[18;22H[?25h[?25l[34mb equal to argc[m[30m[47m[24;67H6-23[18;23H[?25h[?25l[34me equal to argc[m[30m[47m[24;67H7-24[18;24H[?25h[?25l[24;64H9,24   [19;24H[?25h[?25l[24;67H5[19;25H[?25h[?25l [106m([6C)[m[30m[47m[24;67H6[19;26H[?25h[?25l[24;67H7[19;27H[?25h[?25l([6C)[24;67H8[19;28H[?25h[?25l[24;67H9[19;29H[?25h[?25l[24;66H30[19;30H[?25h[?25l[24;67H1[19;31H[?25h[?25l[24;67H2[19;32H[?25h[?25l[106m([6C)[m[30m[47m[24;67H3[19;33H[?25h[?25l[24;67H4[19;34H[?25h[?25l[106m;[m[30m[47m i++) {[19;41H[K[19;26H([6C;[24;67H3[19;33H[?25h[?25l; i++) {[19;40H[K[24;67H2[19;32H[?25h[?25l; i++) {[19;39H[K[24;67H1[19;31H[?25h[?25l[24;67H0[19;30H[?25h[?25l[24;66H29[19;29H[?25h[?25l[24;67H8[19;28H[?25h[?25l[106m([9C)[m[30m[47m[24;67H7[19;27H[?25h[?25l[106ma[m[30m[47mrgc; i++)[106m [m[30m[47m{[19;38H[K[19;26Ha[9C [24;67H6[19;26H[?25h[?25largc; i++) {[19;37H[K[24;67H5[19;25H[?25h[?25largc; i++) {[19;36H[K[24;67H4[19;24H[?25h[?25l argc; i++) {[24;67H5[19;25H[?25h[24;1H[K[19;24H[?25l[24;53H^[[19;24H[24;53H  [19;25H[24;63H19,24[9CAll[19;24H[?25h[?25l[24;53H:[19;24H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 23L, 393C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[39;49m[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/1-hello$ vim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 23L, 393C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"hello "[m << name << std::endl;
}

[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {[18;11H[34m//i cannot be equal to argc[m
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[20;7HsayHello(argv[i]);
    }
  }
}[24;63H19,24[9CAll]2;hello.cc (~/projects/i240b/submit/lab2/1-hello) - VIM]1;hello.cc[19;24H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"hello "[m << name << std::endl;
}

[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {[18;11H[96m//i cannot be equal to argc[m
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[20;7HsayHello(argv[i]);
    }
  }
}[24;63H19,24[9CAll"hello.cc" 23L, 393C[19;24H[?25h[?25l[24;53H~@k[19;24H[24;53H   [18;24H[24;64H8,17-24[18;24H[?25h[?25l[24;53H~@k[18;24H[24;53H   [17;8H[46m{[22;3H}[m[24;64H7,8    [17;8H[?25h[?25l[24;53H~@k[17;8H[24;53H   [16;3H[13;18H[46m{[16;3H}[m[17;8H{[22;3H}[24;64H6,3[16;3H[?25h[?25l[24;53H~@k[16;3H[24;53H   [17;8H[13;18H{[16;3H}[17;8H[46m{[22;3H}[m[24;64H7,8[17;8H[?25h[?25l[24;53H~@k[17;8H[24;53H   [18;24H[17;8H{[22;3H}[24;64H8,17-24[18;24H[?25h[?25l[24;53H~@k[18;24H[24;53H   [18;25H[24;67H8-25[18;25H[?25h[?25l[24;53H~@k[18;25H[24;53H   [18;26H[24;67H9-26[18;26H[?25h[?25l[24;53H~@k[18;26H[24;53H   [18;27H[24;66H20-27[18;27H[?25h[?25l[24;53H~@k[18;27H[24;53H   [18;28H[24;67H1-28[18;28H[?25h[?25l[24;53H~@k[18;28H[24;53H   [18;29H[24;67H2-29[18;29H[?25h[?25l[24;53H~@k[18;29H[24;53H   [18;30H[24;67H3-30[18;30H[?25h[?25l[24;53H~@k[18;30H[24;53H   [18;31H[24;67H4-31[18;31H[?25h[?25l[24;53H~@k[18;31H[24;53H   [18;32H[24;67H5-32[18;32H[?25h[?25l[24;53H~@k[18;32H[24;53H   [18;33H[24;67H6-33[18;33H[?25h[?25l[24;53H~@k[18;33H[24;53H   [18;34H[24;67H7-34[18;34H[?25h[?25l[24;53H~@k[18;34H[24;53H   [18;35H[24;67H8-35[18;35H[?25h[?25l[24;53H~@k[18;35H[24;53H   [18;36H[24;67H9-36[18;36H[?25h[?25l[24;53H~@k[18;36H[24;53H   [18;37H[24;66H30-37[18;37H[?25h[?25l[24;53H~@k[18;37H[24;53H   [18;37H[?25h[?25l[24;53H~@k[18;37H[24;53H   [18;37H[?25h[?25l[24;53H~@k[18;37H[24;53H   [18;37H[24;1H[1m-- INSERT --[m[24;13H[K[24;63H18,30-37      All[18;37H[?25h[?25l[24;67H1-38[18;38H[?25h[?25l[96m:[m[24;67H2-39]2;hello.cc + (~/projects/i240b/submit/lab2/1-hello) - VIM]1;hello.cc[18;39H[?25h[?25l[96m [m[24;67H3-40[18;40H[?25h[?25l[96mc[m[24;67H4-41[18;41H[?25h[?25l[96ma[m[24;67H5-42[18;42H[?25h[?25l[96mn[m[24;67H6-43[18;43H[?25h[?25l[96mn[m[24;67H7-44[18;44H[?25h[?25l[96mo[m[24;67H8-45[18;45H[?25h[?25l[96mt[m[24;67H9-46[18;46H[?25h[?25l[96m [m[24;66H40-47[18;47H[?25h[?25l[96me[m[24;67H1-48[18;48H[?25h[?25l[96mq[m[24;67H2-49[18;49H[?25h[?25l[96mu[m[24;67H3-50[18;50H[?25h[?25l[96ma[m[24;67H4-51[18;51H[?25h[?25l[96ml[m[24;67H5-52[18;52H[?25h[?25l[96m [m[24;67H6-53[18;53H[?25h[?25l[96ma[m[24;67H7-54[18;54H[?25h[?25l[96mr[m[24;67H8-55[18;55H[?25h[?25l[96mg[m[24;67H9-56[18;56H[?25h[?25l[96mu[m[24;66H50-57[18;57H[?25h[?25l[96mm[m[24;67H1-58[18;58H[?25h[?25l[96me[m[24;67H2-59[18;59H[?25h[?25l[96mn[m[24;67H3-60[18;60H[?25h[?25l[96mt[m[24;67H4-61[18;61H[?25h[?25l[96m [m[24;67H5-62[18;62H[?25h[?25l[96mc[m[24;67H6-63[18;63H[?25h[?25l[96mo[m[24;67H7-64[18;64H[?25h[?25l[96mu[m[24;67H8-65[18;65H[?25h[?25l[96mn[m[24;67H9-66[18;66H[?25h[?25l[96mt[m[24;66H60-67[18;67H[?25h[?25l[96m.[m[24;67H1-68[18;68H[?25h[?25l[18;67H[K[24;67H0-67[18;67H[?25h[?25l[96m,[m[24;67H1-68[18;68H[?25h[?25l[96m [m[24;67H2-69[18;69H[?25h[?25l[96mm[m[24;67H3-70[18;70H[?25h[?25l[96mu[m[24;67H4-71[18;71H[?25h[?25l[96ms[m[24;67H5-72[18;72H[?25h[?25l[96mt[m[24;67H6-73[18;73H[?25h[?25l[96m [m[24;67H7-74[18;74H[?25h[?25l[96mb[m[24;67H8-75[18;75H[?25h[?25l[96me[m[24;67H9-76[18;76H[?25h[?25l[96m [m[24;66H70-77[18;77H[?25h[?25l[96ml[m[24;67H1-78[18;78H[?25h[?25l[96me[m[24;67H2-79[18;79H[?25h[?25l[96ms[m[24;67H3-80[18;80H[?25h[?25l[1;23r[23;1H
[1;24r[17;80H[96ms[m[23;1H[94m~                                                                               [m[24;63H[K[24;63H18,74-81      Bot[18;1H[?25h[?25l[16;8H[46m{[21;3H}[m[24;64H7,9    [16;9H[?25h[?25l{[21;3H}[24;64H8,74-81[18;1H[?25h[24;1H[K[17;80H[?25l[24;53H^[[17;80H[24;53H  [18;1H[24;63H18,73-80      Bot[17;80H[?25h[?25l[24;53H:[17;80H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 23L, 436C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/1-hello$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd [K[K[Kls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd 2-hello
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ ls
hello  hello.cc  Makefile  README
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ vim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 50L, 1141C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {[14;11H[34m// add [m[31m1[m[34m to argc bc i cannot be same as argc[m
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[16;7H[32mconst[m [32mchar[m *name = argv[i];[17;7H[34m// account for terminating [m[31m1[m[34m char, all C strings end with temrinating '\[m[31m0[m[34m'[m[18;7H[32mchar[m friendlyName[strlen(name)+[31m1[m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H44,80[9CBot]2;hello.cc (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[17;80H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {[14;11H[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[16;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[17;7H[96m// account for terminating [m[95m1[m[96m char, all C strings end with temrinating '\[m[95m0[m[96m'[m[18;7H[38;5;121mchar[m friendlyName[strlen(name)+[95m1[m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H44,80[9CBot"hello.cc" 50L, 1141C[17;80H[?25h[?25l[24;53H:[17;80H[24;1H[K[24;1H:[?2004h[?25hc[?25l[?25ho[?25l[?25hl[?25l[?25ho[?25l[?25h[?25l [?25hm[?25l[?25ho[?25l[?25hr[?25l[?25hn[?25l[?25hi[?25l[?25hn[?25l[?25hg[?25l[?25h[?25l[30m[47m[17;80H[27m[23m[29m[m[30m[47m[H[2J[1;1H{
  std::cout << [31m"Hello "[m[30m[47m << name << std::endl;
}


[32mint[m[30m[47m
main([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])
{
  [1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {
    std::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;
    std::exit([31m1[m[30m[47m);
  }
  [1m[38;5;130melse[m[30m[47m {[14;11H[34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc bc i cannot be same as argc[m[30m[47m
    [1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i < argc; i++) {[16;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[17;7H[34m// account for terminating [m[30m[47m[31m1[m[30m[47m[34m char, all C strings end with temrinating '\[m[30m[47m[31m0[m[30m[47m[34m'[m[30m[47m[18;7H[32mchar[m[30m[47m friendlyName[strlen(name)+[31m1[m[30m[47m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H44,80[9CBot[17;80H[?25h[?25l[24;53H~@k[17;80H[24;53H   [16;33H[24;64H3,33[16;33H[?25h[?25l[24;53H~@k[16;33H[24;53H   [15;36H[106m{[21;5H}[m[30m[47m[24;64H2,36[15;36H[?25h[?25l[24;53H~@k[15;36H[24;53H   [14;54H[15;36H{[21;5H}[24;64H1,47-54[14;54H[?25h[?25l[24;53H~@k[14;54H[24;53H   [13;8H[106m{[22;3H}[m[30m[47m[24;64H0,8    [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [12;3H[9;18H[106m{[12;3H}[m[30m[47m[13;8H{[22;3H}[24;63H39,3[12;3H[?25h[?25l[24;53H~@k[12;3H[24;53H   [11;17H[9;18H{[12;3H}[24;64H8,17[11;17H[?25h[?25l[24;53H~@k[11;17H[24;53H   [10;65H[24;64H7,65[10;65H[?25h[?25l[24;53H~@k[10;65H[24;53H   [9;18H[106m{[12;3H}[m[30m[47m[24;64H6,18[9;18H[?25h[?25l[24;53H~@k[9;18H[24;53H   [8;1H[106m{[m[30m[47m[9;18H{[12;3H}[23;1H[106m}[m[30m[47m[24;64H5,1 [8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [9;18H[8;1H{[9;18H[106m{[12;3H}[m[30m[47m[23;1H}[24;64H6,18[9;18H[?25h[?25l[24;53H~@k[9;18H[24;53H   [10;65H[9;18H{[12;3H}[24;64H7,65[10;65H[?25h[?25l[24;53H~@k[10;65H[24;53H   [11;17H[24;64H8,17[11;17H[?25h[?25l[24;53H~@k[11;17H[24;53H   [12;3H[9;18H[106m{[12;3H}[m[30m[47m[24;64H9,3 [12;3H[?25h[?25l[24;53H~@k[12;3H[24;53H   [13;8H[9;18H{[12;3H}[13;8H[106m{[22;3H}[m[30m[47m[24;63H40,8[13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [14;54H[13;8H{[22;3H}[24;64H1,47-54[14;54H[?25h[?25l[24;53H~@k[14;54H[24;53H   [14;53H[24;67H6-53[14;53H[?25h[?25l[24;53H~@k[14;53H[24;53H   [14;52H[24;67H5-52[14;52H[?25h[?25l[24;53H~@k[14;52H[24;53H   [14;51H[24;67H4-51[14;51H[?25h[?25l[24;53H~@k[14;51H[24;53H   [14;50H[24;67H3-50[14;50H[?25h[?25l[24;53H~@k[14;50H[24;53H   [14;49H[24;67H2-49[14;49H[?25h[?25l[24;53H~@k[14;49H[24;53H   [14;48H[24;67H1-48[14;48H[?25h[?25l[24;53H~@k[14;48H[24;53H   [14;47H[24;67H0-47[14;47H[?25h[?25l[24;53H~@k[14;47H[24;53H   [14;46H[24;66H39-46[14;46H[?25h[?25l[24;53H~@k[14;46H[24;53H   [14;45H[24;67H8-45[14;45H[?25h[?25l[24;53H~@k[14;45H[24;53H   [14;44H[24;67H7-44[14;44H[?25h[?25l[24;53H~@k[14;44H[24;53H   [14;43H[24;67H6-43[14;43H[?25h[?25l[24;53H~@k[14;43H[24;53H   [14;42H[24;67H5-42[14;42H[?25h[?25l[24;53H~@k[14;42H[24;53H   [14;41H[24;67H4-41[14;41H[?25h[?25l[24;53H~@k[14;41H[24;53H   [14;40H[24;67H3-40[14;40H[?25h[?25l[24;53H~@k[14;40H[24;53H   [14;39H[24;67H2-39[14;39H[?25h[?25l[24;53H~@k[14;39H[24;53H   [14;38H[24;67H1-38[14;38H[?25h[?25l[24;53H~@k[14;38H[24;53H   [14;37H[24;67H0-37[14;37H[?25h[?25l[24;53H~@k[14;37H[24;53H   [14;36H[24;66H29-36[14;36H[?25h[?25l[24;53H~@k[14;36H[24;53H   [14;35H[24;67H8-35[14;35H[?25h[?25l[24;53H~@k[14;35H[24;53H   [14;34H[24;67H7-34[14;34H[?25h[?25l[24;53H~@k[14;34H[24;53H   [14;33H[24;67H6-33[14;33H[?25h[?25l[24;53H~@k[14;33H[24;53H   [14;32H[24;67H5-32[14;32H[?25h[?25l[24;53H~@k[14;32H[24;53H   [14;31H[24;67H4-31[14;31H[?25h[?25l[24;53H~@k[14;31H[24;53H   [14;30H[24;67H3-30[14;30H[?25h[?25l[24;53H~@k[14;30H[24;53H   [14;29H[24;67H2-29[14;29H[?25h[?25l[24;53H~@k[14;29H[24;53H   [14;28H[24;67H1-28[14;28H[?25h[?25l[24;53H~@k[14;28H[24;53H   [14;27H[24;67H0-27[14;27H[?25h[?25l[24;53H~@k[14;27H[24;53H   [14;26H[24;66H19-26[14;26H[?25h[?25l[24;53H~@k[14;26H[24;53H   [14;25H[24;67H8-25[14;25H[?25h[?25l[24;53H~@k[14;25H[24;53H   [14;24H[24;67H7-24[14;24H[?25h[?25l[24;53H~@k[14;24H[24;53H   [14;23H[24;67H6-23[14;23H[?25h[?25l[24;53H~@k[14;23H[24;53H   [14;22H[24;67H5-22[14;22H[?25h[?25l[24;53H~@k[14;22H[24;53H   [14;21H[24;67H4-21[14;21H[?25h[?25l[24;53H~@k[14;21H[24;53H   [14;20H[24;67H3-20[14;20H[?25h[?25l[24;53H~@k[14;20H[24;53H   [14;19H[24;67H2-19[14;19H[?25h[?25l[24;53H~@k[14;19H[24;53H   [14;18H[24;67H1-18[14;18H[?25h[?25l[24;53H~@k[14;18H[24;53H   [14;17H[24;67H0-17[14;17H[?25h[?25l[24;53H~@k[14;17H[24;53H   [14;16H[24;66H9-16 [14;16H[?25h[?25l[24;53H~@k[14;16H[24;53H   [14;15H[24;66H8-15[14;15H[?25h[?25l[24;53H~@k[14;15H[24;53H   [14;14H[24;66H7-14[14;14H[?25h[?25l[24;53H~@k[14;14H[24;53H   [14;13H[24;66H6-13[14;13H[?25h[?25l[24;53H~@k[14;13H[24;53H   [14;12H[24;66H5-12[14;12H[?25h[?25l[24;53H~@k[14;12H[24;53H   [14;11H[24;66H4-11[14;11H[?25h[?25l[24;53H~@k[14;11H[24;53H   [14;10H[24;66H3-10[14;10H[?25h[?25l[24;53H~@k[14;10H[24;53H   [14;9H[24;66H2-9 [14;9H[?25h[?25l[24;53H~@k[14;9H[24;53H   [14;10H[24;66H3-10[14;10H[?25h[?25l[24;53H~@k[14;10H[24;53H   [14;9H[24;66H2-9 [14;9H[?25h[?25l[24;53H~@k[14;9H[24;53H   [14;9H[24;53Hdl[14;9H[24;53H  [14;9H [34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc bc i cannot be same as argc[m[30m[47m[14;54H[K]2;hello.cc + (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[14;9H[?25h[?25l[24;53H~@k[14;9H[24;53H   [14;9H[24;53Hdl[14;9H[24;53H  [14;9H[34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc bc i cannot be same as argc[m[30m[47m[14;53H[K[14;9H[?25h[?25l[24;53H~@k[14;9H[24;53H   [14;8H[24;66H1-8[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [13;8H[106m{[22;3H}[m[30m[47m[24;64H0,8  [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [14;8H[13;8H{[22;3H}[24;64H1,1-8[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [13;8H[106m{[22;3H}[m[30m[47m[24;64H0,8  [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [12;3H[9;18H[106m{[12;3H}[m[30m[47m[13;8H{[22;3H}[24;63H39,3[12;3H[?25h[?25l[24;53H~@k[12;3H[24;53H   [11;8H[9;18H{[12;3H}[24;64H8,8[11;8H[?25h[?25l[24;53H~@k[11;8H[24;53H   [10;8H[24;64H7[10;8H[?25h[?25l[24;53H~@k[10;8H[24;53H   [9;8H[24;64H6[9;8H[?25h[?25l[24;53H~@k[9;8H[24;53H   [8;1H[106m{[23;1H}[m[30m[47m[24;64H5,1[8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [7;8H
{[23;1H}[24;64H4,8[7;8H[?25h[?25l[24;53H~@k[7;8H[24;53H   [6;3H[24;64H3,3[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H32,0-1[8C96%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H31,0-1[8C92%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[4;1H[106m{

}[m[30m[47m[24;63H[K[24;63H30,1[10C88%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H}[5;1H{

}[24;63H[K[24;63H29,8[10C85%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;3H}[6;1H[106m{

}[m[30m[47m[24;63H[K[24;63H28,1[10C81%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[7;1H{

}[24;63H[K[24;63H27,8[10C77%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H26,8[10C74%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H25,0-1[8C70%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H24,1[10C66%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;3H[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H23,3[10C62%[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H22,8[10C59%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;5H[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130mif[m[30m[47m (!inWord && std::isalpha(in[i])) {[4;10H[106m{[6;5H}[m[30m[47m[24;63H[K[24;63H21,5[10C55%[6;5H[?25h[?25l[24;53H~@k[6;5H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;3H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m0[m[30m[47m; i < n; i++) {[5;10H{[7;5H}[24;63H[K[24;63H20,8[10C51%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;3H[32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in);[24;63H[K[24;63H19,8[10C48%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;5H[1;23r[1;1H[L[1;24r[1;3H[32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;[4;41H[106m{[6;5H}[m[30m[47m[24;63H[K[24;63H18,5[10C44%[6;5H[?25h[?25l[24;53H~@k[6;5H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H{[5;41H{[7;5H}[24;63H[K[24;63H17,8[10C40%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1HupcaseWords([32mconst[m[30m[47m [32mchar[m[30m[47m in[], [32mchar[m[30m[47m out[])[6;8H[106m([30C)[m[30m[47m[24;63H[K[24;63H16,8[10C37%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[32mvoid[m[30m[47m[7;8H([30C)[24;63H[K[24;63H15,8[10C33%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[34m */[m[30m[47m[24;63H[K[24;63H14,8[10C29%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[34m *  has enough space for the strlen(in) characters of in.[m[30m[47m[24;63H[K[24;63H13,8[10C25%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1H[34m *  results into out.  The caller is responsible to ensure that out[m[30m[47m[6;1H[106m{[18;1H}[m[30m[47m[24;63H[K[24;63H12,1[10C22%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[34m/** Upcase the initial letter of each word from in, copying the[m[30m[47m[7;1H{[19;1H}[24;63H[K[24;63H11,8[10C18%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;4H[1;23r[1;1H[L[1;24r[24;63H[K[24;63H10,4[10C14%[6;4H[?25h[?25l[24;53H~@k[6;4H[24;53H   [6;3H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstring>[m[30m[47m[24;63H[K[24;63H9,3[11C11%[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstdlib>[m[30m[47m[24;63H[K[24;63H8,8[12C7%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<iostream>[m[30m[47m[24;63H[K[24;63H7,8[12C3%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<locale>[m[30m[47m[24;63H[K[24;63H6,8[11CTop[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [5;1H[24;63H5,0-1[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [4;8H[24;63H4,8  [4;8H[?25h[?25l[24;53H~@k[4;8H[24;53H   [3;8H[24;63H3[3;8H[?25h[?25l[24;53H~@k[3;8H[24;53H   [2;8H[24;63H2[2;8H[?25h[?25l[24;53H~@k[2;8H[24;53H   [1;8H[24;63H1[1;8H[?25h[?25l[24;53H~@k[1;8H[24;53H   [1;8H[?25h[?25l[24;53H~@k[1;8H[24;53H   [1;8H[?25h[?25l[24;53H~@k[1;8H[24;53H   [2;8H[24;63H2[2;8H[?25h[?25l[24;53H~@k[2;8H[24;53H   [3;8H[24;63H3[3;8H[?25h[?25l[24;53H~@k[3;8H[24;53H   [4;8H[24;63H4[4;8H[?25h[?25l[24;53H~@k[4;8H[24;53H   [5;1H[24;63H5,0-1[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [6;8H[24;63H6,8  [6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [7;8H[24;63H7[7;8H[?25h[?25l[24;53H~@k[7;8H[24;53H   [8;8H[24;63H8[8;8H[?25h[?25l[24;53H~@k[8;8H[24;53H   [9;3H[24;63H9,3[9;3H[?25h[?25l[24;53H~@k[9;3H[24;53H   [10;4H[24;63H10,4[10;4H[?25h[?25l[24;53H~@k[10;4H[24;53H   [11;8H[24;64H1,8[11;8H[?25h[?25l[24;53H~@k[11;8H[24;53H   [12;1H[24;64H2,1[12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [13;8H[24;64H3,8[13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [14;8H[24;64H4[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [15;8H[24;64H5[15;8H[?25h[?25l[24;53H~@k[15;8H[24;53H   [16;8H[106m([30C)[m[30m[47m[24;64H6[16;8H[?25h[?25l[24;53H~@k[16;8H[24;53H   [17;8H[16;8H([30C)[24;64H7[17;8H[?25h[?25l[24;53H~@k[17;8H[24;53H   [18;5H[16;41H[106m{[18;5H}[m[30m[47m[24;64H8,5[18;5H[?25h[?25l[24;53H~@k[18;5H[24;53H   [18;8H[1;23r[23;1H
[1;24r[15;41H{[17;5H}[23;1H}[24;63H[K[24;63H19,8[11C3%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[24;63H[K[24;63H20,8[11C7%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;5H[1;23r[23;1H
[1;24r[16;10H[106m{[18;5H}[m[30m[47m[23;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H21,5[10C11%[18;5H[?25h[?25l[24;53H~@k[18;5H[24;53H   [18;8H[1;23r[23;1H
[1;24r[15;10H{[17;5H}[23;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H22,8[10C14%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;3H[1;23r[23;1H
[1;24r[10;31H[106m{[18;3H}[m[30m[47m[23;1H{[24;63H[K[24;63H23,3[10C18%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;1H[1;23r[23;1H
[1;24r[6;1H[106m{[m[30m[47m[9;31H{[17;3H}
[106m}[m[30m[47m[23;3Hstd::cout << [31m"Hello "[m[30m[47m << name << std::endl;[24;63H[K[24;63H24,1[10C22%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[5;1H{[17;1H}[23;1H}[24;63H[K[24;63H25,0-1[8C25%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;8H[1;23r[23;1H
[1;24r[24;63H[K[24;63H26,8[10C29%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[24;63H[K[24;63H27,8[10C33%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[106m{

}[m[30m[47m


[32mint[m[30m[47m[24;63H[K[24;63H28,1[10C37%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;8H[1;23r[23;1H
[1;24r[17;1H{

}[23;1Hmain([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])[24;63H[K[24;63H29,8[10C40%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;1H[1;23r[23;1H
[1;24r[16;1H[106m{

}[m[30m[47m[23;1H{[24;63H[K[24;63H30,1[10C44%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[15;1H{

}[23;3H[1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {[24;63H[K[24;63H31,0-1[8C48%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hstd::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;[24;63H[K[24;63H32,0-1[8C51%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;3H[1;23r[23;1H
[1;24r[23;5Hstd::exit([31m1[m[30m[47m);[24;63H[K[24;63H33,3[10C55%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H34,8[10C59%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;3H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H35,1[10C62%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;9H[34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc bc i cannot be same as argc[m[30m[47m[24;63H[K[24;63H36,8[10C66%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;5H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i < argc; i++) {[24;63H[K[24;63H37,8[10C70%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[24;63H[K[24;63H38,8[10C74%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;3H[1;23r[23;1H
[1;24r[15;18H[106m{[18;3H}[m[30m[47m[23;7H[34m// account for terminating [m[30m[47m[31m1[m[30m[47m[34m char, all C strings end with temrinating '\[m[30m[47m[31m0[m[30m[47m[34m'[m[30m[47m[24;63H[K[24;63H39,3[10C77%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;8H[1;23r[23;1H
[1;24r[14;18H{[17;3H}[23;7H[32mchar[m[30m[47m friendlyName[strlen(name)+[31m1[m[30m[47m];[24;63H[K[24;63H40,8[10C81%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;7HupcaseWords(name, friendlyName);[24;63H[K[24;63H41,1-8[8C85%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;7HsayHello(friendlyName);[24;63H[K[24;63H42,8[10C88%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;5H}[24;63H[K[24;63H43,8[10C92%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [17;8H[24;64H2[17;8H[?25h[?25l[24;53H~@k[17;8H[24;53H   [16;8H[24;64H1,1-8[16;8H[?25h[?25l[24;53H~@k[16;8H[24;53H   [16;9H[24;66H2-9[16;9H[?25h[?25l[24;53H~@k[16;9H[24;53H   [16;10H[24;66H3-10[16;10H[?25h[?25l[24;53H~@k[16;10H[24;53H   [16;11H[24;66H4-11[16;11H[?25h[?25l[24;53H~@k[16;11H[24;53H   [16;12H[24;66H5-12[16;12H[?25h[?25l[24;53H~@k[16;12H[24;53H   [16;13H[24;66H6-13[16;13H[?25h[?25l[24;53H~@k[16;13H[24;53H   [16;14H[24;66H7-14[16;14H[?25h[?25l[24;53H~@k[16;14H[24;53H   [16;15H[24;66H8-15[16;15H[?25h[?25l[24;53H~@k[16;15H[24;53H   [16;16H[24;66H9-16[16;16H[?25h[?25l[24;53H~@k[16;16H[24;53H   [16;17H[24;66H10-17[16;17H[?25h[?25l[24;53H~@k[16;17H[24;53H   [16;18H[24;67H1-18[16;18H[?25h[?25l[24;53H~@k[16;18H[24;53H   [16;19H[24;67H2-19[16;19H[?25h[?25l[24;53H~@k[16;19H[24;53H   [16;20H[24;67H3-20[16;20H[?25h[?25l[24;53H~@k[16;20H[24;53H   [16;21H[24;67H4-21[16;21H[?25h[?25l[24;53H~@k[16;21H[24;53H   [16;22H[24;67H5-22[16;22H[?25h[?25l[24;53H~@k[16;22H[24;53H   [16;23H[24;67H6-23[16;23H[?25h[?25l[24;53H~@k[16;23H[24;53H   [16;24H[24;67H7-24[16;24H[?25h[?25l[24;53H~@k[16;24H[24;53H   [16;25H[24;67H8-25[16;25H[?25h[?25l[24;53H~@k[16;25H[24;53H   [16;26H[24;67H9-26[16;26H[?25h[?25l[24;53H~@k[16;26H[24;53H   [16;27H[24;66H20-27[16;27H[?25h[?25l[24;53H~@k[16;27H[24;53H   [16;28H[24;67H1-28[16;28H[?25h[?25l[24;53H~@k[16;28H[24;53H   [16;29H[24;67H2-29[16;29H[?25h[?25l[24;53H~@k[16;29H[24;53H   [16;30H[24;67H3-30[16;30H[?25h[?25l[24;53H~@k[16;30H[24;53H   [16;31H[24;67H4-31[16;31H[?25h[?25l[24;53H~@k[16;31H[24;53H   [16;32H[24;67H5-32[16;32H[?25h[?25l[24;53H~@k[16;32H[24;53H   [16;33H[24;67H6-33[16;33H[?25h[?25l[24;53H~@k[16;33H[24;53H   [16;34H[24;67H7-34[16;34H[?25h[?25l[24;53H~@k[16;34H[24;53H   [16;35H[24;67H8-35[16;35H[?25h[?25l[24;53H~@k[16;35H[24;53H   [16;36H[24;67H9-36[16;36H[?25h[?25l[24;53H~@k[16;36H[24;53H   [16;37H[24;66H30-37[16;37H[?25h[?25l[24;53H~@k[16;37H[24;53H   [16;38H[24;67H1-38[16;38H[?25h[?25l[24;53H~@k[16;38H[24;53H   [16;39H[24;67H2-39[16;39H[?25h[?25l[24;53H~@k[16;39H[24;53H   [16;40H[24;67H3-40[16;40H[?25h[?25l[24;53H~@k[16;40H[24;53H   [16;41H[24;67H4-41[16;41H[?25h[?25l[24;53H~@k[16;41H[24;53H   [16;42H[24;67H5-42[16;42H[?25h[?25l[24;53H~@k[16;42H[24;53H   [16;43H[24;67H6-43[16;43H[?25h[?25l[24;53H~@k[16;43H[24;53H   [16;44H[24;67H7-44[16;44H[?25h[?25l[24;53H~@k[16;44H[24;53H   [16;45H[24;67H8-45[16;45H[?25h[?25l[24;53H~@k[16;45H[24;53H   [16;46H[24;67H9-46[16;46H[?25h[?25l[24;53H~@k[16;46H[24;53H   [16;47H[24;66H40-47[16;47H[?25h[?25l[24;53H~@k[16;47H[24;53H   [16;48H[24;67H1-48[16;48H[?25h[?25l[24;53H~@k[16;48H[24;53H   [16;49H[24;67H2-49[16;49H[?25h[?25l[24;53H~@k[16;49H[24;53H   [16;50H[24;67H3-50[16;50H[?25h[?25l[24;53H~@k[16;50H[24;53H   [16;51H[24;67H4-51[16;51H[?25h[?25l[24;53H~@k[16;51H[24;53H   [16;52H[24;67H5-52[16;52H[?25h[?25l[24;53H~@k[16;52H[24;53H   [16;52H[?25h[?25l[24;53H~@k[16;52H[24;53H   [16;52H[?25h[?25l[24;53H~@k[16;52H[24;53H   [16;52H[?25h[?25l[24;53H~@k[16;52H[24;53H   [16;52H[?25h[?25l[24;53H~@k[16;52H[24;53H   [17;36H[106m{[23;5H}[m[30m[47m[24;64H2,36   [17;36H[?25h[?25l[24;53H~@k[17;36H[24;53H   [18;33H[17;36H{[23;5H}[24;64H3,33[18;33H[?25h[?25l[24;53H~@k[18;33H[24;53H   [18;52H[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H44,52[9C96%[18;52H[?25h[?25l[24;53H~@k[18;52H[24;53H   [18;40H[1;23r[23;1H
[1;24r[23;1H}[24;63H[K[24;63H45,40[9CBot[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [20;29H[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [21;5H[15;36H[106m{[21;5H}[m[30m[47m[24;64H8,5 [21;5H[?25h[?25l[24;53H~@k[21;5H[24;53H   [22;3H[13;8H[106m{[m[30m[47m[15;36H{[21;5H}
  [106m}[m[30m[47m[24;64H9,3[22;3H[?25h[?25l[24;53H~@k[22;3H[24;53H   [23;1H[8;1H[106m{[m[30m[47m[13;8H{[22;3H}
[106m}[m[30m[47m[24;63H50,1[23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [22;3H[8;1H{[13;8H[106m{[22;3H}[m[30m[47m
}[24;63H49,3[22;3H[?25h[?25l[24;53H~@k[22;3H[24;53H   [21;5H[13;8H{[15;36H[106m{[21;5H}[m[30m[47m
  }[24;64H8,5[21;5H[?25h[?25l[24;53H~@k[21;5H[24;53H   [20;29H[15;36H{[21;5H}[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [18;40H[24;64H5,40[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [17;52H[24;64H4,52[17;52H[?25h[?25l[24;53H~@k[17;52H[24;53H   [16;33H[24;64H3,33[16;33H[?25h[?25l[24;53H~@k[16;33H[24;53H   [15;36H[106m{[21;5H}[m[30m[47m[24;64H2,36[15;36H[?25h[?25l[24;53H~@k[15;36H[24;53H   [14;52H[15;36H{[21;5H}[24;64H1,45-52[14;52H[?25h[?25l[24;53H~@k[14;52H[24;53H   [13;8H[106m{[22;3H}[m[30m[47m[24;64H0,8    [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [14;52H[13;8H{[22;3H}[24;64H1,45-52[14;52H[?25h[?25l[24;53H~@k[14;52H[24;53H   [13;8H[106m{[22;3H}[m[30m[47m[24;64H0,8    [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [12;3H[9;18H[106m{[12;3H}[m[30m[47m[13;8H{[22;3H}[24;63H39,3[12;3H[?25h[?25l[24;53H~@k[12;3H[24;53H   [11;17H[9;18H{[12;3H}[24;64H8,17[11;17H[?25h[?25l[24;53H~@k[11;17H[24;53H   [10;52H[24;64H7,52[10;52H[?25h[?25l[24;53H~@k[10;52H[24;53H   [9;18H[106m{[12;3H}[m[30m[47m[24;64H6,18[9;18H[?25h[?25l[24;53H~@k[9;18H[24;53H   [8;1H[106m{[m[30m[47m[9;18H{[12;3H}[23;1H[106m}[m[30m[47m[24;64H5,1 [8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [7;34Hmain[106m([28C)[m[30m[47m
{[23;1H}[24;64H4,34[7;34H[?25h[?25l[24;53H~@k[7;34H[24;53H   [6;3H
main([28C)[24;64H3,3 [6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H32,0-1[8C96%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H31,0-1[8C92%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[4;1H[106m{

}[m[30m[47m[24;63H[K[24;63H30,1[10C88%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;45H[1;23r[1;1H[L[1;24r[1;1H}[5;1H{

}[24;63H[K[24;63H29,45[9C85%[6;45H[?25h[?25l[24;53H~@k[6;45H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;3H}[6;1H[106m{

}[m[30m[47m[24;63H[K[24;63H28,1[10C81%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;26H[1;23r[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[6;9H[106m([16C)[m[30m[47m
{

}[24;63H[K[24;63H27,26[9C77%[6;26H[?25h[?25l[24;53H~@k[6;26H[24;53H   [6;11H[1;23r[1;1H[L[1;24r[1;5H}[7;9H([16C)[24;63H[K[24;63H26,11[9C74%[6;11H[?25h[?25l[24;53H~@k[6;11H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H25,0-1[8C70%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H24,1[10C66%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;3H[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H23,3[10C62%[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;33H[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H22,33[9C59%[6;33H[?25h[?25l[24;53H~@k[6;33H[24;53H   [6;5H[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130mif[m[30m[47m (!inWord && std::isalpha(in[i])) {[4;10H[106m{[6;5H}[m[30m[47m[24;63H[K[24;63H21,5[10C55%[6;5H[?25h[?25l[24;53H~@k[6;5H[24;53H   [6;21H[1;23r[1;1H[L[1;24r[1;3H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m0[m[30m[47m; i < n; i++) {[5;10H{[7;5H}[24;63H[K[24;63H20,21[9C51%[6;21H[?25h[?25l[24;53H~@k[6;21H[24;53H   [6;10H[1;23r[1;1H[L[1;24r[1;3H[32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in);[6;10H[106m{[8;5H}[m[30m[47m[24;63H[K[24;63H19,10[9C48%[6;10H[?25h[?25l[24;53H~@k[6;10H[24;53H   [6;5H[1;23r[1;1H[L[1;24r[1;3H[32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;[4;41H[106m{[6;5H}[m[30m[47m[7;10H{[9;5H}[24;63H[K[24;63H18,5[10C44%[6;5H[?25h[?25l[24;53H~@k[6;5H[24;53H   [6;35H[1;23r[1;1H[L[1;24r[1;1H{[5;41H{[7;5H}[24;63H[K[24;63H17,35[9C40%[6;35H[?25h[?25l[24;53H~@k[6;35H[24;53H   [6;41H[1;23r[1;1H[L[1;24r[1;1HupcaseWords([32mconst[m[30m[47m [32mchar[m[30m[47m in[], [32mchar[m[30m[47m out[])[6;41H[106m{[8;5H}[m[30m[47m[24;63H[K[24;63H16,41[9C37%[6;41H[?25h[?25l[24;53H~@k[6;41H[24;53H   [6;31H[1;23r[1;1H[L[1;24r[1;1H[32mvoid[m[30m[47m[6;31H[106m{[m[30m[47m[7;41H{[9;5H}[14;3H[106m}[m[30m[47m[24;63H[K[24;63H15,31[9C33%[6;31H[?25h[?25l[24;53H~@k[6;31H[24;53H   [6;32H[1;23r[1;1H[L[1;24r[1;1H[34m */[m[30m[47m[7;31H{[15;3H}[24;63H[K[24;63H14,32[9C29%[6;32H[?25h[?25l[24;53H~@k[6;32H[24;53H   [6;22H[1;23r[1;1H[L[1;24r[1;1H[34m *  has enough space for the strlen(in) characters of in.[m[30m[47m[24;63H[K[24;63H13,22[9C25%[6;22H[?25h[?25l[24;53H~@k[6;22H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1H[34m *  results into out.  The caller is responsible to ensure that out[m[30m[47m[6;1H[106m{[18;1H}[m[30m[47m[24;63H[K[24;63H12,1[10C22%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;40H[1;23r[1;1H[L[1;24r[1;1H[34m/** Upcase the initial letter of each word from in, copying the[m[30m[47m[6;12H[106m([27C)[m[30m[47m
{[19;1H}[24;63H[K[24;63H11,40[9C18%[6;40H[?25h[?25l[24;53H~@k[6;40H[24;53H   [6;4H[1;23r[1;1H[L[1;24r[7;12H([27C)[24;63H[K[24;63H10,4[10C14%[6;4H[?25h[?25l[24;53H~@k[6;4H[24;53H   [6;3H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstring>[m[30m[47m[24;63H[K[24;63H9,3[11C11%[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;52H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstdlib>[m[30m[47m[24;63H[K[24;63H8,52[11C7%[6;52H[?25h[?25l[24;53H~@k[6;52H[24;53H   [6;52H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<iostream>[m[30m[47m[24;63H[K[24;63H7,52[11C3%[6;52H[?25h[?25l[24;53H~@k[6;52H[24;53H   [6;52H[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<locale>[m[30m[47m[24;63H[K[24;63H6,52[10CTop[6;52H[?25h[?25l[24;53H~@k[6;52H[24;53H   [5;1H[24;63H5,0-1[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [4;18H[24;63H4,18 [4;18H[?25h[?25l[24;53H~@k[4;18H[24;53H   [3;18H[24;63H3[3;18H[?25h[?25l[24;53H~@k[3;18H[24;53H   [4;18H[24;63H4[4;18H[?25h[?25l[24;53H~@k[4;18H[24;53H   [5;1H[24;63H5,0-1[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [6;52H[24;63H6,52 [6;52H[?25h[?25l[24;53H~@k[6;52H[24;53H   [7;52H[24;63H7[7;52H[?25h[?25l[24;53H~@k[7;52H[24;53H   [8;52H[24;63H8[8;52H[?25h[?25l[24;53H~@k[8;52H[24;53H   [9;3H[24;63H9,3 [9;3H[?25h[?25l[24;53H~@k[9;3H[24;53H   [10;4H[24;63H10,4[10;4H[?25h[?25l[24;53H~@k[10;4H[24;53H   [11;40H[11;12H[106m([27C)[m[30m[47m[24;64H1,40[11;40H[?25h[?25l[24;53H~@k[11;40H[24;53H   [12;1H[11;12H([27C)[24;64H2,1 [12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [13;22H[24;64H3,22[13;22H[?25h[?25l[24;53H~@k[13;22H[24;53H   [14;32H[24;64H4,3[14;32H[?25h[?25l[24;53H~@k[14;32H[24;53H   [15;31H[106m{[23;3H}[m[30m[47m[24;64H5,31[15;31H[?25h[?25l[24;53H~@k[15;31H[24;53H   [16;41H[15;31H{[16;41H[106m{[18;5H}[m[30m[47m[23;3H}[24;64H6,4[16;41H[?25h[?25l[24;53H~@k[16;41H[24;53H   [15;31H[106m{[m[30m[47m[16;41H{[18;5H}[23;3H[106m}[m[30m[47m[24;64H5,3[15;31H[?25h[?25l[24;53H~@k[15;31H[24;53H   [16;41H[15;31H{[16;41H[106m{[18;5H}[m[30m[47m[23;3H}[24;64H6,4[16;41H[?25h[?25l[24;53H~@k[16;41H[24;53H   [16;40H {[18;5H}[24;67H0[16;40H[?25h[?25l[24;53H~@k[16;40H[24;53H   [15;31H[106m{[23;3H}[m[30m[47m[24;64H5,31[15;31H[?25h[?25l[24;53H~@k[15;31H[24;53H   [14;32H[15;31H{[23;3H}[24;64H4,32[14;32H[?25h[?25l[24;53H~@k[14;32H[24;53H   [15;31H[106m{[23;3H}[m[30m[47m[24;64H5,31[15;31H[?25h[?25l[24;53H~@k[15;31H[24;53H   [16;40H[15;31H{[23;3H}[24;64H6,40[16;40H[?25h[?25l[24;53H~@k[16;40H[24;53H   [17;35H[24;64H7,35[17;35H[?25h[?25l[24;53H~@k[17;35H[24;53H   [18;5H[16;41H[106m{[18;5H}[m[30m[47m[24;64H8,5 [18;5H[?25h[?25l[24;53H~@k[18;5H[24;53H   [18;10H[1;23r[23;1H
[1;24r[15;41H{[17;5H}[18;10H[106m{[20;5H}[m[30m[47m


}[24;63H[K[24;63H19,10[10C3%[18;10H[?25h[?25l[24;53H~@k[18;10H[24;53H   [18;21H[1;23r[23;1H
[1;24r[17;10H{[19;5H}[24;63H[K[24;63H20,21[10C7%[18;21H[?25h[?25l[24;53H~@k[18;21H[24;53H   [18;5H[1;23r[23;1H
[1;24r[16;10H[106m{[18;5H}[m[30m[47m[23;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H21,5[10C11%[18;5H[?25h[?25l[24;53H~@k[18;5H[24;53H   [18;33H[1;23r[23;1H
[1;24r[15;10H{[17;5H}[23;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H22,33[9C14%[18;33H[?25h[?25l[24;53H~@k[18;33H[24;53H   [18;3H[1;23r[23;1H
[1;24r[10;31H[106m{[18;3H}[m[30m[47m[23;1H{[24;63H[K[24;63H23,3[10C18%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;1H[1;23r[23;1H
[1;24r[6;1H[106m{[m[30m[47m[9;31H{[17;3H}
[106m}[m[30m[47m[23;3Hstd::cout << [31m"Hello "[m[30m[47m << name << std::endl;[24;63H[K[24;63H24,1[10C22%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[5;1H{[17;1H}[23;1H}[24;63H[K[24;63H25,0-1[8C25%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;11H[1;23r[23;1H
[1;24r[24;63H[K[24;63H26,11[9C29%[18;11H[?25h[?25l[24;53H~@k[18;11H[24;53H   [18;26H[1;23r[23;1H
[1;24r[18;9H[106m([16C)[m[30m[47m[24;63H[K[24;63H27,26[9C33%[18;26H[?25h[?25l[24;53H~@k[18;26H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;9H([16C)
[106m{

}[m[30m[47m


[32mint[m[30m[47m[24;63H[K[24;63H28,1[10C37%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;40H[1;23r[23;1H
[1;24r[17;1H{

}[23;1Hmain([32mint[m[30m[47m argc, [32mconst[m[30m[47m [32mchar[m[30m[47m *argv[])[24;63H[K[24;63H29,40[9C40%[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [18;1H[1;23r[23;1H
[1;24r[16;1H[106m{

}[m[30m[47m[23;1H{[24;63H[K[24;63H30,1[10C44%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[15;1H{

}[23;3H[1m[38;5;130mif[m[30m[47m (argc == [31m1[m[30m[47m) {[24;63H[K[24;63H31,0-1[8C48%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hstd::cerr << [31m"usage: "[m[30m[47m << argv[[31m0[m[30m[47m] << [31m" NAME..."[m[30m[47m << std::endl;[24;63H[K[24;63H32,0-1[8C51%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;3H[1;23r[23;1H
[1;24r[23;5Hstd::exit([31m1[m[30m[47m);[24;63H[K[24;63H33,3[10C55%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;34H[1;23r[23;1H
[1;24r[18;5H[106m([28C)[m[30m[47m[23;3H}[24;63H[K[24;63H34,34[9C59%[18;34H[?25h[?25l[24;53H~@k[18;34H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;5H([28C)[23;3H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H35,1[10C62%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;18H[1;23r[23;1H
[1;24r[18;18H[106m{[21;3H}[m[30m[47m[23;9H[34m// add [m[30m[47m[31m1[m[30m[47m[34m to argc bc i cannot be same as argc[m[30m[47m[24;63H[K[24;63H36,18[9C66%[18;18H[?25h[?25l[24;53H~@k[18;18H[24;53H   [18;40H[1;23r[23;1H
[1;24r[17;18H{[20;3H}[23;5H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m1[m[30m[47m; i < argc; i++) {[24;63H[K[24;63H37,40[9C70%[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [18;17H[1;23r[23;1H
[1;24r[23;7H[32mconst[m[30m[47m [32mchar[m[30m[47m *name = argv[i];[24;63H[K[24;63H38,17[9C74%[18;17H[?25h[?25l[24;53H~@k[18;17H[24;53H   [18;3H[1;23r[23;1H
[1;24r[15;18H[106m{[18;3H}[m[30m[47m[23;7H[34m// account for terminating [m[30m[47m[31m1[m[30m[47m[34m char, all C strings end with temrinating '\[m[30m[47m[31m0[m[30m[47m[34m'[m[30m[47m[24;63H[K[24;63H39,3[10C77%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;8H[1;23r[23;1H
[1;24r[14;18H{[17;3H}[23;7H[32mchar[m[30m[47m friendlyName[strlen(name)+[31m1[m[30m[47m];[24;63H[K[24;63H40,8[10C81%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;40H[1;23r[23;1H
[1;24r[23;7HupcaseWords(name, friendlyName);[24;63H[K[24;63H41,33-40      85%[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [18;36H[1;23r[23;1H
[1;24r[23;7HsayHello(friendlyName);[24;63H[K[24;63H42,36[9C88%[18;36H[?25h[?25l[24;53H~@k[18;36H[24;53H   [18;33H[1;23r[23;1H
[1;24r[23;5H}[24;63H[K[24;63H43,33[9C92%[18;33H[?25h[?25l[24;53H~@k[18;33H[24;53H   [18;40H[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H44,40[9C96%[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [18;40H[1;23r[23;1H
[1;24r[23;1H}[24;63H[K[24;63H45,40[9CBot[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [20;29H[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [21;5H[15;36H[106m{[21;5H}[m[30m[47m[24;64H8,5 [21;5H[?25h[?25l[24;53H~@k[21;5H[24;53H   [22;3H[13;8H[106m{[m[30m[47m[15;36H{[21;5H}
  [106m}[m[30m[47m[24;64H9,3[22;3H[?25h[?25l[24;53H~@k[22;3H[24;53H   [23;1H[8;1H[106m{[m[30m[47m[13;8H{[22;3H}
[106m}[m[30m[47m[24;63H50,1[23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [22;3H[8;1H{[13;8H[106m{[22;3H}[m[30m[47m
}[24;63H49,3[22;3H[?25h[?25l[24;53H~@k[22;3H[24;53H   [21;5H[13;8H{[15;36H[106m{[21;5H}[m[30m[47m
  }[24;64H8,5[21;5H[?25h[?25l[24;53H~@k[21;5H[24;53H   [20;29H[15;36H{[21;5H}[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [18;40H[24;64H5,40[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [17;40H[24;64H4[17;40H[?25h[?25l[24;53H~@k[17;40H[24;53H   [16;33H[24;64H3,33[16;33H[?25h[?25l[24;53H~@k[16;33H[24;53H   [17;40H[24;64H4,40[17;40H[?25h[?25l[24;53H~@k[17;40H[24;53H   [18;40H[24;64H5[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [20;29H[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [21;5H[15;36H[106m{[21;5H}[m[30m[47m[24;64H8,5 [21;5H[?25h[?25l[24;53H~@k[21;5H[24;53H   [20;29H[15;36H{[21;5H}[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [18;40H[24;64H5,40[18;40H[?25h[?25l[24;53H~@k[18;40H[24;53H   [19;38H[24;64H6,38[19;38H[?25h[?25l[24;53H~@k[19;38H[24;53H   [20;29H[24;64H7,29[20;29H[?25h[?25l[24;53H~@k[20;29H[24;53H   [20;29H[24;1H[1m-- INSERT --[m[30m[47m[24;63H[K[24;63H47,29[9CBot[20;29H[?25h[?25l[24;66H30[20;30H[?25h[?25l[15;36H[106m{[21;5H}[m[30m[47m[24;64H8,6 [21;6H[?25h[?25l[13;8H[106m{[m[30m[47m[15;36H{[21;5H}
  [106m}[m[30m[47m[24;64H9,4[22;4H[?25h[?25l[8;1H[106m{[m[30m[47m[13;8H{[22;3H}
[106m}[m[30m[47m[24;63H50,2[23;2H[?25h[?25l[8;1H{[13;8H[106m{[22;3H}[m[30m[47m
}[24;63H49,4[22;4H[?25h[?25l[13;8H{[15;36H[106m{[21;5H}[m[30m[47m
  }[24;64H8,6[21;6H[?25h[?25l[15;36H{[21;5H}[24;64H7,30[20;30H[?25h[?25l[24;64H6[19;30H[?25h[?25l[24;64H5[18;30H[?25h[?25l[24;64H4[17;30H[?25h[?25l[16;30H[106m[[m[30m[47mi[106m][m[30m[47m[24;64H3[16;30H[?25h[?25l[i][24;64H2[15;30H[?25h[?25l[24;64H1,23-30[14;30H[?25h[?25l[13;8H[106m{[22;3H}[m[30m[47m[24;64H0,9    [13;9H[?25h[?25l[9;18H[106m{[12;3H}[m[30m[47m[13;8H{[22;3H}[24;63H39,4[12;4H[?25h[?25l[9;18H{[12;3H}[24;64H8,18[11;18H[?25h[?25l[24;64H7,30[10;30H[?25h[?25l[9;18H[106m{[12;3H}[m[30m[47m[24;64H6,19[9;19H[?25h[?25l[8;1H[106m{[m[30m[47m[9;18H{[12;3H}[23;1H[106m}[m[30m[47m[24;64H5,2 [8;2H[?25h[?25l{[23;1H}[24;64H4,30[7;30H[?25h[?25l
[106m{[23;1H}[m[30m[47m[24;64H5,2 [8;2H[?25h[?25l{[9;18H[106m{[12;3H}[m[30m[47m[23;1H}[24;64H6,19[9;19H[?25h[?25l{[12;3H}[24;64H7,30[10;30H[?25h[?25l[9;18H[106m{[12;3H}[m[30m[47m[24;64H6,19[9;19H[?25h[?25l[8;1H[106m{[m[30m[47m[9;18H{[12;3H}[23;1H[106m}[m[30m[47m[24;64H5,2 [8;2H[?25h[?25l{[23;1H}[24;64H4,30[7;30H[?25h[?25l[24;64H3,4 [6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1HsayHello([32mconst[m[30m[47m [32mchar[m[30m[47m *name)[24;63H[K[24;63H32,1[10C96%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[32mstatic[m[30m[47m [32mvoid[m[30m[47m[24;63H[K[24;63H31,1[10C92%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H30,2[10C88%[4;1H[106m{

}[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H}[24;63H[K[24;63H29,30[9C85%[5;1H{

}[6;30H[?25h[?25l[5;1H[106m{

}[m[30m[47m[24;63H30,2 [7;2H[?25h[?25l[5;1H{

}[24;63H29,30[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H}[24;63H[K[24;63H28,2[10C81%[6;1H[106m{

}[6;2H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[24;63H[K[24;63H27,27[9C77%[6;9H[106m([16C)[m[30m[47m
{

}[6;27H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H26,12[9C74%[7;9H([16C)[6;12H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H25,1[10C70%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H[1m[38;5;130melse[m[30m[47m {[24;63H[K[24;63H24,2[10C66%[6;2H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H23,4[10C62%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H22,30[9C59%[6;29H[106m[[m[30m[47mi[106m][?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;5H[1m[38;5;130mif[m[30m[47m (!inWord && std::isalpha(in[i])) {[24;63H[K[24;63H21,6[10C55%[4;10H[106m{[6;5H}[m[30m[47m[7;29H[i][6;6H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[1m[38;5;130mfor[m[30m[47m ([32mint[m[30m[47m i = [31m0[m[30m[47m; i < n; i++) {[24;63H[K[24;63H20,22[9C51%[5;10H{[7;5H}[6;22H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[32mconst[m[30m[47m [32mint[m[30m[47m n = std::strlen(in);[24;63H[K[24;63H19,11[9C48%[6;10H[106m{[8;5H}[6;11H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;3H[32mbool[m[30m[47m inWord = [31mfalse[m[30m[47m;[24;63H[K[24;63H18,6[10C44%[4;41H[106m{[6;5H}[m[30m[47m[7;10H{[9;5H}[6;6H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H{[24;63H[K[24;63H17,30[9C40%[5;41H{[7;5H}[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1HupcaseWords([32mconst[m[30m[47m [32mchar[m[30m[47m in[], [32mchar[m[30m[47m out[])[24;63H[K[24;63H16,30[9C37%[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[32mvoid[m[30m[47m[24;63H[K[24;63H15,30[9C33%[6;7H[106m([21C)[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H[34m */[m[30m[47m[24;63H[K[24;63H14,30[9C29%[7;7H([21C)[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m *  has enough space for the strlen(in) characters of in.[m[30m[47m[24;63H[K[24;63H13,23[9C25%[6;23H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[34m *  results into out.  The caller is responsible to ensure that out[m[30m[47m[24;63H[K[24;63H12,2[10C22%[6;1H[106m{[18;1H}[6;2H[?25h[?25l[1;23r[m[30m[47m[1;1H[L[1;24r[1;1H[34m/** Upcase the initial letter of each word from in, copying the[m[30m[47m[24;63H[K[24;63H11,30[9C18%[7;1H{[19;1H}[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H10,5[10C14%[6;5H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstring>[m[30m[47m[24;63H[K[24;63H9,4[11C11%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<cstdlib>[m[30m[47m[24;63H[K[24;63H8,30[11C7%[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<iostream>[m[30m[47m[24;63H[K[24;63H7,30[11C3%[6;30H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[35m#include [m[30m[47m[31m<locale>[m[30m[47m[24;63H[K[24;63H6,30[10CTop[6;30H[?25h[?25l[24;63H5,1 [5;1H[?25h[?25l[24;63H4,19[4;19H[?25h[?25l[24;63H3[3;19H[?25h[?25l[24;63H2,20[2;20H[?25h[?25l[24;63H3,19[3;19H[?25h[?25l[24;63H4[4;19H[?25h[?25l[24;63H5,1 [5;1H[?25h[?25l[24;63H6,30[6;30H[?25h[?25l[24;63H7[7;30H[?25h[?25l[24;63H8[8;30H[?25h[?25l[24;63H9,4 [9;4H[?25h[?25l[24;63H10,5[10;5H[?25h[?25l[24;64H1,30[11;30H[?25h[?25l[24;64H2,2 [12;2H[?25h[?25l[24;64H3,23[13;23H[?25h[?25l[24;64H4,30[14;30H[?25h[?25l[106m([m[30m[47min[106m)[m[30m[47m[24;67H1[14;31H[?25h[?25l[24;67H2[14;32H[?25h[?25l+;(in)[24;67H3[14;33H[?25h[?25l[31m1[m[30m[47m;[24;67H4[14;34H[?25h[?25l[24;64H3,23[13;23H[?25h[?25l[14;23r[14;1H[L[1;24r[24;63H[K[24;63H14,3[10CTop[14;3H[?25h[?25l/[24;66H4[14;4H[?25h[?25l[34m//[m[30m[47m[24;66H5[14;5H[?25h[?25l[34m [m[30m[47m[24;66H6[14;6H[?25h[?25l[34ma[m[30m[47m[24;66H7[14;7H[?25h[?25l[34mc[m[30m[47m[24;66H8[14;8H[?25h[?25l[34mc[m[30m[47m[24;66H9[14;9H[?25h[?25l[34mo[m[30m[47m[24;66H10[14;10H[?25h[?25l[34mu[m[30m[47m[24;67H1[14;11H[?25h[?25l[34mn[m[30m[47m[24;67H2[14;12H[?25h[?25l[34mt[m[30m[47m[24;67H3[14;13H[?25h[?25l[34m [m[30m[47m[24;67H4[14;14H[?25h[?25l[34mf[m[30m[47m[24;67H5[14;15H[?25h[?25l[34mo[m[30m[47m[24;67H6[14;16H[?25h[?25l[34mr[m[30m[47m[24;67H7[14;17H[?25h[?25l[34m [m[30m[47m[24;67H8[14;18H[?25h[?25l[34mn[m[30m[47m[24;67H9[14;19H[?25h[?25l[34mu[m[30m[47m[24;66H20[14;20H[?25h[?25l[34ml[m[30m[47m[24;67H1[14;21H[?25h[?25l[34ml[m[30m[47m[24;67H2[14;22H[?25h[?25l[34m [m[30m[47m[24;67H3[14;23H[?25h[?25l[34mc[m[30m[47m[24;67H4[14;24H[?25h[?25l[34mh[m[30m[47m[24;67H5[14;25H[?25h[?25l[34ma[m[30m[47m[24;67H6[14;26H[?25h[?25l[34mr[m[30m[47m[24;67H7[14;27H[?25h[?25l[34ma[m[30m[47m[24;67H8[14;28H[?25h[?25l[34mc[m[30m[47m[24;67H9[14;29H[?25h[?25l[34mt[m[30m[47m[24;66H30[14;30H[?25h[?25l[34me[m[30m[47m[24;67H1[14;31H[?25h[?25l[34mr[m[30m[47m[24;67H2[14;32H[?25h[24;1H[K[14;31H[?25l[24;53H^[[14;31H[24;53H  [14;32H[24;63H14,31[9CTop[14;31H[?25h[?25l[24;53H:[14;31H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 51L, 1173C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[39;49m[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ vim hello.cc[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cls[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ccd 2-hello[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cls[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ccd 2-hello[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cls[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ccd ..[3Plscd 2-hello[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cls[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ccd ..vim hello.cc[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K[K[K[K[K[Kls
hello  hello.cc  Makefile  README
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ cd he[K[K[K[K[K./hello
usage: ./hello NAME...
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ h[Kh[K./hello b [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ca bby  brendan
Hello Abby
Hello Brendan
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ l[Kls
hello  hello.cc  Makefile  README
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ c[Kvim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 51L, 1173C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [34m// account for null character[m
  [32mconst[m [32mint[m n = std::strlen(in)+[31m1[m;
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[18;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[21;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);[24;63H14,31[9CTop]2;hello.cc (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[14;31H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [96m// account for null character[m
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in)+[95m1[m;
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[18;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[21;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);[24;63H14,31[9CTop"hello.cc" 51L, 1173C[14;31H[?25h[?25l[24;53H~@k[14;31H[24;53H   [13;22H[24;64H3,22[13;22H[?25h[?25l[24;53H~@k[13;22H[24;53H   [12;1H[24;64H2,1 [12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [11;22H[24;64H1,22[11;22H[?25h[?25l[24;53H~@k[11;22H[24;53H   [12;1H[24;64H2,1 [12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [13;22H[24;64H3,22[13;22H[?25h[?25l[24;53H~@k[13;22H[24;53H   [14;22H[24;64H4[14;22H[?25h[?25l[24;53H~@k[14;22H[24;53H   [15;22H[24;64H5[15;22H[?25h[?25l[24;53H~@k[15;22H[24;53H   [16;22H[24;64H6[16;22H[?25h[?25l[24;53H~@k[16;22H[24;53H   [17;22H[24;64H7[17;22H[?25h[?25l[24;53H~@k[17;22H[24;53H   [18;22H[24;64H8[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;5H[1;23r[23;1H
[1;24r[16;41H[46m{[18;5H}[m[23;3H}[24;1H[K[24;63H19,5[11C3%[18;5H[?25h[?25l[24;53H~@k[18;5H[24;53H   [18;10H[1;23r[23;1H
[1;24r[15;41H{[17;5H}[18;10H[46m{[20;5H}[m


}[24;63H[K[24;63H20,10[10C7%[18;10H[?25h[?25l[24;53H~@k[18;10H[24;53H   [18;21H[1;23r[23;1H
[1;24r[17;10H{[19;5H}[24;63H[K[24;63H21,21[9C10%[18;21H[?25h[?25l[24;53H~@k[18;21H[24;53H   [18;5H[1;23r[23;1H
[1;24r[16;10H[46m{[18;5H}[m[23;1H[38;5;121mstatic[m [38;5;121mvoid[m[24;63H[K[24;63H22,5[10C14%[18;5H[?25h[?25l[24;53H~@k[18;5H[24;53H   [18;22H[1;23r[23;1H
[1;24r[15;10H{[17;5H}[23;1HsayHello([38;5;121mconst[m [38;5;121mchar[m *name)[24;63H[K[24;63H23,22[9C17%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;3H[1;23r[23;1H
[1;24r[10;31H[46m{[18;3H}[m[23;1H{[24;63H[K[24;63H24,3[10C21%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;1H[1;23r[23;1H
[1;24r[5;1H[46m{[m[9;31H{[17;3H}
[46m}[m[23;3Hstd::cout << [95m"Hello "[m << name << std::endl;[24;63H[K[24;63H25,1[10C25%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[4;1H{[17;1H}[23;1H}[24;63H[K[24;63H26,0-1[8C28%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;11H[1;23r[23;1H
[1;24r[24;63H[K[24;63H27,11[9C32%[18;11H[?25h[?25l[24;53H~@k[18;11H[24;53H   [18;22H[1;23r[23;1H
[1;24r[24;63H[K[24;63H28,22[9C35%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m{

}[m


[38;5;121mint[m[24;63H[K[24;63H29,1[10C39%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;22H[1;23r[23;1H
[1;24r[17;1H{

}[23;1Hmain([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])[24;63H[K[24;63H30,22[9C42%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;1H[1;23r[23;1H
[1;24r[16;1H[46m{

}[m[23;1H{[24;63H[K[24;63H31,1[10C46%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[15;1H{

}[23;3H[93mif[m (argc == [95m1[m) {[24;63H[K[24;63H32,0-1[8C50%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hstd::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[24;63H[K[24;63H33,0-1[8C53%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;3H[1;23r[23;1H
[1;24r[23;5Hstd::exit([95m1[m);[24;63H[K[24;63H34,3[10C57%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;22H[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H35,22[9C60%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;3H[93melse[m {[24;63H[K[24;63H36,1[10C64%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;18H[1;23r[23;1H
[1;24r[18;18H[46m{[21;3H}[m[23;9H[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m[24;63H[K[24;63H37,18[9C67%[18;18H[?25h[?25l[24;53H~@k[18;18H[24;53H   [18;22H[1;23r[23;1H
[1;24r[17;18H{[20;3H}[23;5H[93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[24;63H[K[24;63H38,22[9C71%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;17H[1;23r[23;1H
[1;24r[23;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[24;63H[K[24;63H39,17[9C75%[18;17H[?25h[?25l[24;53H~@k[18;17H[24;53H   [18;3H[1;23r[23;1H
[1;24r[15;18H[46m{[18;3H}[m[23;7H[96m// account for terminating [m[95m1[m[96m char, all C strings end with temrinating '\[m[95m0[m[96m'[m[24;63H[K[24;63H40,3[10C78%[18;3H[?25h[?25l[24;53H~@k[18;3H[24;53H   [18;8H[1;23r[23;1H
[1;24r[14;18H{[17;3H}[23;7H[38;5;121mchar[m friendlyName[strlen(name)+[95m1[m];[24;63H[K[24;63H41,8[10C82%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;22H[1;23r[23;1H
[1;24r[23;7HupcaseWords(name, friendlyName);[24;63H[K[24;63H42,15-22      85%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;22H[1;23r[23;1H
[1;24r[23;7HsayHello(friendlyName);[24;63H[K[24;63H43,22[9C89%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;22H[1;23r[23;1H
[1;24r[23;5H}[24;63H[K[24;63H44,22[9C92%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;22H[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H45,22[9C96%[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [18;22H[1;23r[23;1H
[1;24r[23;1H}[24;63H[K[24;63H46,22[9CBot[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [19;22H[24;64H7[19;22H[?25h[?25l[24;53H~@k[19;22H[24;53H   [20;22H[24;64H8[20;22H[?25h[?25l[24;53H~@k[20;22H[24;53H   [19;22H[24;64H7[19;22H[?25h[?25l[24;53H~@k[19;22H[24;53H   [18;22H[24;64H6[18;22H[?25h[?25l[24;53H~@k[18;22H[24;53H   [17;22H[24;64H5[17;22H[?25h[?25l[24;53H~@k[17;22H[24;53H   [16;22H[24;64H4[16;22H[?25h[?25l[24;53H~@k[16;22H[24;53H   [15;22H[24;64H3[15;22H[?25h[?25l[24;53H~@k[15;22H[24;53H   [14;22H[24;64H2,15-22[14;22H[?25h[?25l[24;53H~@k[14;22H[24;53H   [13;8H[46m{[22;3H}[m[24;64H1,8    [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [14;22H[13;8H{[22;3H}[24;64H2,15-22[14;22H[?25h[?25l[24;53H~@k[14;22H[24;53H   [14;22H[24;53Hdl[14;22H[24;53H  [14;22H[96mgc bc i cannot be same as argc[m[14;52H[K]2;hello.cc + (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[14;22H[?25h[?25l[24;53Hr[14;22H[?25h[?25l[24;54H~@k[14;22H[24;53H    [14;22H[?25h[?25l[24;53Hr[14;22H[?25h[?25l[24;54Hr[14;22H[24;53H  [14;22H[96mr[?25h[?25l[m[24;53H~@k[14;22H[24;53H   [14;22H[24;1H[1m-- INSERT --[m[24;63H[K[24;63H42,15-22      Bot[14;22H[?25h[?25l[1C[96mrc bc i cannot be same as argc[m[24;67H6-23[14;23H[?25h[?25l[96mc bc i cannot be same as argc[m[14;52H[K[14;23H[?25h[?25l[96mgc bc i cannot be same as argc[m[24;67H7-24[14;24H[?25h[?25l[24;67H6-23[14;23H[?25h[?25l[24;67H5-22[14;22H[?25h[?25l[24;67H4-21[14;21H[?25h[?25l[24;67H3-20[14;20H[?25h[?25l[24;67H2-19[14;19H[?25h[?25l[24;67H1-18[14;18H[?25h[?25l[24;67H0-17[14;17H[?25h[?25l[24;66H9-16 [14;16H[?25h[?25l[24;66H8-15[14;15H[?25h[?25l[24;66H7-14[14;14H[?25h[?25l[24;66H6-13[14;13H[?25h[?25l[24;66H5-12[14;12H[?25h[?25l[24;66H4-11[14;11H[?25h[?25l[24;66H3-10[14;10H[?25h[?25l[24;66H2-9 [14;9H[?25h[?25l[24;66H1  [14;1H[?25h[?25l[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m[14;45H[K[14;1H[?25h[?25l[24;64H3[15;1H[?25h[?25l[24;64H2[14;1H[?25h[?25l        [96m// add [m[95m1[m[1C[96mto argc bc i cannot be same as argc[m[24;66H2-9[14;9H[?25h[?25l[15;9H[46m([24C)[m[24;64H3,9  [15;9H[?25h[?25l([24C)[24;64H4[16;9H[?25h[?25l[24;64H5[17;9H[?25h[?25l[24;64H6[18;9H[?25h[?25l[24;64H7[19;9H[?25h[?25l[24;64H8[20;9H[?25h[?25l[15;36H[46m{[21;5H}[m[24;64H9,6[21;6H[?25h[?25l[13;8H[46m{[m[15;36H{[21;5H}
  [46m}[m[24;63H50,4[22;4H[?25h[?25l[8;1H[46m{[m[13;8H{[22;3H}
[46m}[m[24;64H1,2[23;2H[?25h[?25l[8;1H{[13;8H[46m{[22;3H}[m
}[24;64H0,4[22;4H[?25h[?25l[8;1H[46m{[m[13;8H{[22;3H}
[46m}[m[24;64H1,2[23;2H[?25h[?25l[8;1H{[13;8H[46m{[22;3H}[m
}[24;64H0,4[22;4H[?25h[?25l[13;8H{[15;36H[46m{[21;5H}[m
  }[24;63H49,6[21;6H[?25h[?25l[15;36H{[21;5H}[24;64H8,9[20;9H[?25h[?25l[24;64H7[19;9H[?25h[?25l[24;64H6[18;9H[?25h[?25l[24;64H5[17;9H[?25h[?25l[24;64H4[16;9H[?25h[?25l[15;9H[46m([24C)[m[24;64H3[15;9H[?25h[?25l([24C)[24;64H2,2-9[14;9H[?25h[?25l[13;8H[46m{[22;3H}[m[24;64H1,9  [13;9H[?25h[?25l[9;18H[46m{[12;3H}[m[13;8H{[22;3H}[24;64H0,4[12;4H[?25h[?25l[9;18H{[12;3H}[24;63H39,9[11;9H[?25h[?25l[24;64H8[10;9H[?25h[?25l[24;64H7[9;9H[?25h[?25l[8;1H[46m{[23;1H}[m[24;64H6,2[8;2H[?25h[?25l{[23;1H}[24;64H5,9[7;9H[?25h[?25l[24;64H4,4[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1HsayHello([38;5;121mconst[m [38;5;121mchar[m *name)[24;63H[K[24;63H33,1[10C96%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[38;5;121mstatic[m [38;5;121mvoid[m[24;63H[K[24;63H32,1[10C92%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H31,2[10C89%[4;1H[46m{

}[?25h[?25l[1;23r[m[1;1H[L[1;24r[1;1H}[24;63H[K[24;63H30,9[10C85%[5;1H{

}[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H}[24;63H[K[24;63H29,2[10C82%[6;1H[46m{

}[6;2H[?25h[?25l[1;23r[m[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[24;63H[K[24;63H28,9[10C78%[6;9H[46m([16C)[m
{

}[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H27,9[10C75%[7;9H([16C)[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H26,1[10C71%[6;1H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H[93melse[m {[24;63H[K[24;63H25,2[10C67%[6;2H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H24,4[10C64%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H23,9[10C60%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;5H[93mif[m (!inWord && std::isalpha(in[i])) {[24;63H[K[24;63H22,6[10C57%[4;10H[46m{[6;5H}[?25h[?25l[1;23r[m[1;1H[L[1;24r[1;3H[93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {[24;63H[K[24;63H21,9[10C53%[5;10H{[7;5H}[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[38;5;121mconst[m [38;5;121mint[m n = std::strlen(in)+[95m1[m;[24;63H[K[24;63H20,9[10C50%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;3H[96m// account for null character[m[24;63H[K[24;63H19,6[10C46%[4;41H[46m{[6;5H}[?25h[?25l[1;23r[m[1;1H[L[1;24r[1;3H[38;5;121mbool[m inWord = [95mfalse[m;[24;63H[K[24;63H18,9[10C42%[5;41H{[7;5H}[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H{[24;63H[K[24;63H17,9[10C39%[6;8H[46m([30C)[6;9H[?25h[?25l[1;23r[m[1;1H[L[1;24r[1;1HupcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])[24;63H[K[24;63H16,9[10C35%[7;8H([30C)[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[38;5;121mvoid[m[24;63H[K[24;63H15,9[10C32%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[96m */[m[24;63H[K[24;63H14,9[10C28%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[96m *  has enough space for the strlen(in) characters of in.[m[24;63H[K[24;63H13,9[10C25%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[96m *  results into out.  The caller is responsible to ensure that out[m[24;63H[K[24;63H12,2[10C21%[6;1H[46m{[19;1H}[6;2H[?25h[?25l[1;23r[m[1;1H[L[1;24r[1;1H[96m/** Upcase the initial letter of each word from in, copying the[m[24;63H[K[24;63H11,9[10C17%[7;1H{[20;1H}[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[24;63H[K[24;63H10,5[10C14%[6;5H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<cstring>[m[24;63H[K[24;63H9,4[11C10%[6;4H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<cstdlib>[m[24;63H[K[24;63H8,9[12C7%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<iostream>[m[24;63H[K[24;63H7,9[12C3%[6;9H[?25h[?25l[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<locale>[m[24;63H[K[24;63H6,9[11CTop[6;9H[?25h[?25l[24;63H5,1[5;1H[?25h[?25l[24;63H4,9[4;9H[?25h[?25l[24;63H3[3;9H[?25h[?25l[24;63H2[2;9H[?25h[?25l[24;63H1[1;9H[?25h[?25l[24;63H2[2;9H[?25h[?25l[24;63H3[3;9H[?25h[?25l[24;63H4[4;9H[?25h[?25l[24;63H5,1[5;1H[?25h[?25l[24;63H6,9[6;9H[?25h[?25l[24;63H7[7;9H[?25h[?25l[24;63H8[8;9H[?25h[?25l[24;63H9,4[9;4H[?25h[?25l[24;63H10,5[10;5H[?25h[?25l[24;64H1,9[11;9H[?25h[?25l[24;64H2,2[12;2H[?25h[?25l[24;64H3,9[13;9H[?25h[?25l[24;64H4[14;9H[?25h[?25l[24;64H5[15;9H[?25h[?25l[24;64H6[16;9H[?25h[?25l[17;8H[46m([30C)[m[24;64H7[17;9H[?25h[?25l([30C)[24;64H8[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H19,6[11C3%[16;41H[46m{[18;5H}[?25h[?25l[1;23r[m[23;1H
[1;24r[23;1H}[24;63H[K[24;63H20,9[11C7%[15;41H{[17;5H}[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H21,9[10C10%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H[38;5;121mstatic[m [38;5;121mvoid[m[24;63H[K[24;63H22,6[10C14%[16;10H[46m{[18;5H}[?25h[?25l[1;23r[m[23;1H
[1;24r[23;1HsayHello([38;5;121mconst[m [38;5;121mchar[m *name)[24;63H[K[24;63H23,9[10C17%[15;10H{[17;5H}[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H{[24;63H[K[24;63H24,4[10C21%[10;31H[46m{[18;3H}[?25h[?25l[1;23r[m[23;1H
[1;24r[23;3Hstd::cout << [95m"Hello "[m << name << std::endl;[24;63H[K[24;63H25,2[10C25%[5;1H[46m{[m[9;31H{[17;3H}
[46m}[?25h[?25l[1;23r[m[23;1H
[1;24r[23;1H}[24;63H[K[24;63H26,1[10C28%[4;1H{[17;1H}
[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H27,9[10C32%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[24;63H[K[24;63H28,9[10C35%[18;9H[46m([16C)[18;9H[?25h[?25l[1;23r[m[23;1H
[1;24r[23;1H[38;5;121mint[m[24;63H[K[24;63H29,2[10C39%[17;9H([16C)
[46m{

}[18;2H[?25h[?25l[1;23r[m[23;1H
[1;24r[23;1Hmain([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])[24;63H[K[24;63H30,9[10C42%[17;1H{

}[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H{[24;63H[K[24;63H31,2[10C46%[16;1H[46m{

}[?25h[?25l[1;23r[m[23;1H
[1;24r[23;3H[93mif[m (argc == [95m1[m) {[24;63H[K[24;63H32,1[10C50%[15;1H{

}
[?25h[?25l[1;23r[23;1H
[1;24r[23;5Hstd::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[24;63H[K[24;63H33,1[10C53%[18;1H[?25h[?25l[1;23r[23;1H
[1;24r[23;5Hstd::exit([95m1[m);[24;63H[K[24;63H34,4[10C57%[18;4H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H35,9[10C60%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H[93melse[m {[24;63H[K[24;63H36,2[10C64%[18;2H[?25h[?25l[1;23r[23;1H
[1;24r[23;9H[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m[24;63H[K[24;63H37,9[10C67%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;5H[93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[24;63H[K[24;63H38,9[10C71%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[24;63H[K[24;63H39,9[10C75%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;7H[96m// account for terminating [m[95m1[m[96m char, all C strings end with temrinating '\[m[95m0[m[96m'[m[24;63H[K[24;63H40,4[10C78%[15;18H[46m{[18;3H}[?25h[?25l[1;23r[m[23;1H
[1;24r[23;7H[38;5;121mchar[m friendlyName[strlen(name)+[95m1[m];[24;63H[K[24;63H41,9[10C82%[14;18H{[17;3H}[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;7HupcaseWords(name, friendlyName);[24;63H[K[24;63H42,2-9[8C85%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;7HsayHello(friendlyName);[24;63H[K[24;63H43,9[10C89%[18;9H[46m([24C)[18;9H[?25h[?25l[1;23r[m[23;1H
[1;24r[23;5H}[24;63H[K[24;63H44,9[10C92%[17;9H([24C)[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;3H}[24;63H[K[24;63H45,9[10C96%[18;9H[?25h[?25l[1;23r[23;1H
[1;24r[23;1H}[24;63H[K[24;63H46,9[10CBot[18;9H[?25h[?25l[24;64H7[19;9H[?25h[?25l[24;64H8[20;9H[?25h[?25l[15;36H[46m{[21;5H}[m[24;64H9,6[21;6H[?25h[?25l[13;8H[46m{[m[15;36H{[21;5H}
  [46m}[m[24;63H50,4[22;4H[?25h[?25l[8;1H[46m{[m[13;8H{[22;3H}
[46m}[m[24;64H1,2[23;2H[?25h[24;1H[K[23;1H[?25l[24;53H^[[23;1H[24;53H  [23;2H[24;63H51,1[10CBot[23;1H[?25h[?25l[24;53H:[23;1H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 51L, 1173C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ gdb hello [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ko
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) p n[K[K[Kstart bart lisa
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/2-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe758) at hello.cc:36
warning: Source file is more recent than executable.
36	{
(gdb) q
A debugging session is active.

	Inferior 1 [process 320909] will be killed.

Quit anyway? (y or n) y
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ a[Kmake
g++ -g -Wall -std=c++17    hello.cc   -o hello
gamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ gd[Kg[Kdb hello [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[Khell o
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
hhello: No such file or directory.
(gdb) q
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ gdb hello [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ko
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) p [K[Kstart bart lisa
Temporary breakpoint 1 at 0x12e4: file hello.cc, line 37.
Starting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/2-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe758) at hello.cc:37
37	  if (argc == 1) {
(gdb) h[Kp n
No symbol "n" in current context.
(gdb) p argv
$1 = (const char **) 0x7fffffffe758
(gdb) q
A debugging session is active.

	Inferior 1 [process 320967] will be killed.

Quit anyway? (y or n) y
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ vm[Kim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 51L, 1173C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
[106m{[m
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {[14;9H[34m// add [m[31m1[m[34m to argc bc i cannot be same as argc[m
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[16;7H[32mconst[m [32mchar[m *name = argv[i];[17;7H[34m// account for terminating [m[31m1[m[34m char, all C strings end with temrinating '\[m[31m0[m[34m'[m[18;7H[32mchar[m friendlyName[strlen(name)+[31m1[m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
[106m}[m[24;63H51,1[10CBot]2;hello.cc (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[23;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
[46m{[m
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {[14;9H[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[16;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[17;7H[96m// account for terminating [m[95m1[m[96m char, all C strings end with temrinating '\[m[95m0[m[96m'[m[18;7H[38;5;121mchar[m friendlyName[strlen(name)+[95m1[m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
[46m}[m[24;63H51,1[10CBot"hello.cc" 51L, 1173C[23;1H[?25h[?25l[24;53H~@k[23;1H[24;53H   [22;1H[8;1H{[23;1H}[24;64H0[22;1H[?25h[?25l[24;53H~@k[22;1H[24;53H   [21;1H[24;63H49[21;1H[?25h[?25l[24;53H~@k[21;1H[24;53H   [20;1H[24;64H8[20;1H[?25h[?25l[24;53H~@k[20;1H[24;53H   [19;1H[24;64H7[19;1H[?25h[?25l[24;53H~@k[19;1H[24;53H   [18;1H[24;64H6[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[24;64H5[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [16;1H[24;64H4[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [15;1H[24;64H3[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [14;8H[24;64H2,1-8[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [14;1H[24;1H[1m-- INSERT --[m[24;13H[K[24;63H42,1[10CBot[14;1H[?25h[?25l[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m[14;45H[K]2;hello.cc + (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[14;1H[?25h[?25l        [96m// add [m[95m1[m[1C[96mto argc bc i cannot be same as argc[m[24;66H2-9[14;9H[?25h[?25l[24;66H1  [14;1H[?25h[?25l[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m[14;45H[K[14;1H[?25h[?25l        [96m// add [m[95m1[m[1C[96mto argc bc i cannot be same as argc[m[24;66H2-9[14;9H[?25h[?25l[24;66H1  [14;1H[?25h[?25l[24;66H2-9[14;9H[?25h[?25l[13;8H[46m{[22;3H}[m[24;64H1,9  [13;9H[?25h[?25l[9;18H[46m{[12;3H}[m[13;8H{[22;3H}[24;64H0,4[12;4H[?25h[?25l[9;18H{[12;3H}[13;8H[46m{[22;3H}[m[24;64H1,9[13;9H[?25h[?25l{[22;3H}[24;64H2,2-9[14;9H[?25h[?25l[15;9H[46m([24C)[m[24;64H3,9  [15;9H[?25h[?25l([24C)[24;64H4[16;9H[?25h[24;1H[K[16;8H[?25l[24;53H^[[16;8H[24;53H  [16;9H[24;63H44,8[10CBot[16;8H[?25h[?25l[24;53H:[16;8H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 51L, 1173C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ ./hello a bby brendan
Hello Abby
Hello Brendan
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ o[K./hello l ol
Hello Lol
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ ls
lab0  lab1  lab2  lab2.LOG
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ ls
lab0  lab1  lab2  lab2.LOG
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ cd lab2
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd h[K3-overload
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/3-overload$ ls
Makefile  overload  overload.cc
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/3-overload$ vim ov erload.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"overload.cc" 16L, 282C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m

[32mint[m f([32mint[m *a) { [38;5;130mreturn[m *a * [31m2[m; }
[32mint[m f([32mint[m a) { [38;5;130mreturn[m a + [31m1[m;}
[32mint[m f([32mint[m a, [32mint[m b) { [38;5;130mreturn[m a - b; }

[32mint[m
main() {
  [32mint[m a = [31m2[m;
  [32mint[m b = [31m3[m;
  std::cout
    << [31m"f(a) = "[m << f(a)
    << [31m"; f(&a) = "[m << f(&a)
    << [31m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[94m~                                                                               [18;1H~                                                                               [19;1H~                                                                               [20;1H~                                                                               [21;1H~                                                                               [22;1H~                                                                               [23;1H~                                                                               [m[24;63H1,1[11CAll]2;overload.cc (~/projects/i240b/submit/lab2/3-overload) - VIM]1;overload.cc[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m

[38;5;121mint[m f([38;5;121mint[m *a) { [93mreturn[m *a * [95m2[m; }
[38;5;121mint[m f([38;5;121mint[m a) { [93mreturn[m a + [95m1[m;}
[38;5;121mint[m f([38;5;121mint[m a, [38;5;121mint[m b) { [93mreturn[m a - b; }

[38;5;121mint[m
main() {
  [38;5;121mint[m a = [95m2[m;
  [38;5;121mint[m b = [95m3[m;
  std::cout
    << [95m"f(a) = "[m << f(a)
    << [95m"; f(&a) = "[m << f(&a)
    << [95m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[94m~                                                                               [18;1H~                                                                               [19;1H~                                                                               [20;1H~                                                                               [21;1H~                                                                               [22;1H~                                                                               [23;1H~                                                                               [m[24;63H1,1[11CAll"overload.cc" 16L, 282C[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[?25h[?25l[24;53H:[1;1H[24;1H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/3-overload$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd 2-hello
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ ls
hello  hello.cc  Makefile  README
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ vim hello .cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 51L, 1173C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {[14;9H[34m// add [m[31m1[m[34m to argc bc i cannot be same as argc[m
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[16;7H[32mconst[m [32mchar[m *name = argv[i];[17;7H[34m// account for terminating [m[31m1[m[34m char, all C strings end with temrinating '\[m[31m0[m[34m'[m[18;7H[32mchar[m friendlyName[strlen(name)+[31m1[m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H44,8[10CBot]2;hello.cc (~/projects/i240b/submit/lab2/2-hello) - VIM]1;hello.cc[16;8H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {[14;9H[96m// add [m[95m1[m[96m to argc bc i cannot be same as argc[m
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) {[16;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[17;7H[96m// account for terminating [m[95m1[m[96m char, all C strings end with temrinating '\[m[95m0[m[96m'[m[18;7H[38;5;121mchar[m friendlyName[strlen(name)+[95m1[m];[19;7HupcaseWords(name, friendlyName);[20;7HsayHello(friendlyName);
    }
  }
}[24;63H44,8[10CBot"hello.cc" 51L, 1173C[16;8H[?25h[?25l[24;53H~@k[16;8H[24;53H   [15;8H[24;64H3[15;8H[?25h[?25l[24;53H~@k[15;8H[24;53H   [14;8H[24;64H2,1-8[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [13;8H[46m{[22;3H}[m[24;64H1,8  [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [12;3H[9;18H[46m{[12;3H}[m[13;8H{[22;3H}[24;64H0,3[12;3H[?25h[?25l[24;53H~@k[12;3H[24;53H   [13;8H[9;18H{[12;3H}[13;8H[46m{[22;3H}[m[24;64H1,8[13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [14;8H[13;8H{[22;3H}[24;64H2,1-8[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [15;8H[24;64H3,8  [15;8H[?25h[?25l[24;53H~@k[15;8H[24;53H   [14;8H[24;64H2,1-8[14;8H[?25h[?25l[24;53H~@k[14;8H[24;53H   [13;8H[46m{[22;3H}[m[24;64H1,8  [13;8H[?25h[?25l[24;53H~@k[13;8H[24;53H   [12;3H[9;18H[46m{[12;3H}[m[13;8H{[22;3H}[24;64H0,3[12;3H[?25h[?25l[24;53H~@k[12;3H[24;53H   [11;8H[9;18H{[12;3H}[24;63H39,8[11;8H[?25h[?25l[24;53H~@k[11;8H[24;53H   [10;8H[24;64H8[10;8H[?25h[?25l[24;53H~@k[10;8H[24;53H   [9;8H[24;64H7[9;8H[?25h[?25l[24;53H~@k[9;8H[24;53H   [8;1H[46m{[23;1H}[m[24;64H6,1[8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [7;8H
{[23;1H}[24;64H5,8[7;8H[?25h[?25l[24;53H~@k[7;8H[24;53H   [6;3H[24;64H4,3[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1HsayHello([38;5;121mconst[m [38;5;121mchar[m *name)[24;1H[K[24;63H33,0-1[8C96%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1H[38;5;121mstatic[m [38;5;121mvoid[m[24;63H[K[24;63H32,0-1[8C92%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[4;1H[46m{

}[m[24;63H[K[24;63H31,1[10C89%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H}[5;1H{

}[24;63H[K[24;63H30,8[10C85%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;3H}[6;1H[46m{

}[m[24;63H[K[24;63H29,1[10C82%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;5HinWord = std::isalpha(in[i]);[7;1H{

}[24;63H[K[24;63H28,8[10C78%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H27,8[10C75%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;7Hout[i] = in[i];[24;63H[K[24;63H26,0-1[8C71%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;5H[93melse[m {[24;63H[K[24;63H25,1[10C67%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;3H[1;23r[1;1H[L[1;24r[1;5H}[24;63H[K[24;63H24,3[10C64%[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;7Hout[i] = std::toupper(in[i]);[24;63H[K[24;63H23,8[10C60%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;5H[1;23r[1;1H[L[1;24r[1;5H[93mif[m (!inWord && std::isalpha(in[i])) {[4;10H[46m{[6;5H}[m[24;63H[K[24;63H22,5[10C57%[6;5H[?25h[?25l[24;53H~@k[6;5H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;3H[93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {[5;10H{[7;5H}[24;63H[K[24;63H21,8[10C53%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;3H[38;5;121mconst[m [38;5;121mint[m n = std::strlen(in)+[95m1[m;[24;63H[K[24;63H20,8[10C50%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;5H[1;23r[1;1H[L[1;24r[1;3H[96m// account for null character[m[4;41H[46m{[6;5H}[m[24;63H[K[24;63H19,5[10C46%[6;5H[?25h[?25l[24;53H~@k[6;5H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;3H[38;5;121mbool[m inWord = [95mfalse[m;[5;41H{[7;5H}[24;63H[K[24;63H18,8[10C42%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H{[6;8H[46m([30C)[m[24;63H[K[24;63H17,8[10C39%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1HupcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])[7;8H([30C)[24;63H[K[24;63H16,8[10C35%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[38;5;121mvoid[m[24;63H[K[24;63H15,8[10C32%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[96m */[m[24;63H[K[24;63H14,8[10C28%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[96m *  has enough space for the strlen(in) characters of in.[m[24;63H[K[24;63H13,8[10C25%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;1H[1;23r[1;1H[L[1;24r[1;1H[96m *  results into out.  The caller is responsible to ensure that out[m[6;1H[46m{[19;1H}[m[24;63H[K[24;63H12,1[10C21%[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[96m/** Upcase the initial letter of each word from in, copying the[m[7;1H{[20;1H}[24;63H[K[24;63H11,8[10C17%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;4H[1;23r[1;1H[L[1;24r[24;63H[K[24;63H10,4[10C14%[6;4H[?25h[?25l[24;53H~@k[6;4H[24;53H   [6;3H[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<cstring>[m[24;63H[K[24;63H9,3[11C10%[6;3H[?25h[?25l[24;53H~@k[6;3H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<cstdlib>[m[24;63H[K[24;63H8,8[12C7%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<iostream>[m[24;63H[K[24;63H7,8[12C3%[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [6;8H[1;23r[1;1H[L[1;24r[1;1H[38;5;81m#include [m[95m<locale>[m[24;63H[K[24;63H6,8[11CTop[6;8H[?25h[?25l[24;53H~@k[6;8H[24;53H   [5;1H[24;63H5,0-1[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [4;8H[24;63H4,8  [4;8H[?25h[?25l[24;53H~@k[4;8H[24;53H   [3;8H[24;63H3[3;8H[?25h[?25l[24;53H~@k[3;8H[24;53H   [2;8H[24;63H2[2;8H[?25h[?25l[24;53H~@k[2;8H[24;53H   [1;8H[24;63H1[1;8H[?25h[?25l[24;53H~@k[1;8H[24;53H   [1;8H[?25h[?25l[24;53H~@k[1;8H[24;53H   [1;8H[?25h[?25l[24;53H~@k[1;8H[24;53H   [1;8H[?25h[?25l[24;53H^[[1;8H[24;53H  [1;8H[24;53H^[[1;8H[24;53H  [1;8H[?25h[?25l[24;53H:[1;8H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ ls
lab0  lab1  lab2  lab2.LOG
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ rm lab2.LOG
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ ls
lab0  lab1  lab2
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ cd lab2
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ vim lab2.log[K[K[KLOG
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"lab2.LOG" [noeol] 1464L, 208086C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HScript started on 2020-02-05 21:28:37-05:00 [TERM="xterm" TTY="/dev/pts/2" COLUMM[2;1HNS="100" LINES="35"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied[34m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ ls[34m^M[m
lab2.LOG[34m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ git pull[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^H^^[7;1H[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^G^G^G^G^G^G^G^G^G^G^G^G^G^G[mcd [34m^M[m
amchugh2@remote06:~$ ls[34m^M[m
amchugh2.circ  cs120lab7  Downloads[7Ci220a.bak  lab2[7Clab8      Templaa[10;1Htes[34m^M[m
Arduino[8Ccs220      git-repos[7Ci220a_new  lab2final  Music     tmp[34m^M[m
cs120[10Ccs240      git-repos_copy  i220X      lab2good   Pictures  toneMee[13;1Hlody[34m^M[m
cs120lab4      Desktop    good[12Ci240b      lab3[7Cprojects  Videoss[15;1H[34m^M[m
cs120lab6      Documents  i220a[11Clab[8Clab5[7CPublic[34m^M[m
amchugh2@remote06:~$ cd cs240[34m^M[m
amchugh2@remote06:~/cs240$ git pull[34m^M[m
/home/amchugh2/.bashrc: line 1: /home/umrigar/cs240/bin/student.rc: Permission dd[20;1Henied[34m^M[m
remote: Enumerating objects: 105, done.[34m^[[m[K[34m^M[m
remote: Counting objects:   0% (1/105)   [34m^[[m[K[34m^M[mremote: Counting objects:   1% (22[23;1H/105)   [34m^[[m[K[34m^M[mremote: Counting objects:   2% (3/105)   [34m^[[m[K[34m^M[mremote: Counting ob[23;1H[94m@@@                                                                             [m[24;63H1,1[11CTop]2;lab2.LOG (~/projects/i240b/submit/lab2) - VIM]1;lab2.LOG[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1HScript started on 2020-02-05 21:28:37-05:00 [TERM="xterm" TTY="/dev/pts/2" COLUMM[2;1HNS="100" LINES="35"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ ls[38;5;81m^M[m
lab2.LOG[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ git pull[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^^[7;1H[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G^G^G^G^G^G^G^G^G^G^G^G^G^G[mcd [38;5;81m^M[m
amchugh2@remote06:~$ ls[38;5;81m^M[m
amchugh2.circ  cs120lab7  Downloads[7Ci220a.bak  lab2[7Clab8      Templaa[10;1Htes[38;5;81m^M[m
Arduino[8Ccs220      git-repos[7Ci220a_new  lab2final  Music     tmp[38;5;81m^M[m
cs120[10Ccs240      git-repos_copy  i220X      lab2good   Pictures  toneMee[13;1Hlody[38;5;81m^M[m
cs120lab4      Desktop    good[12Ci240b      lab3[7Cprojects  Videoss[15;1H[38;5;81m^M[m
cs120lab6      Documents  i220a[11Clab[8Clab5[7CPublic[38;5;81m^M[m
amchugh2@remote06:~$ cd cs240[38;5;81m^M[m
amchugh2@remote06:~/cs240$ git pull[38;5;81m^M[m
/home/amchugh2/.bashrc: line 1: /home/umrigar/cs240/bin/student.rc: Permission dd[20;1Henied[38;5;81m^M[m
remote: Enumerating objects: 105, done.[38;5;81m^[[m[K[38;5;81m^M[m
remote: Counting objects:   0% (1/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   1% (22[23;1H/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   2% (3/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting ob[23;1H[94m@@@                                                                             [m[24;63H1,1[11CTop"lab2.LOG" [noeol] 1464L, 208086C[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [3;1H[24;63H2[3;1H[?25h[?25l[24;53H~@k[3;1H[24;53H   [4;1H[24;63H3[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [5;1H[24;63H4[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [6;1H[24;63H5[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [8;1H[24;63H6[8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [9;1H[24;63H7[9;1H[?25h[?25l[24;53H~@k[9;1H[24;53H   [11;1H[24;63H8[11;1H[?25h[?25l[24;53H~@k[11;1H[24;53H   [12;1H[24;63H9[12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [14;1H[24;63H10,1[14;1H[?25h[?25l[24;53H~@k[14;1H[24;53H   [16;1H[24;64H1[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;64H2[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H3[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [19;1H[24;64H4[19;1H[?25h[?25l[24;53H~@k[19;1H[24;53H   [21;1H[24;64H5[21;1H[?25h[?25l[24;53H~@k[21;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1Hremote: Counting objects:   0% (1/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   1% (22[2;1H/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   2% (3/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting obb[3;1Hjects:   3% (4/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   4% (5/105)   [38;5;81m^[[m[K[38;5;81m^M[mremott[4;1He: Counting objects:   5% (6/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   6% (7/105))[5;1H   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   7% (8/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objectss[6;1H:   8% (9/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:   9% (10/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[7;1Hounting objects:  10% (11/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  11% (12/105)   [8;1H [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  12% (13/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects::[9;1H  13% (14/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  14% (15/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[10;1Hounting objects:  15% (16/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  16% (17/105)   [11;1H [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  17% (18/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects::[12;1H  18% (19/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  19% (20/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[13;1Hounting objects:  20% (21/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  21% (23/105)   [14;1H [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  22% (24/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects::[15;1H  23% (25/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  24% (26/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[16;1Hounting objects:  25% (27/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  26% (28/105)   [17;1H [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  27% (29/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects::[18;1H  28% (30/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  29% (31/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[19;1Hounting objects:  30% (32/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  31% (33/105)   [20;1H [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  32% (34/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects::[21;1H  33% (35/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  34% (36/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[22;1Hounting objects:  35% (37/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  36% (38/105)   [23;1H [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:  37% (39/105)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Counting objects:[24;63H16,1[11C1%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1Hremote: Compressing objects:   1% (1/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:    [2;1H2% (2/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:   3% (3/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Comprr[3;1Hessing objects:   4% (4/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:   5% (5/84)   [38;5;81m^^[4;1H[[m[K[38;5;81m^M[mremote: Compressing objects:   7% (6/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objectt[5;1Hs:   8% (7/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:   9% (8/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote:  [6;1HCompressing objects:  10% (9/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  11% (10/88[7;1H4)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  13% (11/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressingg[8;1H objects:  14% (12/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  15% (13/84)   [38;5;81m^[[m[K[38;5;81m^^[9;1HM[mremote: Compressing objects:  16% (14/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  [10;1H 17% (15/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  19% (16/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[11;1Hompressing objects:  20% (17/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  21% (18/88[12;1H4)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  22% (19/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressingg[13;1H objects:  23% (20/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  25% (21/84)   [38;5;81m^[[m[K[38;5;81m^^[14;1HM[mremote: Compressing objects:  26% (22/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  [15;1H 27% (23/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  28% (24/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[16;1Hompressing objects:  29% (25/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  30% (26/88[17;1H4)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  32% (27/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressingg[18;1H objects:  33% (28/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  34% (29/84)   [38;5;81m^[[m[K[38;5;81m^^[19;1HM[mremote: Compressing objects:  35% (30/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  [20;1H 36% (31/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  38% (32/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: CC[21;1Hompressing objects:  39% (33/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  40% (34/88[22;1H4)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  41% (35/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressingg[23;1H objects:  42% (36/84)   [38;5;81m^[[m[K[38;5;81m^M[mremote: Compressing objects:  44% (37/84)   [38;5;81m^[[m[K[38;5;81m^[m[24;63H17,1[11C1%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1HUnpacking objects:   1% (1/90)   [38;5;81m^M[mUnpacking objects:   2% (2/90)   [38;5;81m^M[mUnpacking  [2;1Hobjects:   3% (3/90)   [38;5;81m^M[mUnpacking objects:   4% (4/90)   [38;5;81m^M[mUnpacking objects:   [3;1H 5% (5/90)   [38;5;81m^M[mUnpacking objects:   6% (6/90)   [38;5;81m^M[mUnpacking objects:   7% (7/90))[4;1H   [38;5;81m^M[mUnpacking objects:   8% (8/90)   [38;5;81m^M[mUnpacking objects:  10% (9/90)   [38;5;81m^M[mUnpacc[5;1Hking objects:  11% (10/90)   [38;5;81m^M[mUnpacking objects:  12% (11/90)   [38;5;81m^M[mUnpacking objj[6;1Hects:  13% (12/90)   [38;5;81m^M[mUnpacking objects:  14% (13/90)   [38;5;81m^M[mUnpacking objects:  11[7;1H5% (14/90)   [38;5;81m^M[mUnpacking objects:  16% (15/90)   [38;5;81m^M[mUnpacking objects:  17% (16/99[8;1H0)   [38;5;81m^M[mUnpacking objects:  18% (17/90)   [38;5;81m^M[mUnpacking objects:  20% (18/90)   [38;5;81m^M[mUU[9;1Hnpacking objects:  21% (19/90)   [38;5;81m^M[mUnpacking objects:  22% (20/90)   [38;5;81m^M[mUnpackingg[10;1H objects:  23% (21/90)   [38;5;81m^M[mUnpacking objects:  24% (22/90)   [38;5;81m^M[mUnpacking objectss[11;1H:  25% (23/90)   [38;5;81m^M[mUnpacking objects:  26% (24/90)   [38;5;81m^M[mUnpacking objects:  27% (([12;1H25/90)   [38;5;81m^M[mUnpacking objects:  28% (26/90)   [38;5;81m^M[mUnpacking objects:  30% (27/90)   [13;1H [38;5;81m^M[mUnpacking objects:  31% (28/90)   [38;5;81m^M[mUnpacking objects:  32% (29/90)   [38;5;81m^M[mUnpacc[14;1Hking objects:  33% (30/90)   [38;5;81m^M[mUnpacking objects:  34% (31/90)   [38;5;81m^M[mUnpacking objj[15;1Hects:  35% (32/90)   [38;5;81m^M[mUnpacking objects:  36% (33/90)   [38;5;81m^M[mUnpacking objects:  33[16;1H7% (34/90)   [38;5;81m^M[mUnpacking objects:  38% (35/90)   [38;5;81m^M[mUnpacking objects:  40% (36/99[17;1H0)   [38;5;81m^M[mUnpacking objects:  41% (37/90)   [38;5;81m^M[mUnpacking objects:  42% (38/90)   [38;5;81m^M[mUU[18;1Hnpacking objects:  43% (39/90)   [38;5;81m^M[mUnpacking objects:  44% (40/90)   [38;5;81m^M[mUnpackingg[19;1H objects:  45% (41/90)   [38;5;81m^M[mUnpacking objects:  46% (42/90)   [38;5;81m^M[mUnpacking objectss[20;1H:  47% (43/90)   [38;5;81m^M[mUnpacking objects:  48% (44/90)   [38;5;81m^M[mUnpacking objects:  50% (([21;1H45/90)   [38;5;81m^M[mremote: Total 90 (delta 49), reused 0 (delta 0)[38;5;81m^[[m[K[38;5;81m^M[m
Unpacking objects:  51% (46/90)   [38;5;81m^M[mUnpacking objects:  52% (47/90)   [38;5;81m^M[mUnpackinn[23;1Hg objects:  53% (48/90)   [38;5;81m^M[mUnpacking objects:  54% (49/90)   [38;5;81m^M[mUnpacking object[23;1H[94m@@@                                                                             [m[24;63H18,1[11C1%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1HUnpacking objects:  51% (46/90)   [38;5;81m^M[mUnpacking objects:  52% (47/90)   [38;5;81m^M[mUnpackinn[2;1Hg objects:  53% (48/90)   [38;5;81m^M[mUnpacking objects:  54% (49/90)   [38;5;81m^M[mUnpacking objectt[3;1Hs:  55% (50/90)   [38;5;81m^M[mUnpacking objects:  56% (51/90)   [38;5;81m^M[mUnpacking objects:  57%  [4;1H(52/90)   [38;5;81m^M[mUnpacking objects:  58% (53/90)   [38;5;81m^M[mUnpacking objects:  60% (54/90)  [5;1H  [38;5;81m^M[mUnpacking objects:  61% (55/90)   [38;5;81m^M[mUnpacking objects:  62% (56/90)   [38;5;81m^M[mUnpaa[6;1Hcking objects:  63% (57/90)   [38;5;81m^M[mUnpacking objects:  64% (58/90)   [38;5;81m^M[mUnpacking obb[7;1Hjects:  65% (59/90)   [38;5;81m^M[mUnpacking objects:  66% (60/90)   [38;5;81m^M[mUnpacking objects:   [8;1H67% (61/90)   [38;5;81m^M[mUnpacking objects:  68% (62/90)   [38;5;81m^M[mUnpacking objects:  70% (63//[9;1H90)   [38;5;81m^M[mUnpacking objects:  71% (64/90)   [38;5;81m^M[mUnpacking objects:  72% (65/90)   [38;5;81m^MM[m[10;1HUnpacking objects:  73% (66/90)   [38;5;81m^M[mUnpacking objects:  74% (67/90)   [38;5;81m^M[mUnpackinn[11;1Hg objects:  75% (68/90)   [38;5;81m^M[mUnpacking objects:  76% (69/90)   [38;5;81m^M[mUnpacking objectt[12;1Hs:  77% (70/90)   [38;5;81m^M[mUnpacking objects:  78% (71/90)   [38;5;81m^M[mUnpacking objects:  80%  [13;1H(72/90)   [38;5;81m^M[mUnpacking objects:  81% (73/90)   [38;5;81m^M[mUnpacking objects:  82% (74/90)  [14;1H  [38;5;81m^M[mUnpacking objects:  83% (75/90)   [38;5;81m^M[mUnpacking objects:  84% (76/90)   [38;5;81m^M[mUnpaa[15;1Hcking objects:  85% (77/90)   [38;5;81m^M[mUnpacking objects:  86% (78/90)   [38;5;81m^M[mUnpacking obb[16;1Hjects:  87% (79/90)   [38;5;81m^M[mUnpacking objects:  88% (80/90)   [38;5;81m^M[mUnpacking objects:   [17;1H90% (81/90)   [38;5;81m^M[mUnpacking objects:  91% (82/90)   [38;5;81m^M[mUnpacking objects:  92% (83//[18;1H90)   [38;5;81m^M[mUnpacking objects:  93% (84/90)   [38;5;81m^M[mUnpacking objects:  94% (85/90)   [38;5;81m^MM[m[19;1HUnpacking objects:  95% (86/90)   [38;5;81m^M[mUnpacking objects:  96% (87/90)   [38;5;81m^M[mUnpackinn[20;1Hg objects:  97% (88/90)   [38;5;81m^M[mUnpacking objects:  98% (89/90)   [38;5;81m^M[mUnpacking objectt[21;1Hs: 100% (90/90)   [38;5;81m^M[mUnpacking objects: 100% (90/90), done.[38;5;81m^M[m
From ssh://remote.cs.binghamton.edu/~umrigar/git-repos/cs240[38;5;81m^M[m
   0b7b862..5dd8253  master     -> origin/master[38;5;81m^M[m[24;63H19,1[11C1%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [22;1H[24;63H20[22;1H[?25h[?25l[24;53H~@k[22;1H[24;53H   [2;1H[27m[23m[29m[m[H[2J[1;1HFrom ssh://remote.cs.binghamton.edu/~umrigar/git-repos/cs240[38;5;81m^M[m
   0b7b862..5dd8253  master     -> origin/master[38;5;81m^M[m
Updating 0b7b862..5dd8253[38;5;81m^M[m
Fast-forward[38;5;81m^M[m
 index.html[34C|  24 [38;5;81m^[[m[32m++[38;5;81m^[[m[m[38;5;81m^[[m[31m--[38;5;81m^[[m[m[38;5;81m^M[m
 index.umt[35C|   6 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/index.html[29C|   4 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m
 labs/index.umt[30C|   9 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/.gitignore[14C|   1 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/1-hello/.gitignore      |   1 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/1-hello/Makefile[8C|   3 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/1-hello/README[10C|   1 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/1-hello/hello.cc[8C|  22 [38;5;81m^[[m[32m+++[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/2-hello/.gitignore      |   1 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/2-hello/Makefile[8C|   3 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/2-hello/README[10C|   4 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/2-hello/hello.cc[8C|  48 [38;5;81m^[[m[32m+++++++[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/3-overload/.gitignore   |   1 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/3-overload/Makefile     |   3 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/3-overload/overload.cc  |  16 [38;5;81m^[[m[32m+++[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/exercises/Makefile[16C|   2 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m
 labs/lab2/lab2.html[25C| 257 [38;5;81m^[[m[32m++++++++++++++++++++++++[23;1H+++++++++++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H21,1[11C1%[2;1H[?25h[?25l[24;53H~@k[2;1H[24;53H   [3;1H[24;64H2[3;1H[?25h[?25l[24;53H~@k[3;1H[24;53H   [4;1H[24;64H3[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [5;1H[24;64H4[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [6;1H[24;64H5[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [7;1H[24;64H6[7;1H[?25h[?25l[24;53H~@k[7;1H[24;53H   [8;1H[24;64H7[8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [9;1H[24;64H8[9;1H[?25h[?25l[24;53H~@k[9;1H[24;53H   [10;1H[24;64H9[10;1H[?25h[?25l[24;53H~@k[10;1H[24;53H   [11;1H[24;63H30[11;1H[?25h[?25l[24;53H~@k[11;1H[24;53H   [12;1H[24;64H1[12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [13;1H[24;64H2[13;1H[?25h[?25l[24;53H~@k[13;1H[24;53H   [14;1H[24;64H3[14;1H[?25h[?25l[24;53H~@k[14;1H[24;53H   [15;1H[24;64H4[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;64H5[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;64H6[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H7[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hlabs/lab2/lab2.pdf[26C| Bin [38;5;81m^[[m[31m0[38;5;81m^[[m[m -> [38;5;81m^[[m[32m93531[38;5;81m^[[m[[[23;1Hm bytes[38;5;81m^M[m[24;63H[K[24;63H38,1[11C1%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H9[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hlabs/lab2/lab2.umt[26C| 358 [38;5;81m^[[m[32m++++++++++++++++++++++++[23;1H+++++++++++++++++++++++++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H40,1[11C1%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [17;1H[1;23r[23;1H
[1;24r[23;2Hlabs/lab2/lab2/hl-fine_blue.css[13C|  19 [38;5;81m^[[m[32m+++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H41,1[11C1%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hlabs/lab2/lab2/hl-fine_blue.sty[13C|  19 [38;5;81m^[[m[32m+++[38;5;81m^[[m[m[38;5;81m^M[m
 labs/submission/submission/hl-fine_blue.css |   2 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H42,1[11C1%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [16;1H[1;23r[1;1H[3M[1;24r[21;2Hlabs/submission/submission/hl-fine_blue.sty |   2 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m
 slides/c++-intro/c++-intro.html[13C| 228 [38;5;81m^[[m[32m++++++++++++++++++++++++[23;1H+[38;5;81m^[[m[m[38;5;81m^[[m[31m------[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H43,1[11C2%[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [18;1H[24;64H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hslides/c++-intro/c++-intro.pdf[14C| Bin [38;5;81m^[[m[31m167175[38;5;81m^[[m[m -> [38;5;81m^[[m[32m2011[23;1H292[38;5;81m^[[m[m bytes[38;5;81m^M[m[24;63H[K[24;63H45,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H6[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hslides/c++-intro/c++-intro.umt[14C| 148 [38;5;81m^[[m[32m++++++++++++++++++[38;5;81m^[[m[m[38;5;81m^^[23;1H[[m[31m--[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H47,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [17;1H[1;23r[23;1H
[1;24r[23;2Hslides/c++-intro/c++-intro/hl-fine_blue.css |   2 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H48,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hslides/c++-intro/c++-intro/hl-fine_blue.sty |   2 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m
 slides/c++-intro/code/.gitignore[12C|   6 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H49,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hslides/c++-intro/code/Makefile[14C|  12 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m
 slides/c++-intro/code/alloc-dealloc.cc      |  26 [38;5;81m^[[m[32m++++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H50,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hslides/c++-intro/code/class-point.cc[8C|  33 [38;5;81m^[[m[32m+++++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H51,1[11C2%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hslides/c++-intro/code/struct-point.cc[7C|  31 [38;5;81m^[[m[32m+++++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H52,1[11C2%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hslides/c++-intro/code/sum-array.cc[10C|  14 [38;5;81m^[[m[32m+[38;5;81m^[[m[m[38;5;81m^[[m[31m-[38;5;81m^[[m[m[38;5;81m^M[m
 slides/c++-intro/code/vec1.cc[15C|  40 [38;5;81m^[[m[32m++++++[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H53,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2H36 files changed, 1266 insertions(+), 82 deletions(-)[38;5;81m^M[m
 create mode 100644 labs/lab2/exercises/.gitignore[38;5;81m^M[m[24;63H[K[24;63H55,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H6[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hcreate mode 100644 labs/lab2/exercises/1-hello/.gitignore[38;5;81m^M[m
 create mode 100644 labs/lab2/exercises/1-hello/Makefile[38;5;81m^M[m[24;63H[K[24;63H57,1[11C2%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H8[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/exercises/1-hello/README[38;5;81m^M[m[24;63H[K[24;63H59,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/exercises/1-hello/hello.cc[38;5;81m^M[m[24;63H[K[24;63H60,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/exercises/2-hello/.gitignore[38;5;81m^M[m[24;63H[K[24;63H61,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/exercises/2-hello/Makefile[38;5;81m^M[m[24;63H[K[24;63H62,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hcreate mode 100644 labs/lab2/exercises/2-hello/README[38;5;81m^M[m
 create mode 100644 labs/lab2/exercises/2-hello/hello.cc[38;5;81m^M[m[24;63H[K[24;63H63,1[11C3%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hcreate mode 100644 labs/lab2/exercises/3-overload/.gitignore[38;5;81m^M[m
 create mode 100644 labs/lab2/exercises/3-overload/Makefile[38;5;81m^M[m[24;63H[K[24;63H65,1[11C3%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H6[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;2Hcreate mode 100644 labs/lab2/exercises/3-overload/overload.cc[38;5;81m^M[m
 create mode 100644 labs/lab2/exercises/Makefile[38;5;81m^M[m[24;63H[K[24;63H67,1[11C3%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H8[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/lab2.html[38;5;81m^M[m[24;63H[K[24;63H69,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/lab2.pdf[38;5;81m^M[m[24;63H[K[24;63H70,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/lab2.umt[38;5;81m^M[m[24;63H[K[24;63H71,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/lab2/hl-fine_blue.css[38;5;81m^M[m[24;63H[K[24;63H72,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 labs/lab2/lab2/hl-fine_blue.sty[38;5;81m^M[m[24;63H[K[24;63H73,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 slides/c++-intro/code/.gitignore[38;5;81m^M[m[24;63H[K[24;63H74,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 slides/c++-intro/code/alloc-dealloc.cc[38;5;81m^M[m[24;63H[K[24;63H75,1[11C3%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 slides/c++-intro/code/class-point.cc[38;5;81m^M[m[24;63H[K[24;63H76,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 slides/c++-intro/code/struct-point.cc[38;5;81m^M[m[24;63H[K[24;63H77,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2Hcreate mode 100644 slides/c++-intro/code/vec1.cc[38;5;81m^M[m[24;63H[K[24;63H78,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hamchugh2@remote06:~/cs240$ ls[38;5;81m^M[m[24;63H[K[24;63H79,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hannounce.html  assets  exams-quizzes  hws[9Cindex.umt  misc      README.mdd[23;1H  umt.make[38;5;81m^M[m[24;63H[K[24;63H80,1[11C4%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H1[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hannounce.umt   docs    exercises      index.html  labs[7Cprojects  slides[38;5;81m^M[m[24;63H[K[24;63H82,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hamchugh2@remote06:~/cs240$ cd [38;5;81m^M[m[24;63H[K[24;63H83,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hamchugh2@remote06:~$ ls[38;5;81m^M[m[24;63H[K[24;63H84,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hamchugh2.circ  cs120lab7  Downloads[7Ci220a.bak  lab2[7Clab8      Templaa[23;1Htes[38;5;81m^M[m[24;63H[K[24;63H85,1[11C4%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HArduino[8Ccs220      git-repos[7Ci220a_new  lab2final  Music     tmp[38;5;81m^M[m[24;63H[K[24;63H86,1[11C4%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hcs120[10Ccs240      git-repos_copy  i220X      lab2good   Pictures  toneMee[23;1Hlody[38;5;81m^M[m[24;63H[K[24;63H87,1[11C4%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H8[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hcs120lab4      Desktop    good[12Ci240b      lab3[7Cprojects  Videoss[23;1H[38;5;81m^M[m[24;63H[K[24;63H89,1[11C5%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hcs120lab6      Documents  i220a[11Clab[8Clab5[7CPublic[38;5;81m^M[m[24;63H[K[24;63H90,1[11C5%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hamchugh2@remote06:~$ cd i240b/submitla[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K/lab2[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ cp[38;5;81m^H^[[m[K[38;5;81m^H^[[m[Kls[38;5;81m^M[m[24;63H[K[24;63H91,1[11C5%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;1Hlab2.LOG[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ cd[38;5;81m^H^[[m[Kp [38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mcp -r !/[38;5;81m^H^^[22;1H[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[Kt [38;5;81m^H^[[m[K[38;5;81m^H^[[m[Kr ~/csw0[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K240/labs/lab2/exercizes[38;5;81m^HH[23;1H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[Kses-[38;5;81m^H^[[m[K/* .[38;5;81m^M[m[24;63H[K[24;63H92,1[11C5%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [17;1H[24;64H3[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hamchugh2@remote06:~/i240b/submit/lab2$ ls[38;5;81m^M[m[24;63H[K[24;63H95,1[11C5%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H1-hello  2-hello  3-overload  lab2.LOG  Makefile[38;5;81m^M[m[24;63H[K[24;63H96,1[11C5%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;1Hamchugh2@remote06:~/i240b/submit/lab2$ cd exerciz[38;5;81m^H^[[m[Kses 1[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[Ks11[21;1H[38;5;81m^H^[[m[K/1[38;5;81m^H^[[m[K1-hello[38;5;81m^M[m
bash: cd: exercises/1-hello: No such file or directory[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ ls[38;5;81m^M[m[24;63H[K[24;63H97,1[11C5%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [18;1H[24;64H8[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H1-hello  2-hello  3-overload  lab2.LOG  Makefile[38;5;81m^M[m[24;63H[K[24;63H99,1[11C5%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hamchugh2@remote06:~/i240b/submit/lab2$ cd 1-hello[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ls[38;5;81m^M[m[24;63H[K[24;63H100,1[10C6%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hhello.cc  Makefile  README[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ vim README[38;5;81m^M[m[24;63H[K[24;63H101,1[10C6%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H2[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [14;1H[1;23r[1;1H[5M[1;24r[19;1H[38;5;81m^[[m[?1000h[38;5;81m^[[m[?2004h[38;5;81m^[[m[?1049h[38;5;81m^[[m[22;0;0t[38;5;81m^[[m[?1h[38;5;81m^[[m=[38;5;81m^[[m[?2004h[38;5;81m^[[m[1;35r[38;5;81m^[[m[?12h[38;5;81m^[[m[?12l[38;5;81m^[[m[[[20;1H22;2t[38;5;81m^[[m[22;1t[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[35;1H"README" 1L, 61C[38;5;81m^[[m[2;;[21;1H1H▽[21;4H[38;5;81m^[[m[6n[38;5;81m^[[m[2;1H  [38;5;81m^[[m[1;1H[38;5;81m^[[m[>c[38;5;81m^[[m]10;?[38;5;81m^G^[[m]11;?[38;5;81m^G^[[m[1;1HPrint out a line saying hee[22;1Hllo to each command-line argument.[38;5;81m^M
^[[m[1m[38;5;81m^[[m[34m~[94m@@@                                                                             [m[24;63H[K[24;63H103,1[10C6%[14;1H[?25h[?25l[24;53H~@k[14;1H[24;53H   [15;1H[24;65H4[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;65H5[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H6[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H7[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [19;1H[24;65H8[19;1H[?25h[?25l[24;53H~@k[19;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1H[38;5;81m^[[m[1m[38;5;81m^[[m[34m~[67C  [2;1H [30C[38;5;81m^[[m[3;1H~[40C  [3;1H [57C[38;5;81m^[[m[4;1H~[13C  [4;1H [78C  [5;1H     [38;5;81m^[[m[5;1H~[66C  [6;1H [31C[38;5;81m^[[m[6;1H~[39C  [7;1H [58C[38;5;81m^[[m[7;1H~[12C  [8;1H [78C  [9;1H      [38;5;81m^[[m[8;1H~[65C  [10;1H [32C[38;5;81m^[[m[9;1H~[38C  [11;1H [59C[38;5;81m^[[m[10;1H~[10C  [12;1H [78C  [13;1H [7C[38;5;81m^[[m[11;1H~[62C  [14;1H [35C[38;5;81m^[[m[12;1H~[34C  [15;1H [63C[38;5;81m^[[m[13;1H~        [16;1H [78C  [17;1H [11C[38;5;81m^[[m[14;1H~[58C  [18;1H [39C[38;5;81m^[[m[15;1H~[30C  [19;1H [67C[38;5;81m^[[m[16;1H~    [20;1H [78C  [21;1H [15C[38;5;81m^[[m[17;1H~[54C  [22;1H [43C[38;5;81m^[[m[18;1H~[26C  [23;1H [71C[38;5;81m^[[m[19;1H[24;63H109,1[10C7%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1Hbash: ./hello: No such file or directory[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ make[38;5;81m^M[m
g++ -g -Wall -std=c++17    hello.cc   -o hello[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ./hello[38;5;81m^M[m
usage: ./hello NAME...[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ hello[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[[m[7;1H[K[38;5;81m^G[m./ [38;5;81m^H^[[m[Khello Abby McHugh![38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^^[8;1HH^[[m[Ky![38;5;81m^M[m
hello Abby![38;5;81m^M[m
hello amchugh2@remote06:~/i240b/submit/lab2/1-hello$ h[38;5;81m^H^[[m[Khello [38;5;81m^H^[[m[K abby[38;5;81m^H^^[11;1H[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[KAbby John[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[KB[38;5;81m^H^[[m[K Ben[38;5;81m^M[m
bash: hello: command not found[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ .[38;5;81m^H^[[m[K[38;5;81m^G[m./hello Abby Ben[38;5;81m^M[m
hello Abby[38;5;81m^M[m
hello Ben[38;5;81m^M[m
hello amchugh2@remote06:~/i240b/submit/lab2/1-hello$ gd [38;5;81m^H^[[m[Kb hello[38;5;81m^M[m
GNU gdb (Debian 8.2.1-2+b3) 8.2.1[38;5;81m^M[m
Copyright (C) 2018 Free Software Foundation, Inc.[38;5;81m^M[m
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>[38;5;81m^M[m
This is free software: you are free to change and redistribute it.[38;5;81m^M[m
There is NO WARRANTY, to the extent permitted by law.[38;5;81m^M[m
Type "show copying" and "show warranty" for details.[38;5;81m^M[m
This GDB was configured as "x86_64-linux-gnu".[38;5;81m^M[m[24;63H110,1[10C7%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [2;1H[24;65H1[2;1H[?25h[?25l[24;53H~@k[2;1H[24;53H   [3;1H[24;65H2[3;1H[?25h[?25l[24;53H~@k[3;1H[24;53H   [4;1H[24;65H3[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [5;1H[24;65H4[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [6;1H[24;65H5[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [9;1H[24;65H6[9;1H[?25h[?25l[24;53H~@k[9;1H[24;53H   [10;1H[24;65H7[10;1H[?25h[?25l[24;53H~@k[10;1H[24;53H   [12;1H[24;65H8[12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [13;1H[24;65H9[13;1H[?25h[?25l[24;53H~@k[13;1H[24;53H   [14;1H[24;64H20[14;1H[?25h[?25l[24;53H~@k[14;1H[24;53H   [15;1H[24;65H1[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;65H2[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H3[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HType "show configuration" for configuration details.[38;5;81m^M[m[24;63H[K[24;63H125,1[10C7%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HFor bug reporting instructions, please see:[38;5;81m^M[m[24;63H[K[24;63H126,1[10C7%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H<http://www.gnu.org/software/gdb/bugs/>.[38;5;81m^M[m[24;63H[K[24;63H127,1[10C7%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HFind the GDB manual and other documentation resources online at:[38;5;81m^M[m[24;63H[K[24;63H128,1[10C7%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5H<http://www.gnu.org/software/gdb/documentation/>.[38;5;81m^M[m[24;63H[K[24;63H129,1[10C7%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [16;1H[1;23r[1;1H[3M[1;24r[21;1H[38;5;81m^M[m
For help, type "help".[38;5;81m^M[m
Type "apropos word" to search for commands related to "word"...[38;5;81m^M[m[24;63H[K[24;63H130,1[10C7%[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H1[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H2[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HReading symbols from hello...done.[38;5;81m^M[m[24;63H[K[24;63H133,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H(gdb) start bart lisa[38;5;81m^M[m
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.[38;5;81m^M[m[24;63H[K[24;63H134,1[10C8%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H5[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1HStarting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-helll[23;1Ho/hello bart lisa[38;5;81m^M[m[24;63H[K[24;63H136,1[10C8%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H7[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^M[m[24;63H[K[24;63H138,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HTemporary breakpoint 1, main (argc=3, argv=0x7fffffffe858) at hello.cc:13[38;5;81m^M[m[24;63H[K[24;63H139,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H13[8Cif (argc == 1) {[38;5;81m^M[m[24;63H[K[24;63H140,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H(gdb) [38;5;81m^M^[[m[K(gdb) l[38;5;81m^M[m
8[7C}[38;5;81m^M[m[24;63H[K[24;63H141,1[10C8%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H9[7C[38;5;81m^M[m[24;63H[K[24;63H142,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H10      int [38;5;81m^M[m[24;63H[K[24;63H143,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H11      main(int argc, const char *argv[])[38;5;81m^M[m[24;63H[K[24;63H144,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H12      {[38;5;81m^M[m[24;63H[K[24;63H145,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H13[8Cif (argc == 1) {[38;5;81m^M[m[24;63H[K[24;63H146,1[10C8%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H14[10Cstd::cerr << "usage: " << argv[0] << " NAME..." << std::endl;[38;5;81m^M[m[24;63H[K[24;63H147,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H15[10Cstd::exit(1);[38;5;81m^M[m[24;63H[K[24;63H148,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H16[8C}[38;5;81m^M[m[24;63H[K[24;63H149,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H17[8Celse {[38;5;81m^M[m[24;63H[K[24;63H150,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) b sayHello()[38;5;81m^M[m[24;63H[K[24;63H151,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HFunction "sayHello()" not defined.[38;5;81m^M[m[24;63H[K[24;63H152,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1HMake breakpoint pending on future shared library load? (y or [n]) p argc[38;5;81m^H^[[m[K[38;5;81m^HH[23;1H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[my[38;5;81m^M[m[24;63H[K[24;63H153,1[10C9%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HBreakpoint 2 (sayHello()) pending.[38;5;81m^M[m[24;63H[K[24;63H155,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H(gdb) b sayHello)[38;5;81m^H^[[m[K()[38;5;81m^M[m[24;63H[K[24;63H156,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1HFunction "sayHello()" not defined.[38;5;81m^M[m[24;63H[K[24;63H157,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1HMake breakpoint pending on future shared library load? (y or [n]) n[38;5;81m^M[m
(gdb) q[38;5;81m^M[m[24;63H[K[24;63H158,1[10C9%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HA debugging session is active.[38;5;81m^M[m[24;63H[K[24;63H159,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H[38;5;81m^M[m[24;63H[K[24;63H160,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;9HInferior 1 [process 2306793] will be killed.[38;5;81m^M[m[24;63H[K[24;63H161,1[10C9%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^M[m[24;63H[K[24;63H162,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HQuit anyway? (y or n) y[38;5;81m^M[m[24;63H[K[24;63H163,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1Hamchugh2@remote06:~/i240b/submit/lab2/1-hello$ gdb e[38;5;81m^H^[[m[Khello[38;5;81m^M[m[24;63H[K[24;63H164,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HGNU gdb (Debian 8.2.1-2+b3) 8.2.1[38;5;81m^M[m[24;63H[K[24;63H165,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;1HCopyright (C) 2018 Free Software Foundation, Inc.[38;5;81m^M[m[24;63H[K[24;63H166,1-8[7C10%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>[38;5;81m^M[m[24;63H[K[24;63H167,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HThis is free software: you are free to change and redistribute it.[38;5;81m^M[m[24;63H[K[24;63H168,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HThere is NO WARRANTY, to the extent permitted by law.[38;5;81m^M[m[24;63H[K[24;63H169,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HType "show copying" and "show warranty" for details.[38;5;81m^M[m[24;63H[K[24;63H170,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HThis GDB was configured as "x86_64-linux-gnu".[38;5;81m^M[m[24;63H[K[24;63H171,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HType "show configuration" for configuration details.[38;5;81m^M[m[24;63H[K[24;63H172,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HFor bug reporting instructions, please see:[38;5;81m^M[m[24;63H[K[24;63H173,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H<http://www.gnu.org/software/gdb/bugs/>.[38;5;81m^M[m[24;63H[K[24;63H174,1[9C10%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1HFind the GDB manual and other documentation resources online at:[38;5;81m^M[m
    <http://www.gnu.org/software/gdb/documentation/>.[38;5;81m^M[m[24;63H[K[24;63H175,1[9C10%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H6[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^M[m[24;63H[K[24;63H177,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HFor help, type "help".[38;5;81m^M[m[24;63H[K[24;63H178,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HType "apropos word" to search for commands related to "word"...[38;5;81m^M[m[24;63H[K[24;63H179,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HReading symbols from hello...done.[38;5;81m^M[m[24;63H[K[24;63H180,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H(gdb) start bart lisa[38;5;81m^H^[[m[Ka[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[[m[23;1H[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mstart bart lisa[38;5;81m^M[m[24;63H[K[24;63H181,1[9C11%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H2[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HTemporary breakpoint 1 at 0x11cd: file hello.cc, line 13.[38;5;81m^M[m[24;63H[K[24;63H183,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1HStarting program: /import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-helll[23;1Ho/hello bart lisa[38;5;81m^M[m[24;63H[K[24;63H184,1[9C11%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H5[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[17;1H[46m([mgdb[46m)[m[74C[38;5;81m[[[m[18;1H[[22;1H[38;5;81m^M[m
Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe868)[38;5;81m^M[m[24;63H[K[24;63H186,1[9C11%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[16;1H(gdb)[74C[38;5;81m[[[m[17;1H[[23;5Hat hello.cc:13[38;5;81m^M[m[24;63H[K[24;63H187,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H13[8Cif (argc == 1) {[38;5;81m^M[m
(gdb) l[38;5;81m^M[m[24;63H[K[24;63H188,1[9C11%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H8[7C}[38;5;81m^M[m[24;63H[K[24;63H189,1[9C11%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H9[7C[38;5;81m^M[m[24;63H[K[24;63H190,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H10      int [38;5;81m^M[m[24;63H[K[24;63H191,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H11      main(int argc, const char *argv[])[38;5;81m^M[m[24;63H[K[24;63H192,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H12      {[38;5;81m^M[m[24;63H[K[24;63H193,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H13[8Cif (argc == 1) {[38;5;81m^M[m[24;63H[K[24;63H194,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H14[10Cstd::cerr << "usage: " << argv[0] << " NAME..." << std::endl;[38;5;81m^M[m[24;63H[K[24;63H195,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H15[10Cstd::exit(1);[38;5;81m^M[m[24;63H[K[24;63H196,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H16[8C}[38;5;81m^M[m[24;63H[K[24;63H197,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H17[8Celse {[38;5;81m^M[m[24;63H[K[24;63H198,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) [38;5;81m^M[m[24;63H[K[24;63H199,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H18[10Cfor (int i = 1; i <= argc; i++) {[38;5;81m^M[m[24;63H[K[24;63H200,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H19[12CsayHello(argv[i]);[38;5;81m^M[m[24;63H[K[24;63H201,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H20[10C}[38;5;81m^M[m
21[8C}[38;5;81m^M[m[24;63H[K[24;63H202,1[9C12%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H3[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H22      }[38;5;81m^M[m[24;63H[K[24;63H204,1[9C12%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[16;1H(gdb)[22;1H(gdb) l 2[38;5;81m^M[m
1[7C#include <iostream>[38;5;81m^M[m[24;63H[K[24;63H205,1[9C13%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H6[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H2[7C#include <cstdlib>[38;5;81m^M[m[24;63H[K[24;63H207,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H3[7C[38;5;81m^M[m[24;63H[K[24;63H208,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H4[7Cstatic void[38;5;81m^M[m[24;63H[K[24;63H209,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H5[7CsayHello(const char *name)[38;5;81m^M[m[24;63H[K[24;63H210,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H6[7C{[38;5;81m^M[m[24;63H[K[24;63H211,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H7[9Cstd::cout << "hello " << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H212,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H8[7C}[38;5;81m^M[m[24;63H[K[24;63H213,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H9[7C[38;5;81m^M[m[24;63H[K[24;63H214,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H10      int [38;5;81m^M[m[24;63H[K[24;63H215,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) b sy[38;5;81m^H^[[m[KayHello[38;5;81m^M[m[24;63H[K[24;63H216,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HBreakpoint 2 at 0x555555555181: file hello.cc, line 7.[38;5;81m^M[m[24;63H[K[24;63H217,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) p argc[38;5;81m^M[m[24;63H[K[24;63H218,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H$1 = 3[38;5;81m^M[m[24;63H[K[24;63H219,1[9C13%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) p argv[38;5;81m^M[m[24;63H[K[24;63H220,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H$2 = (const char **) 0x7fffffffe868[38;5;81m^M[m[24;63H[K[24;63H221,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) p argv[0][38;5;81m^M[m[24;63H[K[24;63H222,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[17;1H[46m([mgdb[46m)[m[22;1H$3 = 0x7fffffffead0 "/import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-hh[23;1Hello/hello"[38;5;81m^M[m[24;63H[K[24;63H223,1[9C14%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[17;1H(gdb)[24;65H4[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H(gdb) p argv[1][38;5;81m^M[m[24;63H[K[24;63H225,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H$4 = 0x7fffffffeb16 "bart"[38;5;81m^M[m[24;63H[K[24;63H226,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H(gdb) p *argv@3[38;5;81m^M[m[24;63H[K[24;63H227,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [16;1H[1;23r[1;1H[3M[1;24r[15;1H(gdb)[21;1H$5 = {[38;5;81m^M[m
  0x7fffffffead0 "/import/linux/home1/amchugh2/projects/i240b/submit/lab2/1-helll[23;1Ho/hello", 0x7fffffffeb16 "bart", 0x7fffffffeb1b "lisa"}[38;5;81m^M[m[24;63H[K[24;63H228,1[9C14%[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [18;1H[46m([mgdb[46m)[m[24;65H9[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) n[38;5;81m^M[m[24;63H[K[24;63H230,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H18[10Cfor (int i = 1; i <= argc; i++) {[38;5;81m^M[m[24;63H[K[24;63H231,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) p i[38;5;81m^M[m[24;63H[K[24;63H232,1[9C14%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H$6 = 0[38;5;81m^M[m
(gdb) c[38;5;81m^M[m[24;63H[K[24;63H233,1[9C15%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HContinuing.[38;5;81m^M[m[24;63H[K[24;63H234,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H[38;5;81m^M[m[24;63H[K[24;63H235,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HBreakpoint 2, sayHello (name=0x7fffffffeb16 "bart") at hello.cc:7[38;5;81m^M[m[24;63H[K[24;63H236,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H7[9Cstd::cout << "hello " << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H237,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H(gdb) l[38;5;81m^M[m[24;63H[K[24;63H238,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H2[7C#include <cstdlib>[38;5;81m^M[m[24;63H[K[24;63H239,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H3[7C[38;5;81m^M[m[24;63H[K[24;63H240,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H4[7Cstatic void[38;5;81m^M[m[24;63H[K[24;63H241,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H5[7CsayHello(const char *name)[38;5;81m^M[m[24;63H[K[24;63H242,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H6[7C{[38;5;81m^M[m[24;63H[K[24;63H243,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[16;1H(gdb)[22;1H7[9Cstd::cout << "hello " << name << std::endl;[38;5;81m^M[m
8[7C}[38;5;81m^M[m[24;63H[K[24;63H244,1[9C15%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H5[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H9[7C[38;5;81m^M[m[24;63H[K[24;63H246,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H10      int [38;5;81m^M[m[24;63H[K[24;63H247,1[9C15%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H11      main(int argc, const char *argv[])[38;5;81m^M[m[24;63H[K[24;63H248,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) backtrace[38;5;81m^M[m[24;63H[K[24;63H249,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1H#0  sayHello (name=0x7fffffffeb16 "bart") at hello.cc:7[38;5;81m^M[m
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe868)[38;5;81m^M[m[24;63H[K[24;63H250,1[9C16%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H1[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hat hello.cc:19[38;5;81m^M[m[24;63H[K[24;63H252,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) argc[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mp argc[38;5;81m^M[m[24;63H[K[24;63H253,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HNo symbol "argc" in current context.[38;5;81m^M[m[24;63H[K[24;63H254,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) up[38;5;81m^M[m[24;63H[K[24;63H255,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe868)[38;5;81m^M[m[24;63H[K[24;63H256,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hat hello.cc:19[38;5;81m^M[m[24;63H[K[24;63H257,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H19[12CsayHello(argv[i]);[38;5;81m^M[m[24;63H[K[24;63H258,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) p argc[38;5;81m^M[m[24;63H[K[24;63H259,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H$7 = 3[38;5;81m^M[m[24;63H[K[24;63H260,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) down[38;5;81m^M[m[24;63H[K[24;63H261,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H#0  sayHello (name=0x7fffffffeb16 "bart") at hello.cc:7[38;5;81m^M[m[24;63H[K[24;63H262,1[9C16%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H7[9Cstd::cout << "hello " << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H263,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H(gdb) p name[38;5;81m^M[m[24;63H[K[24;63H264,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H$8 = 0x7fffffffeb16 "bart"[38;5;81m^M[m[24;63H[K[24;63H265,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H(gdb) c[38;5;81m^M[m[24;63H[K[24;63H266,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1HContinuing.[38;5;81m^M[m[24;63H[K[24;63H267,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hhello bart[38;5;81m^M[m[24;63H[K[24;63H268,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H[38;5;81m^M[m[24;63H[K[24;63H269,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1HBreakpoint 2, sayHello (name=0x7fffffffeb1b "lisa") at hello.cc:7[38;5;81m^M[m[24;63H[K[24;63H270,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H7[9Cstd::cout << "hello " << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H271,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) c[38;5;81m^M[m[24;63H[K[24;63H272,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HContinuing.[38;5;81m^M[m[24;63H[K[24;63H273,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hhello lisa[38;5;81m^M[m[24;63H[K[24;63H274,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^M[m[24;63H[K[24;63H275,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HBreakpoint 2, sayHello (name=0x0) at hello.cc:7[38;5;81m^M[m[24;63H[K[24;63H276,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H7[9Cstd::cout << "hello " << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H277,1[9C17%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) up[38;5;81m^M[m[24;63H[K[24;63H278,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe868)[38;5;81m^M[m[24;63H[K[24;63H279,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hat hello.cc:19[38;5;81m^M[m[24;63H[K[24;63H280,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H19[12CsayHello(argv[i]);[38;5;81m^M[m[24;63H[K[24;63H281,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) p i[38;5;81m^M[m[24;63H[K[24;63H282,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1H$9 = 3[38;5;81m^M[m[24;63H[K[24;63H283,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H(gdb) p argc[38;5;81m^M[m[24;63H[K[24;63H284,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H$10 = 3[38;5;81m^M[m[24;63H[K[24;63H285,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H(gdb) q[38;5;81m^M[m[24;63H[K[24;63H286,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HA debugging session is active.[38;5;81m^M[m[24;63H[K[24;63H287,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H[38;5;81m^M[m[24;63H[K[24;63H288,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;9HInferior 1 [process 2307503] will be killed.[38;5;81m^M[m[24;63H[K[24;63H289,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1H[38;5;81m^M[m[24;63H[K[24;63H290,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m([mgdb[46m)[m[23;1HQuit anyway? (y or n) y[38;5;81m^M[m[24;63H[K[24;63H291,1[9C18%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H(gdb)[23;1Hamchugh2@remote06:~/i240b/submit/lab2/1-hello$ ls[38;5;81m^M[m[24;63H[K[24;63H292,1[9C19%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hhello  hello.cc  Makefile  README[38;5;81m^M[m[24;63H[K[24;63H293,1[9C19%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;8H[1;23r[23;1H
[1;24r[23;1Hamchugh2@remote06:~/i240b/submit/lab2/1-hello$ vim hello.cc[38;5;81m^M[m[24;63H[K[24;63H294,1-8[7C19%[18;8H[?25h[?25l[24;53H~@k[18;8H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;1H[38;5;81m^[[m[?1000h[38;5;81m^[[m[?2004h[38;5;81m^[[m[?1049h[38;5;81m^[[m[22;0;0t[38;5;81m^[[m[?1h[38;5;81m^[[m=[38;5;81m^[[m[?2004h[38;5;81m^[[m[1;36r[38;5;81m^[[m[?12h[38;5;81m^[[m[?12l[38;5;81m^[[m[[[21;1H22;2t[38;5;81m^[[m[22;1t[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[36;1H"hello.cc" 22L, 363C[38;5;81m^^[22;1H[[m[2;1H▽[22;8H[38;5;81m^[[m[6n[38;5;81m^[[m[2;1H  [38;5;81m^[[m[1;1H[38;5;81m^[[m[>c[38;5;81m^[[m]10;?[38;5;81m^G^[[m]11;?[38;5;81m^G^[[m[1;1H[38;5;81m^[[m[35m#include [38;5;81m^[[m[m[38;5;81m^[[m[[[23;1H31m<iostream>[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H295,1[9C19%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;65H6[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H7[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H8[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^[[m[35m#include [38;5;81m^[[m[m[38;5;81m^[[m[31m<cstdlib>[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H299,1[9C19%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;1H[38;5;81m^M
^[[m[32mstatic[38;5;81m^[[m[m [38;5;81m^[[m[32mvoid[38;5;81m^[[m[m[38;5;81m^M[m
sayHello([38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mchar[38;5;81m^[[m[m *name)[38;5;81m^M[m
{[38;5;81m^M[m[24;63H[K[24;63H300,1[9C19%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;3Hstd::cout << [38;5;81m^[[m[31m"hello "[38;5;81m^[[m[m << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H301,1[9C19%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H}[38;5;81m^M[m[24;63H[K[24;63H302,1[9C19%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^M[m[24;63H[K[24;63H303,1[9C19%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^[[m[32mint[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H304,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[18;1H[46m{

}[m


main([38;5;81m^[[m[32mint[38;5;81m^[[m[m argc, [38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mchar[38;5;81m^[[m[m *argv[])[38;5;81m^M[m[24;63H[K[24;63H305,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[17;1H{

}[23;1H{[38;5;81m^M[m[24;63H[K[24;63H306,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[16;1H[46m{

}[m[23;3H[38;5;81m^[[m[33mif[38;5;81m^[[m[m (argc == [38;5;81m^[[m[31m1[38;5;81m^[[m[m) {[38;5;81m^M[m[24;63H[K[24;63H307,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[14;1H{

}[22;5Hstd::cerr << [38;5;81m^[[m[31m"usage: "[38;5;81m^[[m[m << argv[[38;5;81m^[[m[31m0[38;5;81m^[[m[m] << [38;5;81m^[[m[31m" NAME..."[38;5;81m^[[m[[[23;1Hm << std::endl;[38;5;81m^M[m[24;63H[K[24;63H308,1[9C20%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H9[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;5Hstd::exit([38;5;81m^[[m[31m1[38;5;81m^[[m[m);[38;5;81m^M[m[24;63H[K[24;63H310,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;3H}[38;5;81m^M[m[24;63H[K[24;63H311,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;3H[38;5;81m^[[m[33melse[38;5;81m^[[m[m {[38;5;81m^M[m[24;63H[K[24;63H312,1[9C20%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;5H[38;5;81m^[[m[33mfor[38;5;81m^[[m[m ([38;5;81m^[[m[32mint[38;5;81m^[[m[m i = [38;5;81m^[[m[31m1[38;5;81m^[[m[m; i <= argc; i++) {[38;5;81m^[[m[19;7HsayHee[23;1Hllo(argv[i]);[38;5;81m^M[m[24;63H[K[24;63H313,1[9C20%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;5H}[38;5;81m^M[m
  }[38;5;81m^M[m
}[38;5;81m^M
^[[m[1m[38;5;81m^[[m[34m~[94m@@@                                                                             [m[24;63H[K[24;63H314,1[9C20%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;65H5[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H6[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H7[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [20;1H[24;65H8[20;1H[?25h[?25l[24;53H~@k[20;1H[24;53H   [4;1H[1;23r[1;1H[17M[1;24r[6;1H[38;5;81m^[[m[1m[38;5;81m^[[m[34m~                                                                     [7;1H    [38;5;81m^[[m[24;1H~[66C  [8;1H     [38;5;81m^[[m[25;1H~[65C  [9;1H      [38;5;81m^[[m[26;1H~[64C  [10;1H       [38;5;81m^[[m[27;1H~[63C  [11;1H [7C[38;5;81m^[[m[28;1H~[62C  [12;1H [8C[38;5;81m^[[m[29;1H~[61C  [13;1H [9C[38;5;81m^[[m[30;1H~[60C  [14;1H [10C[38;5;81m^[[m[31;1H~[59C  [15;1H [11C[38;5;81m^[[m[32;1H~[58C  [16;1H [12C[38;5;81m^[[m[33;1H~[57C  [17;1H [13C[38;5;81m^[[m[34;1H~[56C  [18;1H [14C[38;5;81m^[[m[35;1H~[55C  [19;1H [15C[38;5;81m^[[m[m[38;5;81m^[[m[36;56H1,1[38;5;81m^[[m[11CAll[38;5;81m^[[m[1;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[1;11[20;1HH[38;5;81m^[[m[36;46H   [38;5;81m^[[m[2;1H[38;5;81m^[[m[36;56H2[38;5;81m^[[m[2;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[2;1H[38;5;81m^[[m[36;46H  [21;1H  [38;5;81m^[[m[3;1H[38;5;81m^[[m[36;56H3,0-1[38;5;81m^[[m[3;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[3;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[4;;[22;1H1H[38;5;81m^[[m[36;56H4,1  [38;5;81m^[[m[4;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[4;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[5;1H[38;5;81m^[[m[366[23;1H;56H5[38;5;81m^[[m[5;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[5;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[6;1H[38;5;81m^[[m[46m{[38;5;81m^M[m[24;63H[K[24;63H319,1[9C21%[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [5;1H[24;64H20[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [3;1H[1;23r[1;1H[3M[1;24r[21;1H[38;5;81m^M[m
}[38;5;81m^[[m[m[38;5;81m^[[m[36;56H6[38;5;81m^[[m[6;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[6;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[7;1H[38;5;81m^[[m[6;11[23;1HH{[38;5;81m^M[m[24;63H[K[24;63H321,1[9C21%[3;1H[?25h[?25l[24;53H~@k[3;1H[24;53H   [19;1H[1;23r[1;1H[2M[1;24r[22;1H[38;5;81m^M[m
}[38;5;81m^[[m[36;56H7[38;5;81m^[[m[7;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[7;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[8;1H[38;5;81m^[[m[6;1H[38;5;81m^[[m[[23;1H[94m@@@                                                                             [m[24;63H[K[24;63H322,1[9C21%[19;1H[?25h[?25l[24;53H~@k[19;1H[24;53H   [20;1H[18;71H[46m{

}[m[78C11[21;1HH[24;65H3[20;1H[?25h[?25l[24;53H~@k[20;1H[24;53H   [4;1H[1;23r[1;1H[18M[1;24r[2;1H}[78C11[3;1HH

}[38;5;81m^[[m[36;56H7[38;5;81m^[[m[7;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[7;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[8;1H[38;5;81m^[[m[6;1H[38;5;81m^[[m[[[6;1H46m{[38;5;81m^M
^M[m
}[38;5;81m^[[m[m[38;5;81m^[[m[36;56H8[38;5;81m^[[m[8;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[6;1H{[38;5;81m^M
^M[m
}[38;5;81m^[[m[36;56H9,0-1[38;5;81m^[[m[9;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[9;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[10;1H[38;5;81m^[[m[366[11;1H;56H10,1 [38;5;81m^[[m[10;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[10;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[11;1H[38;5;81m^[[m[36;57HH[12;1H1[38;5;81m^[[m[11;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[11;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[12;1H[38;5;81m^[[m[46m{[38;5;81m^[[m[22;1H}[38;5;81m^^[13;1H[[m[m[38;5;81m^[[m[36;57H2[38;5;81m^[[m[12;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[12;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[13;1H[38;5;81m^[[m[122[14;1H;1H{[38;5;81m^[[m[22;1H}[38;5;81m^[[m[36;57H3[38;5;81m^[[m[13;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[13;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[[[15;1H14;1H[38;5;81m^[[m[36;57H4[38;5;81m^[[m[14;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[14;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[15;1H[38;5;81m^[[m[[[16;1H36;57H5[38;5;81m^[[m[15;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[15;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[16;1H[38;5;81m^[[m[36;57H6[38;5;81m^^[17;1H[[m[16;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[16;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[17;1H[38;5;81m^[[m[36;57H7[38;5;81m^[[m[17;1H[38;5;81m^^[18;1H[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[17;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[18;1H[38;5;81m^[[m[36;57H8[38;5;81m^[[m[18;1H[38;5;81m^[[m[?25h[38;5;81m^[[[m[19;1H[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[18;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[19;1H[38;5;81m^[[m[36;57H9[38;5;81m^[[m[19;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[[[20;1H36;46H~@k[38;5;81m^[[m[19;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[20;1H[38;5;81m^[[m[36;56H20[38;5;81m^[[m[20;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~~[21;1H@k[38;5;81m^[[m[20;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[21;1H[38;5;81m^[[m[36;57H1[38;5;81m^[[m[21;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[21;;[22;1H1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[20;1H[38;5;81m^[[m[36;57H0[38;5;81m^[[m[20;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[20;1H[38;5;81m^[[m[36;;[23;1H46H   [38;5;81m^[[m[19;1H[38;5;81m^[[m[36;56H19[38;5;81m^[[m[19;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[19;1H[38;5;81m^[[m[36;46H   [38;5;81m^[m[23;1H[94m@@@                                                                             [m[24;63H[K[24;63H324,1[9C22%[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [4;1H[1;23r[23;1H
[1;24r[2;2H[46m{

}[m[78C[[[5;1H4[22;1H46H   [38;5;81m^[[m[19;1H[38;5;81m^[[m[36;56H19[38;5;81m^[[m[19;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[19;1H[38;5;81m^[[m[36;46H   [38;5;81m^^[23;1H[[m[18;1H[38;5;81m^[[m[36;57H8[38;5;81m^[[m[18;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[18;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[18;1H[38;5;81m^[m[23;1H[94m@@@                                                                             [m[24;63H[K[24;63H325,1[9C22%[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [6;1H[2;2H{

}[78C[[[5;1H4[24;65H6[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [7;1H[5;4H[46m{

}[m[24;65H7[7;1H[?25h[?25l[24;53H~@k[7;1H[24;53H   [8;1H[5;4H{

}[24;65H8[8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [1;1H[1;23r[1;1H[8M[1;24r[15;1H[38;5;81m[[m[18;1H[38;5;81m^[[m[36;57H8[38;5;81m^[[m[18;1H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;46H~@k[38;5;81m^[[m[18;1H[38;5;81m^[[m[36;46H   [38;5;81m^[[m[18;1H[38;5;81m^^[16;1H[[m[36;1H[38;5;81m^[[m[1m-- INSERT --[38;5;81m^[[m[m[38;5;81m^[[m[36;13H[38;5;81m^[[m[K[38;5;81m^[[m[36;56H18,1[38;5;81m^[[m[10CAll[38;5;81m^[[m[18;1H[38;5;81m^[[m[?25h[38;5;81m^[[[m[17;1H[?25l[38;5;81m^[[m[36;59H2[38;5;81m^[[m[18;2H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;59H3[38;5;81m^[[m[18;3H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;59H4[38;5;81m^^[18;1H[[m[18;4H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;59H5[38;5;81m^[[m[18;5H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;59H6[38;5;81m^[[m[18;6H[38;5;81m^[[m[?25h[38;5;81m^[[[m[19;1H[?25l[38;5;81m^[[m[36;59H7[38;5;81m^[[m[18;7H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;59H8[38;5;81m^[[m[18;8H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l [38;5;81m^[[m[46m([38;5;81m^[[m[[[20;1H25C)[38;5;81m^[[m[m[38;5;81m^[[m[36;59H9[38;5;81m^[[m[18;9H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;59H10[38;5;81m^[[m[18;10H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^H[m([38;5;81m^[[m[[[21;1H25C)[38;5;81m^[[m[36;60H1[38;5;81m^[[m[18;11H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;60H2[38;5;81m^[[m[18;12H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;60H33[22;1H[38;5;81m^[[m[18;13H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;60H4[38;5;81m^[[m[18;14H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;60H5[38;5;81m^[[m[18;15H[38;5;81m^[[m[?22[23;1H5h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;60H6[38;5;81m^[[m[18;16H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36;60H7[38;5;81m^[[m[18;17H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[36[24;63H[K[24;63H329,1[9C22%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[27m[23m[29m[m[H[2J[1;1H[38;5;81m^[[m[?2004l[38;5;81m^[[m[?1l[38;5;81m^[[m>[38;5;81m^[[m[?25h[38;5;81m^[[m[?1049l[38;5;81m^[[m[23;0;0tamchugh2@remote06:~/i240b/submit/labb[2;1H2/1-hello$ make[38;5;81m^M[m
g++ -g -Wall -std=c++17    hello.cc   -o hello[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ ./hello st[38;5;81m^H^[[m[K[38;5;81m^H^[[m[Kbart lisa[38;5;81m^M[m[5;1Hhello bart[38;5;81m^M[m
hello lisa[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/1-hello$ cd ..[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ s[38;5;81m^H^[[m[Kls[38;5;81m^M[m
1-hello  2-hello  3-overload  lab2.LOG  Makefile[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ cd[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mcd 2-hello[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ make[38;5;81m^M[m
g++ -g -Wall -std=c++17    hello.cc   -o hello[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[m./hello lisa bartt[14;1H[38;5;81m^M[m
Hello Lisa[38;5;81m^M[m
Hello Bart[38;5;81m^M[m
Segmentation fault[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./hello lisa lisa lisa lis [38;5;81m^M[ma[38;5;81m^M[m
Hello Lisa[38;5;81m^M[m
Hello Lisa[38;5;81m^M[m
Hello Lisa[38;5;81m^M[m
Hello Lisa[38;5;81m^M[m
Segmentation fault[38;5;81m^M[m[24;63H330,1[9C22%[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [3;1H[24;65H1[3;1H[?25h[?25l[24;53H~@k[3;1H[24;53H   [4;1H[24;65H2[4;1H[?25h[?25l[24;53H~@k[4;1H[24;53H   [5;1H[24;65H3[5;1H[?25h[?25l[24;53H~@k[5;1H[24;53H   [6;1H[24;65H4[6;1H[?25h[?25l[24;53H~@k[6;1H[24;53H   [7;1H[24;65H5[7;1H[?25h[?25l[24;53H~@k[7;1H[24;53H   [8;1H[24;65H6[8;1H[?25h[?25l[24;53H~@k[8;1H[24;53H   [9;1H[24;65H7[9;1H[?25h[?25l[24;53H~@k[9;1H[24;53H   [10;1H[24;65H8[10;1H[?25h[?25l[24;53H~@k[10;1H[24;53H   [11;1H[24;65H9[11;1H[?25h[?25l[24;53H~@k[11;1H[24;53H   [12;1H[24;64H40[12;1H[?25h[?25l[24;53H~@k[12;1H[24;53H   [13;1H[24;65H1[13;1H[?25h[?25l[24;53H~@k[13;1H[24;53H   [15;1H[24;65H2[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;65H3[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H4[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H5[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hamchugh2@remote06:~/i240b/submit/lab2/2-hello$ ,.[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[m./ 'lisa' 'bart'[38;5;81m^^[23;1HM[m[24;63H[K[24;63H346,1[9C22%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H7[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hbash: ./: Is a directory[38;5;81m^M[m[24;63H[K[24;63H348,1[9C22%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hamchugh2@remote06:~/i240b/submit/lab2/2-hello$ ./helll[38;5;81m^H^[[m[Ko 'lsia'[38;5;81m^H^[[m[K[38;5;81m^H^[[m[KK[23;1H[38;5;81m^H^[[m[K[38;5;81m^H^[[m[Kisa' bar[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K'bart'[38;5;81m^M[m[24;63H[K[24;63H349,1[9C23%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;64H50[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1HHello Lisa[38;5;81m^M[m
Hello Bart[38;5;81m^M[m[24;63H[K[24;63H351,1[9C23%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1HSegmentation fault[38;5;81m^M[m[24;63H[K[24;63H352,1[9C23%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [17;1H[1;23r[1;1H[2M[1;24r[22;1Hamchugh2@remote06:~/i240b/submit/lab2/2-hello$ cd[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mls[38;5;81m^M[m
hello  hello.cc  Makefile  README[38;5;81m^M[m[24;63H[K[24;63H353,1[9C23%[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1Hamchugh2@remote06:~/i240b/submit/lab2/2-hello$ c[38;5;81m^H^[[m[K[38;5;81m^G[mvim hello.cc[38;5;81m^M[m[24;63H[K[24;63H354,1[9C23%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;1H[38;5;81m^[[m[?1000h[38;5;81m^[[m[?2004h[38;5;81m^[[m[?1049h[38;5;81m^[[m[22;0;0t[38;5;81m^[[m[?1h[38;5;81m^[[m=[38;5;81m^[[m[?2004h[38;5;81m^[[m[1;36r[38;5;81m^[[m[?12h[38;5;81m^[[m[?12l[38;5;81m^[[m[[[21;1H22;2t[38;5;81m^[[m[22;1t[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[36;1H"hello.cc" 48L, 1011CC[22;1H[38;5;81m^[[m[2;1H▽[22;9H[38;5;81m^[[m[6n[38;5;81m^[[m[2;1H  [38;5;81m^[[m[1;1H[38;5;81m^[[m[>c[38;5;81m^[[m]10;?[38;5;81m^G^[[m]11;?[38;5;81m^G^[[m[1;1H[38;5;81m^[[m[35m#include [38;5;81m^[[m[m[38;5;81m^[[[m[23;1H[31m<locale>[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H355,1[9C23%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;1H[24;65H6[16;1H[?25h[?25l[24;53H~@k[16;1H[24;53H   [17;1H[24;65H7[17;1H[?25h[?25l[24;53H~@k[17;1H[24;53H   [18;1H[24;65H8[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^[[m[35m#include [38;5;81m^[[m[m[38;5;81m^[[m[31m<iostream>[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H359,1[9C23%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [15;1H[1;23r[1;1H[4M[1;24r[20;1H[38;5;81m^[[m[35m#include [38;5;81m^[[m[m[38;5;81m^[[m[31m<cstdlib>[38;5;81m^[[m[m[38;5;81m^M
^[[m[35m#include [38;5;81m^[[m[m[38;5;81m^[[m[31m<cstring>[38;5;81m^[[m[m[38;5;81m^M
^M
^[[m[34m/** Upcase the initial letter of each word from in, copying the[38;5;81m^M[m[24;63H[K[24;63H360,1[9C23%[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2H*  results into out.  The caller is responsible to ensure that out[38;5;81m^M[m[24;63H[K[24;63H361,1[9C24%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;2H*  has enough space for the strlen(in) characters of in.[38;5;81m^M[m[24;63H[K[24;63H362,1[9C24%[18;1H[?25h[?25l[24;53H/[18;1H[24;53H[K[24;1H/[?2004h[?25h0[?25l[1;23r[1;1H[12M[1;24r[12;2H*/[38;5;81m^[[m[m[38;5;81m^M
^[[m[32mvoid[38;5;81m^[[m[m[38;5;81m^M[m
upcaseWords([38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mchar[38;5;81m^[[m[m in[], [38;5;81m^[[m[32mchar[38;5;81m^[[m[m out[])[38;5;81m^M[m
{[38;5;81m^M
[m  [38;5;81m^[[m[32mbool[38;5;81m^[[m[m inWord = [38;5;81m^[[m[31mfalse[38;5;81m^[[m[m;[38;5;81m^M
[m  [38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mint[38;5;81m^[[m[m n = std::strlen(in);[38;5;81m^M
[m  [38;5;81m^[[m[33mfor[38;5;81m^[[m[m ([38;5;81m^[[m[32mint[38;5;81m^[[m[m i = [38;5;81m^[[m[31m[7m0[m[38;5;81m^[[m[m; i < n; i++) {[38;5;81m^M
[m    [38;5;81m^[[m[33mif[38;5;81m^[[m[m (!inWord && std::isalpha(in[i])) {[38;5;81m^[[m[17;7Hout[i] = std::toupperr[20;1H(in[i]);[38;5;81m^M[m
    }[38;5;81m^M
[m    [38;5;81m^[[m[33melse[38;5;81m^[[m[m {[38;5;81m^[[m[20;7Hout[i] = in[i];[38;5;81m^M[m
    }[38;5;81m^M[m[24;1H[K[24;63H374,37-42     24%/0[24;63H[K[24;3H[?25h2[?25l[27m[23m[29m[m[H[2J[1;1HContinuing.[38;5;81m^M[m
f(a) = 3; f(&a) = 10; f(a, b) = 2[38;5;81m^M[m
[Inferior 1 (process 2308679) exited normally][38;5;81m^M[m
(gdb) q[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2/3-overload$ cd ..[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ ls[38;5;81m^M[m
1-hello  2-hello  3-overload  lab2.LOG  Makefile[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ cd[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mcd la[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^HH[9;1H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mvim lab2.LOG[38;5;81m^M
^[[m[?1000h[38;5;81m^[[m[?2004h[38;5;81m^[[m[?1049h[38;5;81m^[[m[22;0;0t[38;5;81m^[[m[?1h[38;5;81m^[[m=[38;5;81m^[[m[?2004h[38;5;81m^[[m[1;36r[38;5;81m^[[m[?12h[38;5;81m^[[m[?12l[38;5;81m^[[m[[[11;1H22;2t[38;5;81m^[[m[22;1t[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[36;1H"lab2.LOG" [noeol] 466[12;1H2L, 49152C[38;5;81m^[[m[2;1H▽[12;19H[38;5;81m^[[m[6n[38;5;81m^[[m[2;1H  [38;5;81m^[[m[1;1H[38;5;81m^[[m[>c[38;5;81m^[[m]10;?[38;5;81m^G^[[m]11;?[38;5;81m^G^[[m[1;1HScript starr[13;1Hted on 2[7m02[m0-02-05 21:28:37-05:00 [TERM="xterm" TTY="/dev/pts/22[38;5;81m^[[m[2;1H" COLUMNS==[14;1H"100" LINES="35"][38;5;81m^M[m
bash: /home/umrigar/cs240/bin/student.rc: Permission denied[38;5;81m^[[m[34m^M[38;5;81m^[[m[m[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ ls[38;5;81m^[[m[34m^M[38;5;81m^[[m[m[38;5;81m^M[m
lab2.LOG[38;5;81m^[[m[34m^M[38;5;81m^[[m[m[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ git pull[38;5;81m^[[m[34m^H^[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^H^[[38;5;81m^[[m[m[K[38;5;81m^^[19;1H[[m[34m^H^[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^H^[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^HH[38;5;81m^[[m[7;1H^[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^H^[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^H^^[20;1H[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^H^[[38;5;81m^[[m[m[K[38;5;81m^[[m[34m^G^G^G^G^G^G^G^G^G^G^G^G^G^G[38;5;81m^[[m[mcd [38;5;81m^[[m[34m^M[38;5;81m^[[m[m[38;5;81m^M[m
amchugh2@remote06:~$ ls[38;5;81m^[[m[34m^M[38;5;81m^[[m[m[38;5;81m^M[m
amchugh2.circ  cs120lab7  Downloads[38;5;81m^[[m[7Ci220a.bak  lab2[38;5;81m^[[m[7Clab8      [38;5;81m^[[m[10;1H TT[23;1Hemplates[38;5;81m^[[m[34m^M[38;5;81m^[[m[m[38;5;81m^M[m[24;63H582,221-249   39%/02[24;63H[K[24;4H[?25h-[?25l[13;9H020-[7m02-[m[64C==[14;1H"[24;63H582,225-253   39%[24;63H[K[24;5H[?25h0[?25l[13;16H[7m0[m[63C==[14;1H"[24;63H582,225-253   39%[24;63H[K[24;6H[?25h6[?25l[27m[23m[29m[m[H[2J[1;1Hcp: cannot stat '/home/amchugh2/i240b/submit/lab2/.LOG': No such file or directoo[2;1Hry[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit$ cp -r ~/i240b/submit/lab2/.LOG .[38;5;81m^H^H^H^H^H^H^HH[4;1H^H^H^H^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[[m[5;1H[K*.log[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[KLOG .[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit$ ls[38;5;81m^M[m
lab0  lab1  lab2  lab2.LOG[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit$ cd lab2[38;5;81m^M[m
amchugh2@remote06:~/i240b/submit/lab2$ exit[38;5;81m^M[m

Script done on 2020-02-05 21:49:26-05:00 [COMMAND_EXIT_CODE="0"]
Script started on 2020-[7m02-06[m 15:00:46-05:00 [TERM="xterm-256color" TTY="/dev/ptss[13;1H/0" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied[38;5;81m^M[m
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ ./hello abby brenn[16;1Hdan sara charles[38;5;81m^[[m[A[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[CC[17;1H[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[CC[18;1H[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[Cmake[38;5;81m^[[m[K[38;5;81m^M
^M^[[m[K[38;5;81m^[[m[A[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[20;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[21;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[22;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G^G^G[mlab[38;5;81m^H^[[m[K[38;5;81m^H^^[23;1H[[m[K[38;5;81m^H^[[m[K[38;5;81m^G[mc[38;5;81m^H^[[m[Kls[38;5;81m^M[m[24;63H612,24[8C41%/02-06[24;63H[K[24;7H[?25h[?25l[12;24H02-06[51Css[13;1H/[24;63H612,24[8C41%[12;24H[?25h[?25l[24;53H~@k[12;24H[24;53H   [14;24H[24;65H3[14;24H[?25h[?25l[24;53H~@k[14;24H[24;53H   [15;24H[24;65H4[15;24H[?25h[?25l[24;53H~@k[15;24H[24;53H   [14;23H[1;23r[1;1H[5M[1;24r[19;1H1-hello  2-hello  3-overload  lab0  lab1  lab2.LOG  Makefile[38;5;81m^M[m
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ cd 2-e[38;5;81m^H^[[m[Khelloo[21;1H[38;5;81m^M[m
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ ls[38;5;81m^M[m
hello  hello.cc  Makefile  README[38;5;81m^M[m[24;1H[K[24;63H615,17-23     41%[14;23H[?25h[?25l[24;53H~@k[14;23H[24;53H   [13;24H[1;23r[1;1H[6M[1;24r[18;1Hamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2/2-hello$ cd hello..[19;1H [38;5;81m^M[mc[38;5;81m^M^[[m[K[38;5;81m^[[m[A[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[20;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[21;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[22;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[23;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[K[38;5;81m^M[m[24;63H[K[24;63H616,24[8C41%[13;24H[?25h[?25l[24;53H~@k[13;24H[24;53H   [14;24H[24;65H7[14;24H[?25h[?25l[24;53H~@k[14;24H[24;53H   [16;24H[24;65H8[16;24H[?25h[?25l[24;53H~@k[16;24H[24;53H   [17;24H[24;65H9[17;24H[?25h[?25l[24;53H~@k[17;24H[24;53H   [11;24H[1;23r[1;1H[7M[1;24r[17;1H[38;5;81m^M^[[m[K[38;5;81m^[[m[A[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[18;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[19;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[20;1H[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[m[C[38;5;81m^[[[m[21;1H[C[38;5;81m^[[m[C[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^H^[[m[K[38;5;81m^G^G^G[mvim hello [38;5;81m^M[m.cc[38;5;81m^M
^[[m[?1000h[38;5;81m^[[m[?2004h[38;5;81m^[[m[?1049h[38;5;81m^[[m[22;0;0t[38;5;81m^[[m[?1h[38;5;81m^[[m=[38;5;81m^[[m[?2004h[38;5;81m^[[m[1;24r[38;5;81m^[[m[?12h[38;5;81m^[[m[?12l[38;5;81m^[[m[[[23;1H22;2t[38;5;81m^[[m[22;1t[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[24;1H"hello.cc" 49L, 1063C[23;1H[94m@@@                                                                             [m[24;63H[K[24;63H620,24[8C42%[11;24H[?25h[?25l[24;53H~@k[11;24H[24;53H   [12;23H[1;23r[1;1H[5M[1;24r[18;1H22;2t[38;5;81m^[[m[22;1t[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[24;1H"hello.cc" 49L, 1063CC[19;1H[38;5;81m^[[m[2;1H▽[19;9H[38;5;81m^[[m[6n[38;5;81m^[[m[2;1H  [38;5;81m^[[m[1;1H[38;5;81m^[[m[>c[38;5;81m^[[m]10;?[38;5;81m^G^[[m]11;?[38;5;81m^G^[[m[1;1H[38;5;81m^[[m[32mstatic[38;5;81m^[[m[m [38;5;81m^[[m[33[20;1H2mvoid[38;5;81m^[[m[m[38;5;81m^M[m
sayHello([38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mchar[38;5;81m^[[m[m *name)[38;5;81m^M[m
{[38;5;81m^M[m
  std::cout << [38;5;81m^[[m[31m"Hello "[38;5;81m^[[m[m << name << std::endl;[38;5;81m^M[m[24;63H[K[24;63H621,17-23     42%[12;23H[?25h[?25l[24;53H~@k[12;23H[24;53H   [12;24H[1;23r[1;1H[5M[1;24r[19;1H}[38;5;81m^M
^M
^M
^[[m[32mint[38;5;81m^[[m[m[38;5;81m^M[m
main([38;5;81m^[[m[32mint[38;5;81m^[[m[m argc, [38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mchar[38;5;81m^[[m[m *argv[])[38;5;81m^M[m[24;63H[K[24;63H622,21-24     42%[12;24H[?25h[?25l[24;53H~@k[12;24H[24;53H   [16;24H[24;65H3,22[16;24H[?25h[?25l[24;53H~@k[16;24H[24;53H   [17;2H[24;65H4,2    [17;2H[?25h[?25l[24;53H~@k[17;2H[24;53H   [18;24H[24;65H5,23-24[18;24H[?25h[?25l[24;53H~@k[18;24H[24;53H   [13;2H[1;23r[1;1H[6M[1;24r[18;1H{[38;5;81m^M
[m  [38;5;81m^[[m[38;5;130mif[38;5;81m^[[m[m (argc == [38;5;81m^[[m[31m1[38;5;81m^[[m[m) {[38;5;81m^M[m
    std::cerr << [38;5;81m^[[m[31m"usage: "[38;5;81m^[[m[m << argv[[38;5;81m^[[m[31m0[38;5;81m^[[m[m] << [38;5;81m^[[m[31m" NAME..."[38;5;81m^[[m[[[21;1Hm << std::endl;[38;5;81m^M[m
    std::exit([38;5;81m^[[m[31m1[38;5;81m^[[m[m);[38;5;81m^M[m
  }[38;5;81m^M[m[24;63H[K[24;63H626,2[9C42%[13;2H[?25h[?25l[24;53H~@k[13;2H[24;53H   [14;1H[24;65H7,1[14;1H[?25h[?25l[24;53H~@k[14;1H[24;53H   [15;1H[24;65H8[15;1H[?25h[?25l[24;53H~@k[15;1H[24;53H   [16;14H[24;65H9,12-14[16;14H[?25h[?25l[24;53H~@k[16;14H[24;53H   [17;24H[24;64H30,22-2[17;24H[?25h[?25l[24;53H~@k[17;24H[24;53H   [18;2H[24;65H1,2    [18;2H[?25h[?25l[24;53H~@k[18;2H[24;53H   [14;24H[1;23r[1;1H[5M[1;24r[19;3H[38;5;81m^[[m[38;5;130melse[38;5;81m^[[m[m {[38;5;81m^M
[m    [38;5;81m^[[m[38;5;130mfor[38;5;81m^[[m[m ([38;5;81m^[[m[32mint[38;5;81m^[[m[m i = [38;5;81m^[[m[31m1[38;5;81m^[[m[m; i <= argc; i++) {[38;5;81m^[[m[17;77[21;1HH[38;5;81m^[[m[32mconst[38;5;81m^[[m[m [38;5;81m^[[m[32mchar[38;5;81m^[[m[m *name = argv[i];[38;5;81m^[[m[18;7H[38;5;81m^[[m[32mchar[38;5;81m^[[m[m friendlyNN[22;1Hame[strlen(name)];[38;5;81m^[[m[19;7HupcaseWords(name, friendlyName);[38;5;81m^[[m[20;7HsayHello(frienn[23;1HdlyName);[38;5;81m^M[m[24;63H[K[24;63H632,22-24     42%[14;24H[?25h[?25l[24;53H~@k[14;24H[24;53H   [15;24H[24;65H3,23[15;24H[?25h[?25l[24;53H~@k[15;24H[24;53H   [17;24H[24;65H4,22[17;24H[?25h[?25l[24;53H~@k[17;24H[24;53H   [18;4H[24;65H5,4    [18;4H[?25h[?25l[24;53H~@k[18;4H[24;53H   [15;24H[1;23r[1;1H[4M[1;24r[15;24H[46m{[m[20;5H}[38;5;81m^M[m
  [46m}[m[38;5;81m^M[m
}[38;5;81m^[[m[24;63H42,36[38;5;81m^[[m[9CBot[38;5;81m^[[m]2;hello.cc (~/projects/i240b/submit/lab2/2-hello) - VII[23;1HM[38;5;81m^G^[[m]1;hello.cc[38;5;81m^G^[[m[16;36H[38;5;81m^[[m[?25h[38;5;81m^[[mP+q436f[38;5;81m^[[m\[38;5;81m^[[mP+q6b75[38;5;81m^[[m\[38;5;81m^[[mP+q6b64[38;5;81m^[[m\[38;5;81m^[[mP+q6b72[38;5;81m^[m[23;1H[94m@@@                                                                             [m[24;63H[K[24;63H636,22-24     42%[15;24H[?25h[?25l[24;53H~@k[15;24H[24;53H   [13;24H[1;23r[1;1H[3M[1;24r[12;24H{[18;3H}

M[38;5;81m^G^[[m]1;hello.cc[38;5;81m^G^[[m[16;36H[38;5;81m^[[m[?25h[38;5;81m^[[mP+q436f[38;5;81m^[[m\[38;5;81m^[[mP+q6b75[38;5;81m^[[m\[38;5;81m^[[mP+q6b64[38;5;81m^[[m\[38;5;81m^[[mP+q6b72[38;5;81m^^[21;1H[[m\[38;5;81m^[[mP+q6b6c[38;5;81m^[[m\[38;5;81m^[[mP+q2332[38;5;81m^[[m\[38;5;81m^[[mP+q2334[38;5;81m^[[m\[38;5;81m^[[mP+q2569[38;5;81m^[[m\[38;5;81m^[[mP+q2a37[38;5;81m^[[m\[38;5;81m^[[mP+q6b31[38;5;81m^[[m\[38;5;81m^[[m[?100[22;1H00l[38;5;81m^[[m[?1006h[38;5;81m^[[m[?1002h[38;5;81m^[[m[?1006l[38;5;81m^[[m[?1002l[38;5;81m^[[m[?1006h[38;5;81m^[[m[?1002h[38;5;81m^[[m[27m[38;5;81m^[[m[23m[38;5;81m^[[m[29m[38;5;81m^[[m[m[38;5;81m^^[23;1H[[m[H[38;5;81m^[[m[2J[38;5;81m^[[m[?25l[38;5;81m^[[m[1;1H[38;5;81m^[[m[38;5;121mstatic[38;5;81m^[[m[m [38;5;81m^[[m[38;5;121mvoid[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H637,22-24     43%[13;24H[?25h[?25l[24;53H~@k[13;24H[24;53H   [17;6H[24;65H8,6    [17;6H[?25h[?25l[24;53H~@k[17;6H[24;53H   [18;4H[24;65H9,4[18;4H[?25h[?25l[24;53H~@k[18;4H[24;53H   [14;24H[1;23r[1;1H[5M[1;24r[19;1HsayHello([38;5;81m^[[m[38;5;121mconst[38;5;81m^[[m[m [38;5;81m^[[m[38;5;121mchar[38;5;81m^[[m[m *name)[38;5;81m^M[m
{[38;5;81m^M[m
  std::cout << [38;5;81m^[[m[95m"Hello "[38;5;81m^[[m[m << name << std::endl;[38;5;81m^M[m
}[38;5;81m^M
^M[m[24;63H[K[24;63H640,22-24     43%[14;24H[?25h[?25l[24;53H~@k[14;24H[24;53H   [18;24H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^M[m[24;63H[K[24;63H641,23-24     43%[18;24H[?25h[?25l[24;53H~@k[18;24H[24;53H   [18;2H[1;23r[23;1H
[1;24r[23;1H[38;5;81m^[[m[38;5;121mint[38;5;81m^[[m[m[38;5;81m^M[m[24;63H[K[24;63H642,2[9C43%[18;2H[?25h[?25l[24;53H~@k[18;2H[24;53H   [17;24H[1;23r[1;1H[2M[1;24r[22;1Hmain([38;5;81m^[[m[38;5;121mint[38;5;81m^[[m[m argc, [38;5;81m^[[m[38;5;121mconst[38;5;81m^[[m[m [38;5;81m^[[m[38;5;121mchar[38;5;81m^[[m[m *argv[[[23;1H])[38;5;81m^M[m[24;63H[K[24;63H643,23-24     43%[17;24H[?25h[?25l[24;53H~@k[17;24H[24;53H   [18;2H[24;65H4,2    [18;2H[?25h[?25l[24;53H~@k[18;2H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;1H{[38;5;81m^M[m[24;63H[K[24;63H645,1[9C43%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [18;1H[1;23r[23;1H
[1;24r[23;3H[38;5;81m^[[m[93mif[38;5;81m^[[m[m (argc == [38;5;81m^[[m[95m1[38;5;81m^[[m[m) {[38;5;81m^M[m[24;63H[K[24;63H646,1[9C43%[18;1H[?25h[?25l[24;53H~@k[18;1H[24;53H   [14;20H[1;23r[1;1H[5M[1;24r[19;5Hstd::cerr << [38;5;81m^[[m[95m"usage: "[38;5;81m^[[m[m << argv[[38;5;81m^[[m[95m0[38;5;81m^[[m[m] << [38;5;81m^[[m[95m" NAME..."[38;5;81m^[[m[[[20;1Hm << std::endl;[38;5;81m^M[m
    std::exit([38;5;81m^[[m[95m1[38;5;81m^[[m[m);[38;5;81m^M[m
  }[38;5;81m^M
[m  [38;5;81m^[[m[93melse[38;5;81m^[[m[m {[38;5;81m^M[m[24;63H[K[24;63H647,18-20     44%[14;20H[?25h[?25l[24;53H~@k[14;20H[24;53H   [15;24H[24;65H8,22-24[15;24H[?25h[?25l[24;53H~@k[15;24H[24;53H   [17;2H[24;65H9,2    [17;2H[?25h[?25l[24;53H~@k[17;2H[24;53H   [18;24H[24;64H50,22-24[18;24H[?25h[?25l[24;53H~@k[18;24H[24;53H   [12;24H[1;23r[1;1H[7M[1;24r[17;5H[38;5;81m^[[m[93mfor[38;5;81m^[[m[m ([38;5;81m^[[m[38;5;121mint[38;5;81m^[[m[m i = [38;5;81m^[[m[95m1[38;5;81m^[[m[m; i <= argc; i++) {[38;5;81m^[[m[17;77[18;1HH[38;5;81m^[[m[38;5;121mconst[38;5;81m^[[m[m [38;5;81m^[[m[38;5;121mchar[38;5;81m^[[m[m *name = argv[i];[38;5;81m^[[m[18;7H[38;5;81m^[[m[38;5;121mm[19;1Hchar[38;5;81m^[[m[m friendlyName[strlen(name)];[38;5;81m^[[m[19;7HupcaseWords(name, friendlyName);[38;5;81m^[[m[22[20;1H0;7HsayHello(friendlyName);[38;5;81m^M[m
    }[38;5;81m^M[m
  }[38;5;81m^M[m
}[38;5;81m^[[m[24;63H42,36[38;5;81m^[[m[9CBot[38;5;81m^M[m"hello.cc" 49L, 1063C[38;5;81m^[[m[16;36H[38;5;81m^[[m[?25h[38;5;81m^[[m[?25l[38;5;81m^[[m[24;53H:[38;5;81m^[m[23;1H[94m@@@                                                                             [m[24;63H[K[24;63H651,23-24     44%[12;24H[?25h[?25l[24;53H~@k[12;24H[24;53H   [14;24H[24;65H2,22[14;24H[?25h[?25l[24;53H~@k[14;24H[24;53H   [15;4H[24;65H3,4    [15;4H[?25h[?25l[24;53H^[[15;4H[24;53H  [15;4H[24;53H^[[15;4H[24;53H  [15;4H[?25h[?25l[24;53H:[15;4H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0tamchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit/lab2$ mak[K[K[Kcd ..
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ ls
lab0  lab1  lab2
amchugh2@g7-31:/import/linux/home1/amchugh2/i240b/submit$ cd ~/I240B[K[K[K[K[Ki40[K[K240b
amchugh2@g7-31:~/i240b$ git checkout -b lab2
fatal: A branch named 'lab2' already exists.
amchugh2@g7-31:~/i240b$ exit

Script done on 2020-02-06 15:14:09-05:00 [COMMAND_EXIT_CODE="128"]
